RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
/*
 * Modifications of the original file provided by Freescale Semiconductor and
 * ST Microelectronics are:
 *
 * Copyright (c) 2011 embedded brains GmbH.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/****************************************************************************\
 * PROJECT     : MPC5643L
 * FILE        : mpc5643l.h
 * 
 * DESCRIPTION : This is the header file describing the register
 *               set for the named projects. 
 * 
 * COPYRIGHT   : (c) 2009, Freescale Semiconductor & ST Microelectronics 
 * 
 * VERSION     : 1.04
 * RELEASE DATE        : Tue Dec  1 2009
 * CREATION DATE       : Thu Oct  8 13:53:51 CEST 2009
 * AUTHOR      : generated from IP-XACT database
 * HISTORY     : Preliminary release.
\****************************************************************************/

/*   >>>>  NOTE! this file is auto-generated please do not edit it!  <<<<   */

/****************************************************************************\
 * Example instantiation and use:            
 *                                           
 *  <MODULE>.<REGISTER>.B.<BIT> = 1;         
 *  <MODULE>.<REGISTER>.R       = 0x10000000;
 *                                           
\****************************************************************************/

/*
 *  LICENSE: 
 *  Copyright (c) 2006 Freescale Semiconductor
 *  
 *  Permission is hereby granted, free of charge, to any person 
 *  obtaining a copy of this software and associated documentation 
 *  files (the "Software"), to deal in the Software without 
 *  restriction, including without limitation the rights to use, 
 *  copy, modify, merge, publish, distribute, sublicense, and/or 
 *  sell copies of the Software, and to permit persons to whom the 
 *  Software is furnished to do so, subject to the following 
 *  conditions:
 *  
 *  The above copyright notice and this permission notice 
 *  shall be included in all copies or substantial portions 
 *  of the Software.
 *  
 *  THIS SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, 
 *  EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES 
 *  OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND 
 *  NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT 
 *  HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, 
 *  WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, 
 *  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER 
 *  DEALINGS IN THE SOFTWARE.
 *  
 */

#ifndef _leopard_H_  /* prevents multiple inclusions of this file */
#define _leopard_H_

#ifndef ASM

#include <stdint.h>

#include <mpc55xx/regs-edma.h>

#ifdef  __cplusplus
extern "C" {
#endif

#ifdef __MWERKS__
#pragma push
#pragma ANSI_strict off
#endif

//#define USE_FIELD_ALIASES_CFLASH
//#define USE_FIELD_ALIASES_SIUL
//#define USE_FIELD_ALIASES_SSCM
//#define USE_FIELD_ALIASES_ME
//#define USE_FIELD_ALIASES_RGM
//#define USE_FIELD_ALIASES_ADC
//#define USE_FIELD_ALIASES_CTU
//#define USE_FIELD_ALIASES_mcTIMER
//#define USE_FIELD_ALIASES_mcPWM
//#define USE_FIELD_ALIASES_LINFLEX
//#define USE_FIELD_ALIASES_SPP_MCM
#define USE_FIELD_ALIASES_INTC
#define USE_FIELD_ALIASES_DSPI
//#define USE_FIELD_ALIASES_FLEXCAN
//#define USE_FIELD_ALIASES_FR
//#define USE_FIELD_ALIASES_CMU
//#define USE_FIELD_ALIASES_PLLD
//#define USE_FIELD_ALIASES_SPP_DMA2

/* Define memories */

#define SRAM_START  0x40000000
#define SRAM_SIZE      0x20000
#define SRAM_END    0x4001FFFF

#define FLASH_START         0x0
#define FLASH_SIZE     	0xC0000
#define FLASH_END       0xBFFFF

/****************************************************************/
/*                                                              */
/* Global definitions and aliases */
/*                                                              */
/****************************************************************/
 
/*
   Platform blocks that are only accessible by the second core (core 1) when
    the device is in DPM mode. The block definition is equivalent to the one
    for the first core (core 0) and reuses the related block structure.

   NOTE: the <block_name>_1 defines are the preferred method for programming
 */
#define  PBRIDGE_1     (*(volatile PBRIDGE_tag*)     0x8FF00000UL)
#define  MAX_1         (*(volatile MAX_tag*)      0x8FF04000UL)
#define  MPU_1         (*(volatile MPU_tag*)      0x8FF10000UL)
#define  SEMA4_1       (*(volatile SEMA4_tag*)    0x8FF24000UL)
#define  SWT_1         (*(volatile SWT_tag*)      0x8FF38000UL)
#define  STM_1         (*(volatile STM_tag*)      0x8FF3C000UL)
#define  SPP_MCM_1     (*(volatile SPP_MCM_tag*)  0x8FF40000UL)
#define  SPP_DMA2_1    (*(volatile SPP_DMA2_tag*) 0x8FF44000UL)
#define  INTC_1        (*(volatile INTC_tag*)     0x8FF48000UL)  

