RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
/*
   Platform blocks that are only accessible by the second core (core 1) when
    the device is in DPM mode. The block definition is equivalent to the one
    for the first core (core 0) and reuses the related block structure.

   NOTE: the <block_name>_DPM defines are deprecated, use <block_name>_1 for
         programming the corresponding blocks for new code instead.
 */
#define  PBRIDGE_DPM   PBRIDGE_1
#define  MAX_DPM       MAX_1
#define  MPU_DPM       MPU_1
#define  SEMA4_DPM     SEMA4_1
#define  SWT_DPM       SWT_1
#define  STM_DPM       STM_1
#define  SPP_MCM_DPM   SPP_MCM_1
#define  SPP_DMA2_DPM  SPP_DMA2_1
#define  INTC_DPM      INTC_1

/* Aliases for Pictus Module names */
#define CAN_0     	FLEXCAN_A 
#define CAN_1     	FLEXCAN_B 
#define CTU_0     	CTU   
#define DFLASH    	CRC   
#define DMAMUX    	DMA_CH_MUX 
#define DSPI_0    	DSPI_A 
#define DSPI_1    	DSPI_B 
#define DSPI_2    	DSPI_C 
#define EDMA      	(*(volatile struct EDMA_tag *) 0xFFF44000UL)
#define ETIMER_0  	mcTIMER0
#define ETIMER_1  	mcTIMER1 
#define FLEXPWM_0 	mcPWM_A 
#define FLEXPWM_1 	mcPWM_B 
#define LINFLEX_0 	LINFLEX0 
#define LINFLEX_1 	LINFLEX1 
#define MCM_       	SPP_MCM 
#define PIT       	PIT_RTI 
#define SIU       	SIUL  
#define WKUP      	WKPU 
#define ADC_0      	ADC0
#define ADC_1      	ADC1

/* Other Aliases */
#define  AIPS_DPM   PBRIDGE_1
#define  AIPS_1     PBRIDGE_1
#define  AIPS       PBRIDGE

/****************************************************************/
/*                                                              */
/* Module: CFLASH_SHADOW  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers NVPWD... */

   typedef union {   /* NVPWD0-1 - Non Volatile Private Censorship PassWorD Register */
      uint32_t R;
      struct {
         uint32_t  PWD:32;            /* PassWorD */
      } B;
   } CFLASH_SHADOW_NVPWD_32B_tag;


   /* Register layout for all registers NVSCI... */

   typedef union {   /* NVSCI - Non Volatile System Censoring Information Register */
      uint32_t R;
      struct {
         uint32_t  SC:16;             /* Serial Censorship Control Word */
         uint32_t  CW:16;             /* Censorship Control Word */
      } B;
   } CFLASH_SHADOW_NVSCI_32B_tag;

   typedef union {   /* Non Volatile LML Default Value */
      uint32_t R;
   } CFLASH_SHADOW_NVLML_32B_tag;

   typedef union {   /* Non Volatile HBL Default Value */
      uint32_t R;
   } CFLASH_SHADOW_NVHBL_32B_tag;

   typedef union {   /* Non Volatile SLL Default Value */
      uint32_t R;
   } CFLASH_SHADOW_NVSLL_32B_tag;


   /* Register layout for all registers NVBIU... */

   typedef union {   /* Non Volatile Bus Interface Unit Register */
      uint32_t R;
      struct {
         uint32_t  BI:32;             /* Bus interface Unit */
      } B;
   } CFLASH_SHADOW_NVBIU_32B_tag;

   typedef union {   /* NVUSRO - Non Volatile USeR Options Register */
      uint32_t R;
      struct {
         uint32_t  UO:32;             /* User Options */
      } B;
   } CFLASH_SHADOW_NVUSRO_32B_tag;


   typedef struct CFLASH_SHADOW_BIU_DEFAULTS_struct_tag {

                             /* Non Volatile Bus Interface Unit Register */
      CFLASH_SHADOW_NVBIU_32B_tag NVBIU;  /* relative offset: 0x0000 */
      int8_t CFLASH_SHADOW_BIU_DEFAULTS_reserved_0004[4];

   } CFLASH_SHADOW_BIU_DEFAULTS_tag;


   typedef struct CFLASH_SHADOW_struct_tag { /* start of CFLASH_SHADOW_tag */
      int8_t CFLASH_SHADOW_reserved_0000_C[15832];
      union {
         /* NVPWD0-1 - Non Volatile Private Censorship PassWorD Register */
         CFLASH_SHADOW_NVPWD_32B_tag NVPWD[2];  /* offset: 0x3DD8  (0x0004 x 2) */

         struct {
         /* NVPWD0-1 - Non Volatile Private Censorship PassWorD Register */
            CFLASH_SHADOW_NVPWD_32B_tag NVPWD0;  /* offset: 0x3DD8 size: 32 bit */
            CFLASH_SHADOW_NVPWD_32B_tag NVPWD1;  /* offset: 0x3DDC size: 32 bit */
         };

      };
      union {
           /* NVSCI - Non Volatile System Censoring Information Register */
         CFLASH_SHADOW_NVSCI_32B_tag NVSCI[2];  /* offset: 0x3DE0  (0x0004 x 2) */

         struct {
           /* NVSCI - Non Volatile System Censoring Information Register */
            CFLASH_SHADOW_NVSCI_32B_tag NVSCI0;  /* offset: 0x3DE0 size: 32 bit */
            CFLASH_SHADOW_NVSCI_32B_tag NVSCI1;  /* offset: 0x3DE4 size: 32 bit */
         };

      };
                                       /* Non Volatile LML Default Value */
      CFLASH_SHADOW_NVLML_32B_tag NVLML;   /* offset: 0x3DE8 size: 32 bit */
      int8_t CFLASH_SHADOW_reserved_3DEC[4];
                                       /* Non Volatile HBL Default Value */
      CFLASH_SHADOW_NVHBL_32B_tag NVHBL;   /* offset: 0x3DF0 size: 32 bit */
      int8_t CFLASH_SHADOW_reserved_3DF4[4];
                                       /* Non Volatile SLL Default Value */
      CFLASH_SHADOW_NVSLL_32B_tag NVSLL;   /* offset: 0x3DF8 size: 32 bit */
      int8_t CFLASH_SHADOW_reserved_3DFC_C[4];
      union {
                                           /*  Register set BIU_DEFAULTS */
         CFLASH_SHADOW_BIU_DEFAULTS_tag BIU_DEFAULTS[3];  /* offset: 0x3E00  (0x0008 x 3) */

         struct {
                             /* Non Volatile Bus Interface Unit Register */
            CFLASH_SHADOW_NVBIU_32B_tag NVBIU2;  /* offset: 0x3E00 size: 32 bit */
            int8_t CFLASH_SHADOW_reserved_3E04_I1[4];
            CFLASH_SHADOW_NVBIU_32B_tag NVBIU3;  /* offset: 0x3E08 size: 32 bit */
            int8_t CFLASH_SHADOW_reserved_3E0C_I1[4];
            CFLASH_SHADOW_NVBIU_32B_tag NVBIU4;  /* offset: 0x3E10 size: 32 bit */
            int8_t CFLASH_SHADOW_reserved_3E14_E1[4];
         };

      };
                          /* NVUSRO - Non Volatile USeR Options Register */
      CFLASH_SHADOW_NVUSRO_32B_tag NVUSRO;  /* offset: 0x3E18 size: 32 bit */
   } CFLASH_SHADOW_tag;


#define CFLASH_SHADOW (*(volatile CFLASH_SHADOW_tag *) 0x00F00000UL)



/****************************************************************/
/*                                                              */
/* Module: CFLASH  */
/*                                                              */
/****************************************************************/

   typedef union {   /* MCR - Module Configuration Register */
      uint32_t R;
      struct {
         uint32_t:5;
         uint32_t  SIZE:3;            /* Array Space Size */
         uint32_t:1;
         uint32_t  LAS:3;             /* Low Address Space */
         uint32_t:3;
         uint32_t  MAS:1;             /* Mid Address Space Configuration */
         uint32_t  EER:1;             /* ECC Event Error */
         uint32_t  RWE:1;             /* Read-while-Write Event Error */
         uint32_t  SBC:1;             /* Single Bit Correction */
         uint32_t:1;
         uint32_t  PEAS:1;            /* Program/Erase Access Space */
         uint32_t  DONE:1;            /* modify operation DONE */
         uint32_t  PEG:1;             /* Program/Erase Good */
         uint32_t:4;
         uint32_t  PGM:1;             /* Program Bit */
         uint32_t  PSUS:1;            /* Program Suspend */
         uint32_t  ERS:1;             /* Erase Bit */
         uint32_t  ESUS:1;            /* Erase Suspend */
         uint32_t  EHV:1;             /* Enable High Voltage */
      } B;
   } CFLASH_MCR_32B_tag;

