RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* LML - Low/Mid Address Space Block Locking Register */
      uint32_t R;
      struct {
         uint32_t  LME:1;             /* Low/Mid Address Space Block Enable */
         uint32_t:10;
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  SLOCK:1;           /* Shadow Address Space Block Lock */
#else
         uint32_t  TSLK:1;              /* deprecated name - please avoid */
#endif
         uint32_t:2;
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  MLOCK:2;           /* Mid Address Space Block Lock */
#else
         uint32_t  MLK:2;               /* deprecated name - please avoid */
#endif
         uint32_t:6;
         uint32_t  LLOCK:10;          /* Low Address Space Block Lock */
      } B;
   } CFLASH_LML_32B_tag;

   typedef union {   /* HBL - High Address Space Block Locking Register */
      uint32_t R;
      struct {
         uint32_t  HBE:1;             /* High Address Space Block Enable */
         uint32_t:25;
         uint32_t  HLOCK:6;           /* High Address Space Block Lock */
      } B;
   } CFLASH_HBL_32B_tag;

   typedef union {   /* SLL - Secondary Low/Mid Address Space Block Locking Register */
      uint32_t R;
      struct {
         uint32_t  SLE:1;             /* Secondary Low/Mid Address Space Block Enable */
         uint32_t:10;
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  SSLOCK:1;          /* Secondary Shadow Address Space Block Lock */
#else
         uint32_t  STSLK:1;             /* deprecated name - please avoid */
#endif
         uint32_t:2;
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  SMLOCK:2;          /* Secondary Mid Address Space Block Lock */
#else
         uint32_t  SMK:2;               /* deprecated name - please avoid */
#endif
         uint32_t:6;
         uint32_t  SLLOCK:10;         /* Secondary Low Address Space Block Lock */
      } B;
   } CFLASH_SLL_32B_tag;

   typedef union {   /* LMS - Low/Mid Address Space Block Select Register */
      uint32_t R;
      struct {
         uint32_t:14;
         uint32_t  MSL:2;             /* Mid Address Space Block Select */
         uint32_t:6;
         uint32_t  LSL:10;            /* Low Address Space Block Select */
      } B;
   } CFLASH_LMS_32B_tag;

   typedef union {   /* HBS - High Address Space Block Select Register */
      uint32_t R;
      struct {
         uint32_t:26;
         uint32_t  HSL:6;             /* High Address Space Block Select */
      } B;
   } CFLASH_HBS_32B_tag;

   typedef union {   /* ADR - Address Register */
      uint32_t R;
      struct {
         uint32_t  SAD:1;             /* Shadow Address */
         uint32_t:10;
         uint32_t  ADDR:18;           /* Address */
         uint32_t:3;
      } B;
   } CFLASH_ADR_32B_tag;

   typedef union {   /* PFLASH2P_LCA_PFCR0 - Platform Flash Configuration Register 0 */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_APC:5;         /* Bank0+2 Address Pipelining Control */
#else
         uint32_t  BK0_APC:5;          /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_WWSC:5;        /* Bank0+2 Write Wait State Control */
#else
         uint32_t  BK0_WWSC:5;          /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_RWSC:5;        /* Bank0+2 Read Wait State Control */
#else
         uint32_t  BK0_RWSC:5;          /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_RWWC2:1;       /* Bank 0+2 Read While Write Control, bit 2 */
#else
         uint32_t  BK0_RWWC2:1;         /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_RWWC1:1;       /* Bank 0+2 Read While Write Control, bit 1 */
#else
         uint32_t  BK0_RWWC1:1;         /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P1_BCFG:2;     /* Bank0+2 Port 1 Page Buffer Configuration */
#else
         uint32_t  B0_P1_BCFG:2;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P1_DPFE:1;     /* Bank0+2 Port 1 Data Prefetch Enable */
#else
         uint32_t  B0_P1_DPFE:1;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P1_IPFE:1;     /* Bank0+2 Port 1 Inst Prefetch Enable */
#else
         uint32_t  B0_P1_IPFE:1;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P1_PFLM:2;     /* Bank0+2 Port 1 Prefetch Limit */
#else
         uint32_t  B0_P1_PFLM:2;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P1_BFE:1;      /* Bank0+2 Port 1 Buffer Enable */
#else
         uint32_t  B0_P1_BFE:1;         /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_RWWC0:1;       /* Bank 0+2 Read While Write Control, bit 0 */
#else
         uint32_t  BK0_RWWC0:1;         /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P0_BCFG:2;     /* Bank0+2 Port 0 Page Buffer Configuration */
#else
         uint32_t  B0_P0_BCFG:2;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P0_DPFE:1;     /* Bank0+2 Port 0 Data Prefetch Enable */
#else
         uint32_t  B0_P0_DPFE:1;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P0_IPFE:1;     /* Bank0+2 Port 0 Inst Prefetch Enable */
#else
         uint32_t  B0_P0_IPFE:1;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P0_PFLM:2;     /* Bank0+2 Port 0 Prefetch Limit */
#else
         uint32_t  B0_P0_PFLM:2;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  B02_P0_BFE:1;      /* Bank0+2 Port 0 Buffer Enable */
#else
         uint32_t  B0_P0_BFE:1;         /* deprecated name - please avoid */
#endif
      } B;
   } CFLASH_PFCR0_32B_tag;


   /* Register layout for all registers BIU... */

