RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Bus Interface Unit Register */
      uint32_t R;
   } CFLASH_BIU_32B_tag;

   typedef union {   /* PFLASH2P_LCA_PFCR1 - Platform Flash Configuration Register 1 */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_CFLASH         
         uint32_t  B1_APC:5;          /* Bank 1 Address Pipelining Control */          
         uint32_t  B1_WWSC:5;         /* Bank 1 Write Wait State Control */            
         uint32_t  B1_RWSC:5;         /* Bank 1 Read Wait State Control */             
         uint32_t  B1_RWWC2:1;        /* Bank1 Read While Write Control, bit 2 */      
         uint32_t  B1_RWWC1:1;        /* Bank1 Read While Write Control, bit 1 */      
         uint32_t:6;                                                                   
         uint32_t  B1_P1_BFE:1;       /* Bank 1 Port 1 Buffer Enable */                
         uint32_t  B1_RWWC0:1;        /* Bank1 Read While Write Control, bit 0 */      
         uint32_t:6;                                                                   
         uint32_t  B1_P0_BFE:1;       /* Bank 1 Port 0 Buffer Enable */
#else         
         uint32_t BK1_APC:5;
         uint32_t BK1_WWSC:5;
         uint32_t BK1_RWSC:5;
         uint32_t BK1_RWWC2:1;
         uint32_t BK1_RWWC1:1;
         uint32_t:6;
         uint32_t B0_P1_BFE:1;
         uint32_t BK1_RWWC0:1;
         uint32_t:6;
         uint32_t B1_P0_BFE:1;               
#endif
      } B;
   } CFLASH_PFCR1_32B_tag;

   typedef union {   /* PFLASH2P_LCA_PFAPR - Platform Flash Access Protection Register */
      uint32_t R;
      struct {
         uint32_t:6;
         uint32_t  ARBM:2;            /* Arbitration Mode */
         uint32_t  M7PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M6PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M5PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M4PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M3PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M2PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M1PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M0PFD:1;           /* Master x Prefetch Disable */
         uint32_t  M7AP:2;            /* Master 7 Access Protection */
         uint32_t  M6AP:2;            /* Master 6 Access Protection */
         uint32_t  M5AP:2;            /* Master 5 Access Protection */
         uint32_t  M4AP:2;            /* Master 4 Access Protection */
         uint32_t  M3AP:2;            /* Master 3 Access Protection */
         uint32_t  M2AP:2;            /* Master 2 Access Protection */
         uint32_t  M1AP:2;            /* Master 1 Access Protection */
         uint32_t  M0AP:2;            /* Master 0 Access Protection */
      } B;
   } CFLASH_PFAPR_32B_tag;

   typedef union {   /* UT0 - User Test Register */
      uint32_t R;
      struct {
         uint32_t  UTE:1;             /* User Test Enable */
         uint32_t  SBCE:1;            /* Single Bit Correction Enable */
         uint32_t:6;
         uint32_t  DSI:8;             /* Data Syndrome Input */
         uint32_t:10;
         uint32_t  MRE:1;             /* Margin Read Enable */
         uint32_t  MRV:1;             /* Margin Read Value */
         uint32_t  EIE:1;             /* ECC Data Input Enable */
         uint32_t  AIS:1;             /* Array Integrity Sequence */
         uint32_t  AIE:1;             /* Array Integrity Enable */
         uint32_t  AID:1;             /* Array Integrity Done */
      } B;
   } CFLASH_UT0_32B_tag;

   typedef union {   /* UT1 - User Test Register */
      uint32_t R;
   } CFLASH_UT1_32B_tag;

   typedef union {   /* UT2 - User Test Register */
      uint32_t R;
   } CFLASH_UT2_32B_tag;


   /* Register layout for all registers UM... */

   typedef union {   /* UM - User Multiple Input Signature Register */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_CFLASH
         uint32_t  MISR:32;           /* Multiple Input Signature */
#else		 
         uint32_t  MS:32;         /* deprecated - please avoid */
#endif
      } B;
   } CFLASH_UM_32B_tag;


   /* Register layout for generated register(s) UT... */

   typedef union {   /*  */
      uint32_t R;
   } CFLASH_UT_32B_tag;


   /* Register layout for generated register(s) PFCR... */

   typedef union {   /*  */
      uint32_t R;
   } CFLASH_PFCR_32B_tag;



   typedef struct CFLASH_struct_tag { /* start of CFLASH_tag */
                                  /* MCR - Module Configuration Register */
      CFLASH_MCR_32B_tag MCR;              /* offset: 0x0000 size: 32 bit */
                   /* LML - Low/Mid Address Space Block Locking Register */
      CFLASH_LML_32B_tag LML;              /* offset: 0x0004 size: 32 bit */
                      /* HBL - High Address Space Block Locking Register */
      CFLASH_HBL_32B_tag HBL;              /* offset: 0x0008 size: 32 bit */
         /* SLL - Secondary Low/Mid Address Space Block Locking Register */
      CFLASH_SLL_32B_tag SLL;              /* offset: 0x000C size: 32 bit */
                    /* LMS - Low/Mid Address Space Block Select Register */
      CFLASH_LMS_32B_tag LMS;              /* offset: 0x0010 size: 32 bit */
                       /* HBS - High Address Space Block Select Register */
      CFLASH_HBS_32B_tag HBS;              /* offset: 0x0014 size: 32 bit */
                                               /* ADR - Address Register */
      CFLASH_ADR_32B_tag ADR;              /* offset: 0x0018 size: 32 bit */
      union {
         struct {
                                                                     /*  */
            CFLASH_PFCR_32B_tag PFCR[2];   /* offset: 0x001C  (0x0004 x 2) */
            int8_t CFLASH_reserved_0024_E0[12];
         };

                                          /* Bus Interface Unit Register */
         CFLASH_BIU_32B_tag BIU[5];        /* offset: 0x001C  (0x0004 x 5) */

         struct {
                                          /* Bus Interface Unit Register */
            CFLASH_BIU_32B_tag BIU0;       /* offset: 0x001C size: 32 bit */
            CFLASH_BIU_32B_tag BIU1;       /* offset: 0x0020 size: 32 bit */
            CFLASH_BIU_32B_tag BIU2;       /* offset: 0x0024 size: 32 bit */
            CFLASH_BIU_32B_tag BIU3;       /* offset: 0x0028 size: 32 bit */
            CFLASH_BIU_32B_tag BIU4;       /* offset: 0x002C size: 32 bit */
         };

