RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
            int8_t CFLASH_reserved_001C_I3[8];
            CFLASH_PFAPR_32B_tag FAPR;     /* deprecated - please avoid */
            int8_t CFLASH_reserved_0028_E3[8];
         };

         struct {
          /* PFLASH2P_LCA_PFCR0 - Platform Flash Configuration Register 0 */
            CFLASH_PFCR0_32B_tag PFCR0;    /* offset: 0x001C size: 32 bit */
          /* PFLASH2P_LCA_PFCR1 - Platform Flash Configuration Register 1 */
            CFLASH_PFCR1_32B_tag PFCR1;    /* offset: 0x0020 size: 32 bit */
          /* PFLASH2P_LCA_PFAPR - Platform Flash Access Protection Register */
            CFLASH_PFAPR_32B_tag PFAPR;    /* offset: 0x0024 size: 32 bit */
            int8_t CFLASH_reserved_0028_E4[8];
         };

      };
      int8_t CFLASH_reserved_0030_C[12];
      union {
         CFLASH_UT_32B_tag UT[3];          /* offset: 0x003C  (0x0004 x 3) */

         struct {
                                             /* UT0 - User Test Register */
            CFLASH_UT0_32B_tag UT0;        /* offset: 0x003C size: 32 bit */
                                             /* UT1 - User Test Register */
            CFLASH_UT1_32B_tag UT1;        /* offset: 0x0040 size: 32 bit */
                                             /* UT2 - User Test Register */
            CFLASH_UT2_32B_tag UT2;        /* offset: 0x0044 size: 32 bit */
         };

      };
      union {
         CFLASH_UM_32B_tag UMISR[5];       /* offset: 0x0048  (0x0004 x 5) */

                          /* UM - User Multiple Input Signature Register */
         CFLASH_UM_32B_tag UM[5];          /* offset: 0x0048  (0x0004 x 5) */

         struct {
                          /* UM - User Multiple Input Signature Register */
            CFLASH_UM_32B_tag UM0;         /* offset: 0x0048 size: 32 bit */
            CFLASH_UM_32B_tag UM1;         /* offset: 0x004C size: 32 bit */
            CFLASH_UM_32B_tag UM2;         /* offset: 0x0050 size: 32 bit */
            CFLASH_UM_32B_tag UM3;         /* offset: 0x0054 size: 32 bit */
            CFLASH_UM_32B_tag UM4;         /* offset: 0x0058 size: 32 bit */
         };

      };
   } CFLASH_tag;


#define CFLASH (*(volatile CFLASH_tag *) 0xC3F88000UL)



/****************************************************************/
/*                                                              */
/* Module: SIUL  */
/*                                                              */
/****************************************************************/

   typedef union {   /* MIDR1 - MCU ID Register #1 */
      uint32_t R;
      struct {
         uint32_t  PARTNUM:16;        /* MCU Part Number */
         uint32_t  CSP:1;             /* CSP Package */
         uint32_t  PKG:5;             /* Package Settings */
         uint32_t:2;
#ifndef USE_FIELD_ALIASES_SIUL
         uint32_t  MAJOR_MASK:4;      /* Major Mask Revision */
#else
         uint32_t  MAJORMASK:4;         /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SIUL
         uint32_t  MINOR_MASK:4;      /* Minor Mask Revision */
#else
         uint32_t  MINORMASK:4;         /* deprecated name - please avoid */
#endif
      } B;
   } SIUL_MIDR1_32B_tag;

   typedef union {   /* MIDR2 - MCU ID Register #2 */
      uint32_t R;
      struct {
         uint32_t  SF:1;              /* Manufacturer */
         uint32_t  FLASH_SIZE_1:4;    /* Coarse Flash Memory Size */
         uint32_t  FLASH_SIZE_2:4;    /* Fine Flash Memory Size */
         uint32_t:7;
#ifndef USE_FIELD_ALIASES_SIUL
         uint32_t  PARTNUM2:8;        /* MCU Part Number */
#else
         uint32_t  PARTNUM:8;           /* deprecated name - please avoid */
#endif
         uint32_t  TBD:1;             /* Optional Bit */
         uint32_t:2;
         uint32_t  EE:1;              /* Data Flash Present */
         uint32_t:3;
         uint32_t  FR:1;              /* Flexray Present */
      } B;
   } SIUL_MIDR2_32B_tag;

   typedef union {   /* ISR - Interrupt Status Flag Register */
      uint32_t R;
      struct {
         uint32_t  EIF31:1;           /* External Interrupt Status Flag */
         uint32_t  EIF30:1;           /* External Interrupt Status Flag */
         uint32_t  EIF29:1;           /* External Interrupt Status Flag */
         uint32_t  EIF28:1;           /* External Interrupt Status Flag */
         uint32_t  EIF27:1;           /* External Interrupt Status Flag */
         uint32_t  EIF26:1;           /* External Interrupt Status Flag */
         uint32_t  EIF25:1;           /* External Interrupt Status Flag */
         uint32_t  EIF24:1;           /* External Interrupt Status Flag */
         uint32_t  EIF23:1;           /* External Interrupt Status Flag */
         uint32_t  EIF22:1;           /* External Interrupt Status Flag */
         uint32_t  EIF21:1;           /* External Interrupt Status Flag */
         uint32_t  EIF20:1;           /* External Interrupt Status Flag */
         uint32_t  EIF19:1;           /* External Interrupt Status Flag */
         uint32_t  EIF18:1;           /* External Interrupt Status Flag */
         uint32_t  EIF17:1;           /* External Interrupt Status Flag */
         uint32_t  EIF16:1;           /* External Interrupt Status Flag */
         uint32_t  EIF15:1;           /* External Interrupt Status Flag */
         uint32_t  EIF14:1;           /* External Interrupt Status Flag */
         uint32_t  EIF13:1;           /* External Interrupt Status Flag */
         uint32_t  EIF12:1;           /* External Interrupt Status Flag */
         uint32_t  EIF11:1;           /* External Interrupt Status Flag */
         uint32_t  EIF10:1;           /* External Interrupt Status Flag */
         uint32_t  EIF9:1;            /* External Interrupt Status Flag */
         uint32_t  EIF8:1;            /* External Interrupt Status Flag */
         uint32_t  EIF7:1;            /* External Interrupt Status Flag */
         uint32_t  EIF6:1;            /* External Interrupt Status Flag */
         uint32_t  EIF5:1;            /* External Interrupt Status Flag */
         uint32_t  EIF4:1;            /* External Interrupt Status Flag */
         uint32_t  EIF3:1;            /* External Interrupt Status Flag */
         uint32_t  EIF2:1;            /* External Interrupt Status Flag */
         uint32_t  EIF1:1;            /* External Interrupt Status Flag */
         uint32_t  EIF0:1;            /* External Interrupt Status Flag */
      } B;
   } SIUL_ISR_32B_tag;

