RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* IRER - Interrupt Request Enable Register */
      uint32_t R;
      struct {
         uint32_t  EIRE31:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE30:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE29:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE28:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE27:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE26:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE25:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE24:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE23:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE22:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE21:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE20:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE19:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE18:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE17:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE16:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE15:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE14:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE13:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE12:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE11:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE10:1;          /* Enable External Interrupt Requests */
         uint32_t  EIRE9:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE8:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE7:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE6:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE5:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE4:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE3:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE2:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE1:1;           /* Enable External Interrupt Requests */
         uint32_t  EIRE0:1;           /* Enable External Interrupt Requests */
      } B;
   } SIUL_IRER_32B_tag;

   typedef union {   /* IREER - Interrupt Rising Edge Event Enable */
      uint32_t R;
      struct {
         uint32_t  IREE31:1;          /* Enable rising-edge events */
         uint32_t  IREE30:1;          /* Enable rising-edge events */
         uint32_t  IREE29:1;          /* Enable rising-edge events */
         uint32_t  IREE28:1;          /* Enable rising-edge events */
         uint32_t  IREE27:1;          /* Enable rising-edge events */
         uint32_t  IREE26:1;          /* Enable rising-edge events */
         uint32_t  IREE25:1;          /* Enable rising-edge events */
         uint32_t  IREE24:1;          /* Enable rising-edge events */
         uint32_t  IREE23:1;          /* Enable rising-edge events */
         uint32_t  IREE22:1;          /* Enable rising-edge events */
         uint32_t  IREE21:1;          /* Enable rising-edge events */
         uint32_t  IREE20:1;          /* Enable rising-edge events */
         uint32_t  IREE19:1;          /* Enable rising-edge events */
         uint32_t  IREE18:1;          /* Enable rising-edge events */
         uint32_t  IREE17:1;          /* Enable rising-edge events */
         uint32_t  IREE16:1;          /* Enable rising-edge events */
         uint32_t  IREE15:1;          /* Enable rising-edge events */
         uint32_t  IREE14:1;          /* Enable rising-edge events */
         uint32_t  IREE13:1;          /* Enable rising-edge events */
         uint32_t  IREE12:1;          /* Enable rising-edge events */
         uint32_t  IREE11:1;          /* Enable rising-edge events */
         uint32_t  IREE10:1;          /* Enable rising-edge events */
         uint32_t  IREE9:1;           /* Enable rising-edge events */
         uint32_t  IREE8:1;           /* Enable rising-edge events */
         uint32_t  IREE7:1;           /* Enable rising-edge events */
         uint32_t  IREE6:1;           /* Enable rising-edge events */
         uint32_t  IREE5:1;           /* Enable rising-edge events */
         uint32_t  IREE4:1;           /* Enable rising-edge events */
         uint32_t  IREE3:1;           /* Enable rising-edge events */
         uint32_t  IREE2:1;           /* Enable rising-edge events */
         uint32_t  IREE1:1;           /* Enable rising-edge events */
         uint32_t  IREE0:1;           /* Enable rising-edge events */
      } B;
   } SIUL_IREER_32B_tag;

   typedef union {   /* IFEER - Interrupt Falling-Edge Event Enable */
      uint32_t R;
      struct {
         uint32_t  IFEE31:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE30:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE29:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE28:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE27:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE26:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE25:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE24:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE23:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE22:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE21:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE20:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE19:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE18:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE17:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE16:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE15:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE14:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE13:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE12:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE11:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE10:1;          /* Enable Falling Edge Events */
         uint32_t  IFEE9:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE8:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE7:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE6:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE5:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE4:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE3:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE2:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE1:1;           /* Enable Falling Edge Events */
         uint32_t  IFEE0:1;           /* Enable Falling Edge Events */
      } B;
   } SIUL_IFEER_32B_tag;

   typedef union {   /* IFER Interrupt Filter Enable Register */
      uint32_t R;
      struct {
         uint32_t  IFE31:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE30:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE29:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE28:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE27:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE26:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE25:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE24:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE23:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE22:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE21:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE20:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE19:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE18:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE17:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE16:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE15:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE14:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE13:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE12:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE11:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE10:1;           /* Enable Digital Glitch Filter */
         uint32_t  IFE9:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE8:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE7:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE6:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE5:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE4:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE3:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE2:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE1:1;            /* Enable Digital Glitch Filter */
         uint32_t  IFE0:1;            /* Enable Digital Glitch Filter */
      } B;
   } SIUL_IFER_32B_tag;


   /* Register layout for all registers PCR... */

