RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union SIU_PCR_tag {   /* PCR - Pad Configuration Register */
      uint16_t R;
      struct {
         uint16_t:1;
#ifndef USE_FIELD_ALIASES_SIUL
         uint16_t  SMC:1;             /* Safe Mode Control */
#else
         uint16_t  SME:1;               /* deprecated name - please avoid */
#endif
         uint16_t  APC:1;             /* Analog Pad Control */
         uint16_t:1;
         uint16_t  PA:2;              /* Pad Output Assignment */
         uint16_t  OBE:1;             /* Output Buffer Enable */
         uint16_t  IBE:1;             /* Input Buffer Enable */
#ifndef USE_FIELD_ALIASES_SIUL
         uint16_t  DSC:2;             /* Drive Strength Control */
#else
         uint16_t  DCS:2;               /* deprecated name - please avoid */
#endif
         uint16_t  ODE:1;             /* Open Drain Output Enable */
         uint16_t  HYS:1;             /* Input Hysteresis */
         uint16_t  SRC:2;             /* Slew Rate Control */
         uint16_t  WPE:1;             /* Weak Pull Up/Down Enable */
         uint16_t  WPS:1;             /* Weak Pull Up/Down Select */
      } B;
   } SIU_PCR_tag;


   /* Register layout for all registers PSMI... */

   typedef union SIUL_PSMI_8B_tag {   /* PSMI - Pad Selection for Multiplexed Inputs */
      uint8_t R;
      struct {
         uint8_t:4;
         uint8_t   PADSEL:4;          /* Pad selection for pin */
      } B;
   } SIUL_PSMI_8B_tag;


   /* Register layout for all registers PSMI... */

   typedef union {   /* PSMI - Pad Selection for Multiplexed Inputs */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  PADSEL0:4;         /* Pad selection for pin */
         uint32_t:4;
         uint32_t  PADSEL1:4;         /* Pad selection for pin */
         uint32_t:4;
         uint32_t  PADSEL2:4;         /* Pad selection for pin */
         uint32_t:4;
         uint32_t  PADSEL3:4;         /* Pad selection for pin */
      } B;
   } SIUL_PSMI_32B_tag;


   /* Register layout for all registers GPDO... */

   typedef union {   /* GPDO - GPIO Pad Data Output Register */
      uint8_t R;
      struct {
         uint8_t:7;
         uint8_t   PDO:1;             /* Pad Data Out */
      } B;
   } SIUL_GPDO_8B_tag;


   /* Register layout for all registers GPDO... */

   typedef union {   /* GPDO - GPIO Pad Data Output Register */
      uint32_t R;
      struct {
         uint32_t:7;
         uint32_t  PDO0:1;            /* Pad Data Out */
         uint32_t:7;
         uint32_t  PDO1:1;            /* Pad Data Out */
         uint32_t:7;
         uint32_t  PDO2:1;            /* Pad Data Out */
         uint32_t:7;
         uint32_t  PDO3:1;            /* Pad Data Out */
      } B;
   } SIUL_GPDO_32B_tag;


   /* Register layout for all registers GPDI... */

   typedef union {   /* GPDI - GPIO Pad Data Input Register */
      uint8_t R;
      struct {
         uint8_t:7;
         uint8_t   PDI:1;             /* Pad Data In */
      } B;
   } SIUL_GPDI_8B_tag;


   /* Register layout for all registers GPDI... */

   typedef union {   /* GPDI - GPIO Pad Data Input Register */
      uint32_t R;
      struct {
         uint32_t:7;
         uint32_t  PDI0:1;            /* Pad Data In */
         uint32_t:7;
         uint32_t  PDI1:1;            /* Pad Data In */
         uint32_t:7;
         uint32_t  PDI2:1;            /* Pad Data In */
         uint32_t:7;
         uint32_t  PDI3:1;            /* Pad Data In */
      } B;
   } SIUL_GPDI_32B_tag;


   /* Register layout for all registers PGPDO... */

   typedef union {   /* PGPDO - Parallel GPIO Pad Data Out Register */
      uint16_t R;
   } SIUL_PGPDO_16B_tag;


   /* Register layout for all registers PGPDI... */

   typedef union {   /* PGPDI - Parallel GPIO Pad Data In Register */
      uint16_t R;
   } SIUL_PGPDI_16B_tag;


   /* Register layout for all registers MPGPDO... */

   typedef union {   /* MPGPDO - Masked Parallel GPIO Pad Data Out Register */
      uint32_t R;
      struct {
         uint32_t  MASK:16;           /* Mask Field */
         uint32_t  MPPDO:16;          /* Masked Parallel Pad Data Out */
      } B;
   } SIUL_MPGPDO_32B_tag;


   /* Register layout for all registers IFMC... */

   typedef union {   /* IFMC - Interrupt Filter Maximum Counter Register */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  MAXCNT:4;          /* Maximum Interrupt Filter Counter Setting */
      } B;
   } SIUL_IFMC_32B_tag;

   typedef union {   /* IFCPR - Inerrupt Filter Clock Prescaler Register */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  IFCP:4;            /* Interrupt Filter Clock Prescaler Setting */
      } B;
   } SIUL_IFCPR_32B_tag;



   typedef struct SIU_tag { /* start of SIUL_tag */
      int8_t SIUL_reserved_0000_C[4];
      union {
         SIUL_MIDR1_32B_tag MIDR;          /* deprecated - please avoid */

                                           /* MIDR1 - MCU ID Register #1 */
         SIUL_MIDR1_32B_tag MIDR1;         /* offset: 0x0004 size: 32 bit */

      };
                                           /* MIDR2 - MCU ID Register #2 */
      SIUL_MIDR2_32B_tag MIDR2;            /* offset: 0x0008 size: 32 bit */
      int8_t SIUL_reserved_000C[8];
                                 /* ISR - Interrupt Status Flag Register */
      SIUL_ISR_32B_tag ISR;                /* offset: 0x0014 size: 32 bit */
                             /* IRER - Interrupt Request Enable Register */
      SIUL_IRER_32B_tag IRER;              /* offset: 0x0018 size: 32 bit */
      int8_t SIUL_reserved_001C[12];
                           /* IREER - Interrupt Rising Edge Event Enable */
      SIUL_IREER_32B_tag IREER;            /* offset: 0x0028 size: 32 bit */
                          /* IFEER - Interrupt Falling-Edge Event Enable */
      SIUL_IFEER_32B_tag IFEER;            /* offset: 0x002C size: 32 bit */
                                /* IFER Interrupt Filter Enable Register */
      SIUL_IFER_32B_tag IFER;              /* offset: 0x0030 size: 32 bit */
      int8_t SIUL_reserved_0034_C[12];
      union {
                                     /* PCR - Pad Configuration Register */
         SIU_PCR_tag PCR[512];        /* offset: 0x0040  (0x0002 x 512) */

