RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
                                     /* PCR - Pad Configuration Register */
            SIU_PCR_tag PCR0;         /* offset: 0x0040 size: 16 bit */
            SIU_PCR_tag PCR1;         /* offset: 0x0042 size: 16 bit */
            SIU_PCR_tag PCR2;         /* offset: 0x0044 size: 16 bit */
            SIU_PCR_tag PCR3;         /* offset: 0x0046 size: 16 bit */
            SIU_PCR_tag PCR4;         /* offset: 0x0048 size: 16 bit */
            SIU_PCR_tag PCR5;         /* offset: 0x004A size: 16 bit */
            SIU_PCR_tag PCR6;         /* offset: 0x004C size: 16 bit */
            SIU_PCR_tag PCR7;         /* offset: 0x004E size: 16 bit */
            SIU_PCR_tag PCR8;         /* offset: 0x0050 size: 16 bit */
            SIU_PCR_tag PCR9;         /* offset: 0x0052 size: 16 bit */
            SIU_PCR_tag PCR10;        /* offset: 0x0054 size: 16 bit */
            SIU_PCR_tag PCR11;        /* offset: 0x0056 size: 16 bit */
            SIU_PCR_tag PCR12;        /* offset: 0x0058 size: 16 bit */
            SIU_PCR_tag PCR13;        /* offset: 0x005A size: 16 bit */
            SIU_PCR_tag PCR14;        /* offset: 0x005C size: 16 bit */
            SIU_PCR_tag PCR15;        /* offset: 0x005E size: 16 bit */
            SIU_PCR_tag PCR16;        /* offset: 0x0060 size: 16 bit */
            SIU_PCR_tag PCR17;        /* offset: 0x0062 size: 16 bit */
            SIU_PCR_tag PCR18;        /* offset: 0x0064 size: 16 bit */
            SIU_PCR_tag PCR19;        /* offset: 0x0066 size: 16 bit */
            SIU_PCR_tag PCR20;        /* offset: 0x0068 size: 16 bit */
            SIU_PCR_tag PCR21;        /* offset: 0x006A size: 16 bit */
            SIU_PCR_tag PCR22;        /* offset: 0x006C size: 16 bit */
            SIU_PCR_tag PCR23;        /* offset: 0x006E size: 16 bit */
            SIU_PCR_tag PCR24;        /* offset: 0x0070 size: 16 bit */
            SIU_PCR_tag PCR25;        /* offset: 0x0072 size: 16 bit */
            SIU_PCR_tag PCR26;        /* offset: 0x0074 size: 16 bit */
            SIU_PCR_tag PCR27;        /* offset: 0x0076 size: 16 bit */
            SIU_PCR_tag PCR28;        /* offset: 0x0078 size: 16 bit */
            SIU_PCR_tag PCR29;        /* offset: 0x007A size: 16 bit */
            SIU_PCR_tag PCR30;        /* offset: 0x007C size: 16 bit */
            SIU_PCR_tag PCR31;        /* offset: 0x007E size: 16 bit */
            SIU_PCR_tag PCR32;        /* offset: 0x0080 size: 16 bit */
            SIU_PCR_tag PCR33;        /* offset: 0x0082 size: 16 bit */
            SIU_PCR_tag PCR34;        /* offset: 0x0084 size: 16 bit */
            SIU_PCR_tag PCR35;        /* offset: 0x0086 size: 16 bit */
            SIU_PCR_tag PCR36;        /* offset: 0x0088 size: 16 bit */
            SIU_PCR_tag PCR37;        /* offset: 0x008A size: 16 bit */
            SIU_PCR_tag PCR38;        /* offset: 0x008C size: 16 bit */
            SIU_PCR_tag PCR39;        /* offset: 0x008E size: 16 bit */
            SIU_PCR_tag PCR40;        /* offset: 0x0090 size: 16 bit */
            SIU_PCR_tag PCR41;        /* offset: 0x0092 size: 16 bit */
            SIU_PCR_tag PCR42;        /* offset: 0x0094 size: 16 bit */
            SIU_PCR_tag PCR43;        /* offset: 0x0096 size: 16 bit */
            SIU_PCR_tag PCR44;        /* offset: 0x0098 size: 16 bit */
            SIU_PCR_tag PCR45;        /* offset: 0x009A size: 16 bit */
            SIU_PCR_tag PCR46;        /* offset: 0x009C size: 16 bit */
            SIU_PCR_tag PCR47;        /* offset: 0x009E size: 16 bit */
            SIU_PCR_tag PCR48;        /* offset: 0x00A0 size: 16 bit */
            SIU_PCR_tag PCR49;        /* offset: 0x00A2 size: 16 bit */
            SIU_PCR_tag PCR50;        /* offset: 0x00A4 size: 16 bit */
            SIU_PCR_tag PCR51;        /* offset: 0x00A6 size: 16 bit */
            SIU_PCR_tag PCR52;        /* offset: 0x00A8 size: 16 bit */
            SIU_PCR_tag PCR53;        /* offset: 0x00AA size: 16 bit */
            SIU_PCR_tag PCR54;        /* offset: 0x00AC size: 16 bit */
            SIU_PCR_tag PCR55;        /* offset: 0x00AE size: 16 bit */
            SIU_PCR_tag PCR56;        /* offset: 0x00B0 size: 16 bit */
            SIU_PCR_tag PCR57;        /* offset: 0x00B2 size: 16 bit */
            SIU_PCR_tag PCR58;        /* offset: 0x00B4 size: 16 bit */
            SIU_PCR_tag PCR59;        /* offset: 0x00B6 size: 16 bit */
            SIU_PCR_tag PCR60;        /* offset: 0x00B8 size: 16 bit */
            SIU_PCR_tag PCR61;        /* offset: 0x00BA size: 16 bit */
            SIU_PCR_tag PCR62;        /* offset: 0x00BC size: 16 bit */
            SIU_PCR_tag PCR63;        /* offset: 0x00BE size: 16 bit */
            SIU_PCR_tag PCR64;        /* offset: 0x00C0 size: 16 bit */
            SIU_PCR_tag PCR65;        /* offset: 0x00C2 size: 16 bit */
            SIU_PCR_tag PCR66;        /* offset: 0x00C4 size: 16 bit */
            SIU_PCR_tag PCR67;        /* offset: 0x00C6 size: 16 bit */
            SIU_PCR_tag PCR68;        /* offset: 0x00C8 size: 16 bit */
            SIU_PCR_tag PCR69;        /* offset: 0x00CA size: 16 bit */
            SIU_PCR_tag PCR70;        /* offset: 0x00CC size: 16 bit */
            SIU_PCR_tag PCR71;        /* offset: 0x00CE size: 16 bit */
            SIU_PCR_tag PCR72;        /* offset: 0x00D0 size: 16 bit */
            SIU_PCR_tag PCR73;        /* offset: 0x00D2 size: 16 bit */
            SIU_PCR_tag PCR74;        /* offset: 0x00D4 size: 16 bit */
            SIU_PCR_tag PCR75;        /* offset: 0x00D6 size: 16 bit */
            SIU_PCR_tag PCR76;        /* offset: 0x00D8 size: 16 bit */
            SIU_PCR_tag PCR77;        /* offset: 0x00DA size: 16 bit */
            SIU_PCR_tag PCR78;        /* offset: 0x00DC size: 16 bit */
            SIU_PCR_tag PCR79;        /* offset: 0x00DE size: 16 bit */
            SIU_PCR_tag PCR80;        /* offset: 0x00E0 size: 16 bit */
            SIU_PCR_tag PCR81;        /* offset: 0x00E2 size: 16 bit */
            SIU_PCR_tag PCR82;        /* offset: 0x00E4 size: 16 bit */
            SIU_PCR_tag PCR83;        /* offset: 0x00E6 size: 16 bit */
            SIU_PCR_tag PCR84;        /* offset: 0x00E8 size: 16 bit */
            SIU_PCR_tag PCR85;        /* offset: 0x00EA size: 16 bit */
            SIU_PCR_tag PCR86;        /* offset: 0x00EC size: 16 bit */
            SIU_PCR_tag PCR87;        /* offset: 0x00EE size: 16 bit */
            SIU_PCR_tag PCR88;        /* offset: 0x00F0 size: 16 bit */
            SIU_PCR_tag PCR89;        /* offset: 0x00F2 size: 16 bit */
            SIU_PCR_tag PCR90;        /* offset: 0x00F4 size: 16 bit */
            SIU_PCR_tag PCR91;        /* offset: 0x00F6 size: 16 bit */
            SIU_PCR_tag PCR92;        /* offset: 0x00F8 size: 16 bit */
            SIU_PCR_tag PCR93;        /* offset: 0x00FA size: 16 bit */
            SIU_PCR_tag PCR94;        /* offset: 0x00FC size: 16 bit */
            SIU_PCR_tag PCR95;        /* offset: 0x00FE size: 16 bit */
            SIU_PCR_tag PCR96;        /* offset: 0x0100 size: 16 bit */
            SIU_PCR_tag PCR97;        /* offset: 0x0102 size: 16 bit */
            SIU_PCR_tag PCR98;        /* offset: 0x0104 size: 16 bit */
            SIU_PCR_tag PCR99;        /* offset: 0x0106 size: 16 bit */
            SIU_PCR_tag PCR100;       /* offset: 0x0108 size: 16 bit */
            SIU_PCR_tag PCR101;       /* offset: 0x010A size: 16 bit */
            SIU_PCR_tag PCR102;       /* offset: 0x010C size: 16 bit */
            SIU_PCR_tag PCR103;       /* offset: 0x010E size: 16 bit */
            SIU_PCR_tag PCR104;       /* offset: 0x0110 size: 16 bit */
            SIU_PCR_tag PCR105;       /* offset: 0x0112 size: 16 bit */
            SIU_PCR_tag PCR106;       /* offset: 0x0114 size: 16 bit */
            SIU_PCR_tag PCR107;       /* offset: 0x0116 size: 16 bit */
            SIU_PCR_tag PCR108;       /* offset: 0x0118 size: 16 bit */
            SIU_PCR_tag PCR109;       /* offset: 0x011A size: 16 bit */
            SIU_PCR_tag PCR110;       /* offset: 0x011C size: 16 bit */
            SIU_PCR_tag PCR111;       /* offset: 0x011E size: 16 bit */
            SIU_PCR_tag PCR112;       /* offset: 0x0120 size: 16 bit */
            SIU_PCR_tag PCR113;       /* offset: 0x0122 size: 16 bit */
            SIU_PCR_tag PCR114;       /* offset: 0x0124 size: 16 bit */
            SIU_PCR_tag PCR115;       /* offset: 0x0126 size: 16 bit */
            SIU_PCR_tag PCR116;       /* offset: 0x0128 size: 16 bit */
            SIU_PCR_tag PCR117;       /* offset: 0x012A size: 16 bit */
            SIU_PCR_tag PCR118;       /* offset: 0x012C size: 16 bit */
            SIU_PCR_tag PCR119;       /* offset: 0x012E size: 16 bit */
            SIU_PCR_tag PCR120;       /* offset: 0x0130 size: 16 bit */
            SIU_PCR_tag PCR121;       /* offset: 0x0132 size: 16 bit */
            SIU_PCR_tag PCR122;       /* offset: 0x0134 size: 16 bit */
            SIU_PCR_tag PCR123;       /* offset: 0x0136 size: 16 bit */
            SIU_PCR_tag PCR124;       /* offset: 0x0138 size: 16 bit */
            SIU_PCR_tag PCR125;       /* offset: 0x013A size: 16 bit */
            SIU_PCR_tag PCR126;       /* offset: 0x013C size: 16 bit */
            SIU_PCR_tag PCR127;       /* offset: 0x013E size: 16 bit */
            SIU_PCR_tag PCR128;       /* offset: 0x0140 size: 16 bit */
            SIU_PCR_tag PCR129;       /* offset: 0x0142 size: 16 bit */
            SIU_PCR_tag PCR130;       /* offset: 0x0144 size: 16 bit */
            SIU_PCR_tag PCR131;       /* offset: 0x0146 size: 16 bit */
            SIU_PCR_tag PCR132;       /* offset: 0x0148 size: 16 bit */
            SIU_PCR_tag PCR133;       /* offset: 0x014A size: 16 bit */
            SIU_PCR_tag PCR134;       /* offset: 0x014C size: 16 bit */
            SIU_PCR_tag PCR135;       /* offset: 0x014E size: 16 bit */
            SIU_PCR_tag PCR136;       /* offset: 0x0150 size: 16 bit */
            SIU_PCR_tag PCR137;       /* offset: 0x0152 size: 16 bit */
            SIU_PCR_tag PCR138;       /* offset: 0x0154 size: 16 bit */
            SIU_PCR_tag PCR139;       /* offset: 0x0156 size: 16 bit */
            SIU_PCR_tag PCR140;       /* offset: 0x0158 size: 16 bit */
            SIU_PCR_tag PCR141;       /* offset: 0x015A size: 16 bit */
            SIU_PCR_tag PCR142;       /* offset: 0x015C size: 16 bit */
            SIU_PCR_tag PCR143;       /* offset: 0x015E size: 16 bit */
            SIU_PCR_tag PCR144;       /* offset: 0x0160 size: 16 bit */
            SIU_PCR_tag PCR145;       /* offset: 0x0162 size: 16 bit */
            SIU_PCR_tag PCR146;       /* offset: 0x0164 size: 16 bit */
            SIU_PCR_tag PCR147;       /* offset: 0x0166 size: 16 bit */
            SIU_PCR_tag PCR148;       /* offset: 0x0168 size: 16 bit */
            SIU_PCR_tag PCR149;       /* offset: 0x016A size: 16 bit */
            SIU_PCR_tag PCR150;       /* offset: 0x016C size: 16 bit */
            SIU_PCR_tag PCR151;       /* offset: 0x016E size: 16 bit */
            SIU_PCR_tag PCR152;       /* offset: 0x0170 size: 16 bit */
            SIU_PCR_tag PCR153;       /* offset: 0x0172 size: 16 bit */
            SIU_PCR_tag PCR154;       /* offset: 0x0174 size: 16 bit */
            SIU_PCR_tag PCR155;       /* offset: 0x0176 size: 16 bit */
            SIU_PCR_tag PCR156;       /* offset: 0x0178 size: 16 bit */
            SIU_PCR_tag PCR157;       /* offset: 0x017A size: 16 bit */
            SIU_PCR_tag PCR158;       /* offset: 0x017C size: 16 bit */
            SIU_PCR_tag PCR159;       /* offset: 0x017E size: 16 bit */
            SIU_PCR_tag PCR160;       /* offset: 0x0180 size: 16 bit */
            SIU_PCR_tag PCR161;       /* offset: 0x0182 size: 16 bit */
            SIU_PCR_tag PCR162;       /* offset: 0x0184 size: 16 bit */
            SIU_PCR_tag PCR163;       /* offset: 0x0186 size: 16 bit */
            SIU_PCR_tag PCR164;       /* offset: 0x0188 size: 16 bit */
            SIU_PCR_tag PCR165;       /* offset: 0x018A size: 16 bit */
            SIU_PCR_tag PCR166;       /* offset: 0x018C size: 16 bit */
            SIU_PCR_tag PCR167;       /* offset: 0x018E size: 16 bit */
            SIU_PCR_tag PCR168;       /* offset: 0x0190 size: 16 bit */
            SIU_PCR_tag PCR169;       /* offset: 0x0192 size: 16 bit */
            SIU_PCR_tag PCR170;       /* offset: 0x0194 size: 16 bit */
            SIU_PCR_tag PCR171;       /* offset: 0x0196 size: 16 bit */
            SIU_PCR_tag PCR172;       /* offset: 0x0198 size: 16 bit */
            SIU_PCR_tag PCR173;       /* offset: 0x019A size: 16 bit */
            SIU_PCR_tag PCR174;       /* offset: 0x019C size: 16 bit */
            SIU_PCR_tag PCR175;       /* offset: 0x019E size: 16 bit */
            SIU_PCR_tag PCR176;       /* offset: 0x01A0 size: 16 bit */
            SIU_PCR_tag PCR177;       /* offset: 0x01A2 size: 16 bit */
            SIU_PCR_tag PCR178;       /* offset: 0x01A4 size: 16 bit */
            SIU_PCR_tag PCR179;       /* offset: 0x01A6 size: 16 bit */
            SIU_PCR_tag PCR180;       /* offset: 0x01A8 size: 16 bit */
            SIU_PCR_tag PCR181;       /* offset: 0x01AA size: 16 bit */
            SIU_PCR_tag PCR182;       /* offset: 0x01AC size: 16 bit */
            SIU_PCR_tag PCR183;       /* offset: 0x01AE size: 16 bit */
            SIU_PCR_tag PCR184;       /* offset: 0x01B0 size: 16 bit */
            SIU_PCR_tag PCR185;       /* offset: 0x01B2 size: 16 bit */
            SIU_PCR_tag PCR186;       /* offset: 0x01B4 size: 16 bit */
            SIU_PCR_tag PCR187;       /* offset: 0x01B6 size: 16 bit */
            SIU_PCR_tag PCR188;       /* offset: 0x01B8 size: 16 bit */
            SIU_PCR_tag PCR189;       /* offset: 0x01BA size: 16 bit */
            SIU_PCR_tag PCR190;       /* offset: 0x01BC size: 16 bit */
            SIU_PCR_tag PCR191;       /* offset: 0x01BE size: 16 bit */
            SIU_PCR_tag PCR192;       /* offset: 0x01C0 size: 16 bit */
            SIU_PCR_tag PCR193;       /* offset: 0x01C2 size: 16 bit */
            SIU_PCR_tag PCR194;       /* offset: 0x01C4 size: 16 bit */
            SIU_PCR_tag PCR195;       /* offset: 0x01C6 size: 16 bit */
            SIU_PCR_tag PCR196;       /* offset: 0x01C8 size: 16 bit */
            SIU_PCR_tag PCR197;       /* offset: 0x01CA size: 16 bit */
            SIU_PCR_tag PCR198;       /* offset: 0x01CC size: 16 bit */
            SIU_PCR_tag PCR199;       /* offset: 0x01CE size: 16 bit */
            SIU_PCR_tag PCR200;       /* offset: 0x01D0 size: 16 bit */
            SIU_PCR_tag PCR201;       /* offset: 0x01D2 size: 16 bit */
            SIU_PCR_tag PCR202;       /* offset: 0x01D4 size: 16 bit */
            SIU_PCR_tag PCR203;       /* offset: 0x01D6 size: 16 bit */
            SIU_PCR_tag PCR204;       /* offset: 0x01D8 size: 16 bit */
            SIU_PCR_tag PCR205;       /* offset: 0x01DA size: 16 bit */
            SIU_PCR_tag PCR206;       /* offset: 0x01DC size: 16 bit */
            SIU_PCR_tag PCR207;       /* offset: 0x01DE size: 16 bit */
            SIU_PCR_tag PCR208;       /* offset: 0x01E0 size: 16 bit */
            SIU_PCR_tag PCR209;       /* offset: 0x01E2 size: 16 bit */
            SIU_PCR_tag PCR210;       /* offset: 0x01E4 size: 16 bit */
            SIU_PCR_tag PCR211;       /* offset: 0x01E6 size: 16 bit */
            SIU_PCR_tag PCR212;       /* offset: 0x01E8 size: 16 bit */
            SIU_PCR_tag PCR213;       /* offset: 0x01EA size: 16 bit */
            SIU_PCR_tag PCR214;       /* offset: 0x01EC size: 16 bit */
            SIU_PCR_tag PCR215;       /* offset: 0x01EE size: 16 bit */
            SIU_PCR_tag PCR216;       /* offset: 0x01F0 size: 16 bit */
            SIU_PCR_tag PCR217;       /* offset: 0x01F2 size: 16 bit */
            SIU_PCR_tag PCR218;       /* offset: 0x01F4 size: 16 bit */
            SIU_PCR_tag PCR219;       /* offset: 0x01F6 size: 16 bit */
            SIU_PCR_tag PCR220;       /* offset: 0x01F8 size: 16 bit */
            SIU_PCR_tag PCR221;       /* offset: 0x01FA size: 16 bit */
            SIU_PCR_tag PCR222;       /* offset: 0x01FC size: 16 bit */
            SIU_PCR_tag PCR223;       /* offset: 0x01FE size: 16 bit */
            SIU_PCR_tag PCR224;       /* offset: 0x0200 size: 16 bit */
            SIU_PCR_tag PCR225;       /* offset: 0x0202 size: 16 bit */
            SIU_PCR_tag PCR226;       /* offset: 0x0204 size: 16 bit */
            SIU_PCR_tag PCR227;       /* offset: 0x0206 size: 16 bit */
            SIU_PCR_tag PCR228;       /* offset: 0x0208 size: 16 bit */
            SIU_PCR_tag PCR229;       /* offset: 0x020A size: 16 bit */
            SIU_PCR_tag PCR230;       /* offset: 0x020C size: 16 bit */
            SIU_PCR_tag PCR231;       /* offset: 0x020E size: 16 bit */
            SIU_PCR_tag PCR232;       /* offset: 0x0210 size: 16 bit */
            SIU_PCR_tag PCR233;       /* offset: 0x0212 size: 16 bit */
            SIU_PCR_tag PCR234;       /* offset: 0x0214 size: 16 bit */
            SIU_PCR_tag PCR235;       /* offset: 0x0216 size: 16 bit */
            SIU_PCR_tag PCR236;       /* offset: 0x0218 size: 16 bit */
            SIU_PCR_tag PCR237;       /* offset: 0x021A size: 16 bit */
            SIU_PCR_tag PCR238;       /* offset: 0x021C size: 16 bit */
            SIU_PCR_tag PCR239;       /* offset: 0x021E size: 16 bit */
            SIU_PCR_tag PCR240;       /* offset: 0x0220 size: 16 bit */
            SIU_PCR_tag PCR241;       /* offset: 0x0222 size: 16 bit */
            SIU_PCR_tag PCR242;       /* offset: 0x0224 size: 16 bit */
            SIU_PCR_tag PCR243;       /* offset: 0x0226 size: 16 bit */
            SIU_PCR_tag PCR244;       /* offset: 0x0228 size: 16 bit */
            SIU_PCR_tag PCR245;       /* offset: 0x022A size: 16 bit */
            SIU_PCR_tag PCR246;       /* offset: 0x022C size: 16 bit */
            SIU_PCR_tag PCR247;       /* offset: 0x022E size: 16 bit */
            SIU_PCR_tag PCR248;       /* offset: 0x0230 size: 16 bit */
            SIU_PCR_tag PCR249;       /* offset: 0x0232 size: 16 bit */
            SIU_PCR_tag PCR250;       /* offset: 0x0234 size: 16 bit */
            SIU_PCR_tag PCR251;       /* offset: 0x0236 size: 16 bit */
            SIU_PCR_tag PCR252;       /* offset: 0x0238 size: 16 bit */
            SIU_PCR_tag PCR253;       /* offset: 0x023A size: 16 bit */
            SIU_PCR_tag PCR254;       /* offset: 0x023C size: 16 bit */
            SIU_PCR_tag PCR255;       /* offset: 0x023E size: 16 bit */
            SIU_PCR_tag PCR256;       /* offset: 0x0240 size: 16 bit */
            SIU_PCR_tag PCR257;       /* offset: 0x0242 size: 16 bit */
            SIU_PCR_tag PCR258;       /* offset: 0x0244 size: 16 bit */
            SIU_PCR_tag PCR259;       /* offset: 0x0246 size: 16 bit */
            SIU_PCR_tag PCR260;       /* offset: 0x0248 size: 16 bit */
            SIU_PCR_tag PCR261;       /* offset: 0x024A size: 16 bit */
            SIU_PCR_tag PCR262;       /* offset: 0x024C size: 16 bit */
            SIU_PCR_tag PCR263;       /* offset: 0x024E size: 16 bit */
            SIU_PCR_tag PCR264;       /* offset: 0x0250 size: 16 bit */
            SIU_PCR_tag PCR265;       /* offset: 0x0252 size: 16 bit */
            SIU_PCR_tag PCR266;       /* offset: 0x0254 size: 16 bit */
            SIU_PCR_tag PCR267;       /* offset: 0x0256 size: 16 bit */
            SIU_PCR_tag PCR268;       /* offset: 0x0258 size: 16 bit */
            SIU_PCR_tag PCR269;       /* offset: 0x025A size: 16 bit */
            SIU_PCR_tag PCR270;       /* offset: 0x025C size: 16 bit */
            SIU_PCR_tag PCR271;       /* offset: 0x025E size: 16 bit */
            SIU_PCR_tag PCR272;       /* offset: 0x0260 size: 16 bit */
            SIU_PCR_tag PCR273;       /* offset: 0x0262 size: 16 bit */
            SIU_PCR_tag PCR274;       /* offset: 0x0264 size: 16 bit */
            SIU_PCR_tag PCR275;       /* offset: 0x0266 size: 16 bit */
            SIU_PCR_tag PCR276;       /* offset: 0x0268 size: 16 bit */
            SIU_PCR_tag PCR277;       /* offset: 0x026A size: 16 bit */
            SIU_PCR_tag PCR278;       /* offset: 0x026C size: 16 bit */
            SIU_PCR_tag PCR279;       /* offset: 0x026E size: 16 bit */
            SIU_PCR_tag PCR280;       /* offset: 0x0270 size: 16 bit */
            SIU_PCR_tag PCR281;       /* offset: 0x0272 size: 16 bit */
            SIU_PCR_tag PCR282;       /* offset: 0x0274 size: 16 bit */
            SIU_PCR_tag PCR283;       /* offset: 0x0276 size: 16 bit */
            SIU_PCR_tag PCR284;       /* offset: 0x0278 size: 16 bit */
            SIU_PCR_tag PCR285;       /* offset: 0x027A size: 16 bit */
            SIU_PCR_tag PCR286;       /* offset: 0x027C size: 16 bit */
            SIU_PCR_tag PCR287;       /* offset: 0x027E size: 16 bit */
            SIU_PCR_tag PCR288;       /* offset: 0x0280 size: 16 bit */
            SIU_PCR_tag PCR289;       /* offset: 0x0282 size: 16 bit */
            SIU_PCR_tag PCR290;       /* offset: 0x0284 size: 16 bit */
            SIU_PCR_tag PCR291;       /* offset: 0x0286 size: 16 bit */
            SIU_PCR_tag PCR292;       /* offset: 0x0288 size: 16 bit */
            SIU_PCR_tag PCR293;       /* offset: 0x028A size: 16 bit */
            SIU_PCR_tag PCR294;       /* offset: 0x028C size: 16 bit */
            SIU_PCR_tag PCR295;       /* offset: 0x028E size: 16 bit */
            SIU_PCR_tag PCR296;       /* offset: 0x0290 size: 16 bit */
            SIU_PCR_tag PCR297;       /* offset: 0x0292 size: 16 bit */
            SIU_PCR_tag PCR298;       /* offset: 0x0294 size: 16 bit */
            SIU_PCR_tag PCR299;       /* offset: 0x0296 size: 16 bit */
            SIU_PCR_tag PCR300;       /* offset: 0x0298 size: 16 bit */
            SIU_PCR_tag PCR301;       /* offset: 0x029A size: 16 bit */
            SIU_PCR_tag PCR302;       /* offset: 0x029C size: 16 bit */
            SIU_PCR_tag PCR303;       /* offset: 0x029E size: 16 bit */
            SIU_PCR_tag PCR304;       /* offset: 0x02A0 size: 16 bit */
            SIU_PCR_tag PCR305;       /* offset: 0x02A2 size: 16 bit */
            SIU_PCR_tag PCR306;       /* offset: 0x02A4 size: 16 bit */
            SIU_PCR_tag PCR307;       /* offset: 0x02A6 size: 16 bit */
            SIU_PCR_tag PCR308;       /* offset: 0x02A8 size: 16 bit */
            SIU_PCR_tag PCR309;       /* offset: 0x02AA size: 16 bit */
            SIU_PCR_tag PCR310;       /* offset: 0x02AC size: 16 bit */
            SIU_PCR_tag PCR311;       /* offset: 0x02AE size: 16 bit */
            SIU_PCR_tag PCR312;       /* offset: 0x02B0 size: 16 bit */
            SIU_PCR_tag PCR313;       /* offset: 0x02B2 size: 16 bit */
            SIU_PCR_tag PCR314;       /* offset: 0x02B4 size: 16 bit */
            SIU_PCR_tag PCR315;       /* offset: 0x02B6 size: 16 bit */
            SIU_PCR_tag PCR316;       /* offset: 0x02B8 size: 16 bit */
            SIU_PCR_tag PCR317;       /* offset: 0x02BA size: 16 bit */
            SIU_PCR_tag PCR318;       /* offset: 0x02BC size: 16 bit */
            SIU_PCR_tag PCR319;       /* offset: 0x02BE size: 16 bit */
            SIU_PCR_tag PCR320;       /* offset: 0x02C0 size: 16 bit */
            SIU_PCR_tag PCR321;       /* offset: 0x02C2 size: 16 bit */
            SIU_PCR_tag PCR322;       /* offset: 0x02C4 size: 16 bit */
            SIU_PCR_tag PCR323;       /* offset: 0x02C6 size: 16 bit */
            SIU_PCR_tag PCR324;       /* offset: 0x02C8 size: 16 bit */
            SIU_PCR_tag PCR325;       /* offset: 0x02CA size: 16 bit */
            SIU_PCR_tag PCR326;       /* offset: 0x02CC size: 16 bit */
            SIU_PCR_tag PCR327;       /* offset: 0x02CE size: 16 bit */
            SIU_PCR_tag PCR328;       /* offset: 0x02D0 size: 16 bit */
            SIU_PCR_tag PCR329;       /* offset: 0x02D2 size: 16 bit */
            SIU_PCR_tag PCR330;       /* offset: 0x02D4 size: 16 bit */
            SIU_PCR_tag PCR331;       /* offset: 0x02D6 size: 16 bit */
