RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
            SIU_PCR_tag PCR332;       /* offset: 0x02D8 size: 16 bit */
            SIU_PCR_tag PCR333;       /* offset: 0x02DA size: 16 bit */
            SIU_PCR_tag PCR334;       /* offset: 0x02DC size: 16 bit */
            SIU_PCR_tag PCR335;       /* offset: 0x02DE size: 16 bit */
            SIU_PCR_tag PCR336;       /* offset: 0x02E0 size: 16 bit */
            SIU_PCR_tag PCR337;       /* offset: 0x02E2 size: 16 bit */
            SIU_PCR_tag PCR338;       /* offset: 0x02E4 size: 16 bit */
            SIU_PCR_tag PCR339;       /* offset: 0x02E6 size: 16 bit */
            SIU_PCR_tag PCR340;       /* offset: 0x02E8 size: 16 bit */
            SIU_PCR_tag PCR341;       /* offset: 0x02EA size: 16 bit */
            SIU_PCR_tag PCR342;       /* offset: 0x02EC size: 16 bit */
            SIU_PCR_tag PCR343;       /* offset: 0x02EE size: 16 bit */
            SIU_PCR_tag PCR344;       /* offset: 0x02F0 size: 16 bit */
            SIU_PCR_tag PCR345;       /* offset: 0x02F2 size: 16 bit */
            SIU_PCR_tag PCR346;       /* offset: 0x02F4 size: 16 bit */
            SIU_PCR_tag PCR347;       /* offset: 0x02F6 size: 16 bit */
            SIU_PCR_tag PCR348;       /* offset: 0x02F8 size: 16 bit */
            SIU_PCR_tag PCR349;       /* offset: 0x02FA size: 16 bit */
            SIU_PCR_tag PCR350;       /* offset: 0x02FC size: 16 bit */
            SIU_PCR_tag PCR351;       /* offset: 0x02FE size: 16 bit */
            SIU_PCR_tag PCR352;       /* offset: 0x0300 size: 16 bit */
            SIU_PCR_tag PCR353;       /* offset: 0x0302 size: 16 bit */
            SIU_PCR_tag PCR354;       /* offset: 0x0304 size: 16 bit */
            SIU_PCR_tag PCR355;       /* offset: 0x0306 size: 16 bit */
            SIU_PCR_tag PCR356;       /* offset: 0x0308 size: 16 bit */
            SIU_PCR_tag PCR357;       /* offset: 0x030A size: 16 bit */
            SIU_PCR_tag PCR358;       /* offset: 0x030C size: 16 bit */
            SIU_PCR_tag PCR359;       /* offset: 0x030E size: 16 bit */
            SIU_PCR_tag PCR360;       /* offset: 0x0310 size: 16 bit */
            SIU_PCR_tag PCR361;       /* offset: 0x0312 size: 16 bit */
            SIU_PCR_tag PCR362;       /* offset: 0x0314 size: 16 bit */
            SIU_PCR_tag PCR363;       /* offset: 0x0316 size: 16 bit */
            SIU_PCR_tag PCR364;       /* offset: 0x0318 size: 16 bit */
            SIU_PCR_tag PCR365;       /* offset: 0x031A size: 16 bit */
            SIU_PCR_tag PCR366;       /* offset: 0x031C size: 16 bit */
            SIU_PCR_tag PCR367;       /* offset: 0x031E size: 16 bit */
            SIU_PCR_tag PCR368;       /* offset: 0x0320 size: 16 bit */
            SIU_PCR_tag PCR369;       /* offset: 0x0322 size: 16 bit */
            SIU_PCR_tag PCR370;       /* offset: 0x0324 size: 16 bit */
            SIU_PCR_tag PCR371;       /* offset: 0x0326 size: 16 bit */
            SIU_PCR_tag PCR372;       /* offset: 0x0328 size: 16 bit */
            SIU_PCR_tag PCR373;       /* offset: 0x032A size: 16 bit */
            SIU_PCR_tag PCR374;       /* offset: 0x032C size: 16 bit */
            SIU_PCR_tag PCR375;       /* offset: 0x032E size: 16 bit */
            SIU_PCR_tag PCR376;       /* offset: 0x0330 size: 16 bit */
            SIU_PCR_tag PCR377;       /* offset: 0x0332 size: 16 bit */
            SIU_PCR_tag PCR378;       /* offset: 0x0334 size: 16 bit */
            SIU_PCR_tag PCR379;       /* offset: 0x0336 size: 16 bit */
            SIU_PCR_tag PCR380;       /* offset: 0x0338 size: 16 bit */
            SIU_PCR_tag PCR381;       /* offset: 0x033A size: 16 bit */
            SIU_PCR_tag PCR382;       /* offset: 0x033C size: 16 bit */
            SIU_PCR_tag PCR383;       /* offset: 0x033E size: 16 bit */
            SIU_PCR_tag PCR384;       /* offset: 0x0340 size: 16 bit */
            SIU_PCR_tag PCR385;       /* offset: 0x0342 size: 16 bit */
            SIU_PCR_tag PCR386;       /* offset: 0x0344 size: 16 bit */
            SIU_PCR_tag PCR387;       /* offset: 0x0346 size: 16 bit */
            SIU_PCR_tag PCR388;       /* offset: 0x0348 size: 16 bit */
            SIU_PCR_tag PCR389;       /* offset: 0x034A size: 16 bit */
            SIU_PCR_tag PCR390;       /* offset: 0x034C size: 16 bit */
            SIU_PCR_tag PCR391;       /* offset: 0x034E size: 16 bit */
            SIU_PCR_tag PCR392;       /* offset: 0x0350 size: 16 bit */
            SIU_PCR_tag PCR393;       /* offset: 0x0352 size: 16 bit */
            SIU_PCR_tag PCR394;       /* offset: 0x0354 size: 16 bit */
            SIU_PCR_tag PCR395;       /* offset: 0x0356 size: 16 bit */
            SIU_PCR_tag PCR396;       /* offset: 0x0358 size: 16 bit */
            SIU_PCR_tag PCR397;       /* offset: 0x035A size: 16 bit */
            SIU_PCR_tag PCR398;       /* offset: 0x035C size: 16 bit */
            SIU_PCR_tag PCR399;       /* offset: 0x035E size: 16 bit */
            SIU_PCR_tag PCR400;       /* offset: 0x0360 size: 16 bit */
            SIU_PCR_tag PCR401;       /* offset: 0x0362 size: 16 bit */
            SIU_PCR_tag PCR402;       /* offset: 0x0364 size: 16 bit */
            SIU_PCR_tag PCR403;       /* offset: 0x0366 size: 16 bit */
            SIU_PCR_tag PCR404;       /* offset: 0x0368 size: 16 bit */
            SIU_PCR_tag PCR405;       /* offset: 0x036A size: 16 bit */
            SIU_PCR_tag PCR406;       /* offset: 0x036C size: 16 bit */
            SIU_PCR_tag PCR407;       /* offset: 0x036E size: 16 bit */
            SIU_PCR_tag PCR408;       /* offset: 0x0370 size: 16 bit */
            SIU_PCR_tag PCR409;       /* offset: 0x0372 size: 16 bit */
            SIU_PCR_tag PCR410;       /* offset: 0x0374 size: 16 bit */
            SIU_PCR_tag PCR411;       /* offset: 0x0376 size: 16 bit */
            SIU_PCR_tag PCR412;       /* offset: 0x0378 size: 16 bit */
            SIU_PCR_tag PCR413;       /* offset: 0x037A size: 16 bit */
            SIU_PCR_tag PCR414;       /* offset: 0x037C size: 16 bit */
            SIU_PCR_tag PCR415;       /* offset: 0x037E size: 16 bit */
            SIU_PCR_tag PCR416;       /* offset: 0x0380 size: 16 bit */
            SIU_PCR_tag PCR417;       /* offset: 0x0382 size: 16 bit */
            SIU_PCR_tag PCR418;       /* offset: 0x0384 size: 16 bit */
            SIU_PCR_tag PCR419;       /* offset: 0x0386 size: 16 bit */
            SIU_PCR_tag PCR420;       /* offset: 0x0388 size: 16 bit */
            SIU_PCR_tag PCR421;       /* offset: 0x038A size: 16 bit */
            SIU_PCR_tag PCR422;       /* offset: 0x038C size: 16 bit */
            SIU_PCR_tag PCR423;       /* offset: 0x038E size: 16 bit */
            SIU_PCR_tag PCR424;       /* offset: 0x0390 size: 16 bit */
            SIU_PCR_tag PCR425;       /* offset: 0x0392 size: 16 bit */
            SIU_PCR_tag PCR426;       /* offset: 0x0394 size: 16 bit */
            SIU_PCR_tag PCR427;       /* offset: 0x0396 size: 16 bit */
            SIU_PCR_tag PCR428;       /* offset: 0x0398 size: 16 bit */
            SIU_PCR_tag PCR429;       /* offset: 0x039A size: 16 bit */
            SIU_PCR_tag PCR430;       /* offset: 0x039C size: 16 bit */
            SIU_PCR_tag PCR431;       /* offset: 0x039E size: 16 bit */
            SIU_PCR_tag PCR432;       /* offset: 0x03A0 size: 16 bit */
            SIU_PCR_tag PCR433;       /* offset: 0x03A2 size: 16 bit */
            SIU_PCR_tag PCR434;       /* offset: 0x03A4 size: 16 bit */
            SIU_PCR_tag PCR435;       /* offset: 0x03A6 size: 16 bit */
            SIU_PCR_tag PCR436;       /* offset: 0x03A8 size: 16 bit */
            SIU_PCR_tag PCR437;       /* offset: 0x03AA size: 16 bit */
            SIU_PCR_tag PCR438;       /* offset: 0x03AC size: 16 bit */
            SIU_PCR_tag PCR439;       /* offset: 0x03AE size: 16 bit */
            SIU_PCR_tag PCR440;       /* offset: 0x03B0 size: 16 bit */
            SIU_PCR_tag PCR441;       /* offset: 0x03B2 size: 16 bit */
            SIU_PCR_tag PCR442;       /* offset: 0x03B4 size: 16 bit */
            SIU_PCR_tag PCR443;       /* offset: 0x03B6 size: 16 bit */
            SIU_PCR_tag PCR444;       /* offset: 0x03B8 size: 16 bit */
            SIU_PCR_tag PCR445;       /* offset: 0x03BA size: 16 bit */
            SIU_PCR_tag PCR446;       /* offset: 0x03BC size: 16 bit */
            SIU_PCR_tag PCR447;       /* offset: 0x03BE size: 16 bit */
            SIU_PCR_tag PCR448;       /* offset: 0x03C0 size: 16 bit */
            SIU_PCR_tag PCR449;       /* offset: 0x03C2 size: 16 bit */
            SIU_PCR_tag PCR450;       /* offset: 0x03C4 size: 16 bit */
            SIU_PCR_tag PCR451;       /* offset: 0x03C6 size: 16 bit */
            SIU_PCR_tag PCR452;       /* offset: 0x03C8 size: 16 bit */
            SIU_PCR_tag PCR453;       /* offset: 0x03CA size: 16 bit */
            SIU_PCR_tag PCR454;       /* offset: 0x03CC size: 16 bit */
            SIU_PCR_tag PCR455;       /* offset: 0x03CE size: 16 bit */
            SIU_PCR_tag PCR456;       /* offset: 0x03D0 size: 16 bit */
            SIU_PCR_tag PCR457;       /* offset: 0x03D2 size: 16 bit */
            SIU_PCR_tag PCR458;       /* offset: 0x03D4 size: 16 bit */
            SIU_PCR_tag PCR459;       /* offset: 0x03D6 size: 16 bit */
            SIU_PCR_tag PCR460;       /* offset: 0x03D8 size: 16 bit */
            SIU_PCR_tag PCR461;       /* offset: 0x03DA size: 16 bit */
            SIU_PCR_tag PCR462;       /* offset: 0x03DC size: 16 bit */
            SIU_PCR_tag PCR463;       /* offset: 0x03DE size: 16 bit */
            SIU_PCR_tag PCR464;       /* offset: 0x03E0 size: 16 bit */
            SIU_PCR_tag PCR465;       /* offset: 0x03E2 size: 16 bit */
            SIU_PCR_tag PCR466;       /* offset: 0x03E4 size: 16 bit */
            SIU_PCR_tag PCR467;       /* offset: 0x03E6 size: 16 bit */
            SIU_PCR_tag PCR468;       /* offset: 0x03E8 size: 16 bit */
            SIU_PCR_tag PCR469;       /* offset: 0x03EA size: 16 bit */
            SIU_PCR_tag PCR470;       /* offset: 0x03EC size: 16 bit */
            SIU_PCR_tag PCR471;       /* offset: 0x03EE size: 16 bit */
            SIU_PCR_tag PCR472;       /* offset: 0x03F0 size: 16 bit */
            SIU_PCR_tag PCR473;       /* offset: 0x03F2 size: 16 bit */
            SIU_PCR_tag PCR474;       /* offset: 0x03F4 size: 16 bit */
            SIU_PCR_tag PCR475;       /* offset: 0x03F6 size: 16 bit */
            SIU_PCR_tag PCR476;       /* offset: 0x03F8 size: 16 bit */
            SIU_PCR_tag PCR477;       /* offset: 0x03FA size: 16 bit */
            SIU_PCR_tag PCR478;       /* offset: 0x03FC size: 16 bit */
            SIU_PCR_tag PCR479;       /* offset: 0x03FE size: 16 bit */
            SIU_PCR_tag PCR480;       /* offset: 0x0400 size: 16 bit */
            SIU_PCR_tag PCR481;       /* offset: 0x0402 size: 16 bit */
            SIU_PCR_tag PCR482;       /* offset: 0x0404 size: 16 bit */
            SIU_PCR_tag PCR483;       /* offset: 0x0406 size: 16 bit */
            SIU_PCR_tag PCR484;       /* offset: 0x0408 size: 16 bit */
            SIU_PCR_tag PCR485;       /* offset: 0x040A size: 16 bit */
            SIU_PCR_tag PCR486;       /* offset: 0x040C size: 16 bit */
            SIU_PCR_tag PCR487;       /* offset: 0x040E size: 16 bit */
            SIU_PCR_tag PCR488;       /* offset: 0x0410 size: 16 bit */
            SIU_PCR_tag PCR489;       /* offset: 0x0412 size: 16 bit */
            SIU_PCR_tag PCR490;       /* offset: 0x0414 size: 16 bit */
            SIU_PCR_tag PCR491;       /* offset: 0x0416 size: 16 bit */
            SIU_PCR_tag PCR492;       /* offset: 0x0418 size: 16 bit */
            SIU_PCR_tag PCR493;       /* offset: 0x041A size: 16 bit */
            SIU_PCR_tag PCR494;       /* offset: 0x041C size: 16 bit */
            SIU_PCR_tag PCR495;       /* offset: 0x041E size: 16 bit */
            SIU_PCR_tag PCR496;       /* offset: 0x0420 size: 16 bit */
            SIU_PCR_tag PCR497;       /* offset: 0x0422 size: 16 bit */
            SIU_PCR_tag PCR498;       /* offset: 0x0424 size: 16 bit */
            SIU_PCR_tag PCR499;       /* offset: 0x0426 size: 16 bit */
            SIU_PCR_tag PCR500;       /* offset: 0x0428 size: 16 bit */
            SIU_PCR_tag PCR501;       /* offset: 0x042A size: 16 bit */
            SIU_PCR_tag PCR502;       /* offset: 0x042C size: 16 bit */
            SIU_PCR_tag PCR503;       /* offset: 0x042E size: 16 bit */
            SIU_PCR_tag PCR504;       /* offset: 0x0430 size: 16 bit */
            SIU_PCR_tag PCR505;       /* offset: 0x0432 size: 16 bit */
            SIU_PCR_tag PCR506;       /* offset: 0x0434 size: 16 bit */
            SIU_PCR_tag PCR507;       /* offset: 0x0436 size: 16 bit */
            SIU_PCR_tag PCR508;       /* offset: 0x0438 size: 16 bit */
            SIU_PCR_tag PCR509;       /* offset: 0x043A size: 16 bit */
            SIU_PCR_tag PCR510;       /* offset: 0x043C size: 16 bit */
            SIU_PCR_tag PCR511;       /* offset: 0x043E size: 16 bit */
         };

