RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
                                 /* GPDO - GPIO Pad Data Output Register */
            SIUL_GPDO_8B_tag GPDO0;        /* offset: 0x0600 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO1;        /* offset: 0x0601 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO2;        /* offset: 0x0602 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO3;        /* offset: 0x0603 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO4;        /* offset: 0x0604 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO5;        /* offset: 0x0605 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO6;        /* offset: 0x0606 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO7;        /* offset: 0x0607 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO8;        /* offset: 0x0608 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO9;        /* offset: 0x0609 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO10;       /* offset: 0x060A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO11;       /* offset: 0x060B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO12;       /* offset: 0x060C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO13;       /* offset: 0x060D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO14;       /* offset: 0x060E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO15;       /* offset: 0x060F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO16;       /* offset: 0x0610 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO17;       /* offset: 0x0611 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO18;       /* offset: 0x0612 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO19;       /* offset: 0x0613 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO20;       /* offset: 0x0614 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO21;       /* offset: 0x0615 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO22;       /* offset: 0x0616 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO23;       /* offset: 0x0617 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO24;       /* offset: 0x0618 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO25;       /* offset: 0x0619 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO26;       /* offset: 0x061A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO27;       /* offset: 0x061B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO28;       /* offset: 0x061C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO29;       /* offset: 0x061D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO30;       /* offset: 0x061E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO31;       /* offset: 0x061F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO32;       /* offset: 0x0620 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO33;       /* offset: 0x0621 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO34;       /* offset: 0x0622 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO35;       /* offset: 0x0623 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO36;       /* offset: 0x0624 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO37;       /* offset: 0x0625 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO38;       /* offset: 0x0626 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO39;       /* offset: 0x0627 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO40;       /* offset: 0x0628 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO41;       /* offset: 0x0629 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO42;       /* offset: 0x062A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO43;       /* offset: 0x062B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO44;       /* offset: 0x062C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO45;       /* offset: 0x062D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO46;       /* offset: 0x062E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO47;       /* offset: 0x062F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO48;       /* offset: 0x0630 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO49;       /* offset: 0x0631 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO50;       /* offset: 0x0632 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO51;       /* offset: 0x0633 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO52;       /* offset: 0x0634 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO53;       /* offset: 0x0635 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO54;       /* offset: 0x0636 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO55;       /* offset: 0x0637 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO56;       /* offset: 0x0638 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO57;       /* offset: 0x0639 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO58;       /* offset: 0x063A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO59;       /* offset: 0x063B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO60;       /* offset: 0x063C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO61;       /* offset: 0x063D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO62;       /* offset: 0x063E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO63;       /* offset: 0x063F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO64;       /* offset: 0x0640 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO65;       /* offset: 0x0641 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO66;       /* offset: 0x0642 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO67;       /* offset: 0x0643 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO68;       /* offset: 0x0644 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO69;       /* offset: 0x0645 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO70;       /* offset: 0x0646 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO71;       /* offset: 0x0647 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO72;       /* offset: 0x0648 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO73;       /* offset: 0x0649 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO74;       /* offset: 0x064A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO75;       /* offset: 0x064B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO76;       /* offset: 0x064C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO77;       /* offset: 0x064D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO78;       /* offset: 0x064E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO79;       /* offset: 0x064F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO80;       /* offset: 0x0650 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO81;       /* offset: 0x0651 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO82;       /* offset: 0x0652 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO83;       /* offset: 0x0653 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO84;       /* offset: 0x0654 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO85;       /* offset: 0x0655 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO86;       /* offset: 0x0656 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO87;       /* offset: 0x0657 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO88;       /* offset: 0x0658 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO89;       /* offset: 0x0659 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO90;       /* offset: 0x065A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO91;       /* offset: 0x065B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO92;       /* offset: 0x065C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO93;       /* offset: 0x065D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO94;       /* offset: 0x065E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO95;       /* offset: 0x065F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO96;       /* offset: 0x0660 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO97;       /* offset: 0x0661 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO98;       /* offset: 0x0662 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO99;       /* offset: 0x0663 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO100;      /* offset: 0x0664 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO101;      /* offset: 0x0665 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO102;      /* offset: 0x0666 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO103;      /* offset: 0x0667 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO104;      /* offset: 0x0668 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO105;      /* offset: 0x0669 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO106;      /* offset: 0x066A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO107;      /* offset: 0x066B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO108;      /* offset: 0x066C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO109;      /* offset: 0x066D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO110;      /* offset: 0x066E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO111;      /* offset: 0x066F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO112;      /* offset: 0x0670 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO113;      /* offset: 0x0671 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO114;      /* offset: 0x0672 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO115;      /* offset: 0x0673 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO116;      /* offset: 0x0674 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO117;      /* offset: 0x0675 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO118;      /* offset: 0x0676 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO119;      /* offset: 0x0677 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO120;      /* offset: 0x0678 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO121;      /* offset: 0x0679 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO122;      /* offset: 0x067A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO123;      /* offset: 0x067B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO124;      /* offset: 0x067C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO125;      /* offset: 0x067D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO126;      /* offset: 0x067E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO127;      /* offset: 0x067F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO128;      /* offset: 0x0680 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO129;      /* offset: 0x0681 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO130;      /* offset: 0x0682 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO131;      /* offset: 0x0683 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO132;      /* offset: 0x0684 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO133;      /* offset: 0x0685 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO134;      /* offset: 0x0686 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO135;      /* offset: 0x0687 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO136;      /* offset: 0x0688 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO137;      /* offset: 0x0689 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO138;      /* offset: 0x068A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO139;      /* offset: 0x068B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO140;      /* offset: 0x068C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO141;      /* offset: 0x068D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO142;      /* offset: 0x068E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO143;      /* offset: 0x068F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO144;      /* offset: 0x0690 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO145;      /* offset: 0x0691 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO146;      /* offset: 0x0692 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO147;      /* offset: 0x0693 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO148;      /* offset: 0x0694 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO149;      /* offset: 0x0695 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO150;      /* offset: 0x0696 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO151;      /* offset: 0x0697 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO152;      /* offset: 0x0698 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO153;      /* offset: 0x0699 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO154;      /* offset: 0x069A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO155;      /* offset: 0x069B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO156;      /* offset: 0x069C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO157;      /* offset: 0x069D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO158;      /* offset: 0x069E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO159;      /* offset: 0x069F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO160;      /* offset: 0x06A0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO161;      /* offset: 0x06A1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO162;      /* offset: 0x06A2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO163;      /* offset: 0x06A3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO164;      /* offset: 0x06A4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO165;      /* offset: 0x06A5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO166;      /* offset: 0x06A6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO167;      /* offset: 0x06A7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO168;      /* offset: 0x06A8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO169;      /* offset: 0x06A9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO170;      /* offset: 0x06AA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO171;      /* offset: 0x06AB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO172;      /* offset: 0x06AC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO173;      /* offset: 0x06AD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO174;      /* offset: 0x06AE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO175;      /* offset: 0x06AF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO176;      /* offset: 0x06B0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO177;      /* offset: 0x06B1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO178;      /* offset: 0x06B2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO179;      /* offset: 0x06B3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO180;      /* offset: 0x06B4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO181;      /* offset: 0x06B5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO182;      /* offset: 0x06B6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO183;      /* offset: 0x06B7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO184;      /* offset: 0x06B8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO185;      /* offset: 0x06B9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO186;      /* offset: 0x06BA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO187;      /* offset: 0x06BB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO188;      /* offset: 0x06BC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO189;      /* offset: 0x06BD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO190;      /* offset: 0x06BE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO191;      /* offset: 0x06BF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO192;      /* offset: 0x06C0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO193;      /* offset: 0x06C1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO194;      /* offset: 0x06C2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO195;      /* offset: 0x06C3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO196;      /* offset: 0x06C4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO197;      /* offset: 0x06C5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO198;      /* offset: 0x06C6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO199;      /* offset: 0x06C7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO200;      /* offset: 0x06C8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO201;      /* offset: 0x06C9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO202;      /* offset: 0x06CA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO203;      /* offset: 0x06CB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO204;      /* offset: 0x06CC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO205;      /* offset: 0x06CD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO206;      /* offset: 0x06CE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO207;      /* offset: 0x06CF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO208;      /* offset: 0x06D0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO209;      /* offset: 0x06D1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO210;      /* offset: 0x06D2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO211;      /* offset: 0x06D3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO212;      /* offset: 0x06D4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO213;      /* offset: 0x06D5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO214;      /* offset: 0x06D6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO215;      /* offset: 0x06D7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO216;      /* offset: 0x06D8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO217;      /* offset: 0x06D9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO218;      /* offset: 0x06DA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO219;      /* offset: 0x06DB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO220;      /* offset: 0x06DC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO221;      /* offset: 0x06DD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO222;      /* offset: 0x06DE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO223;      /* offset: 0x06DF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO224;      /* offset: 0x06E0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO225;      /* offset: 0x06E1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO226;      /* offset: 0x06E2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO227;      /* offset: 0x06E3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO228;      /* offset: 0x06E4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO229;      /* offset: 0x06E5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO230;      /* offset: 0x06E6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO231;      /* offset: 0x06E7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO232;      /* offset: 0x06E8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO233;      /* offset: 0x06E9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO234;      /* offset: 0x06EA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO235;      /* offset: 0x06EB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO236;      /* offset: 0x06EC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO237;      /* offset: 0x06ED size: 8 bit */
            SIUL_GPDO_8B_tag GPDO238;      /* offset: 0x06EE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO239;      /* offset: 0x06EF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO240;      /* offset: 0x06F0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO241;      /* offset: 0x06F1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO242;      /* offset: 0x06F2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO243;      /* offset: 0x06F3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO244;      /* offset: 0x06F4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO245;      /* offset: 0x06F5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO246;      /* offset: 0x06F6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO247;      /* offset: 0x06F7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO248;      /* offset: 0x06F8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO249;      /* offset: 0x06F9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO250;      /* offset: 0x06FA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO251;      /* offset: 0x06FB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO252;      /* offset: 0x06FC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO253;      /* offset: 0x06FD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO254;      /* offset: 0x06FE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO255;      /* offset: 0x06FF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO256;      /* offset: 0x0700 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO257;      /* offset: 0x0701 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO258;      /* offset: 0x0702 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO259;      /* offset: 0x0703 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO260;      /* offset: 0x0704 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO261;      /* offset: 0x0705 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO262;      /* offset: 0x0706 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO263;      /* offset: 0x0707 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO264;      /* offset: 0x0708 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO265;      /* offset: 0x0709 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO266;      /* offset: 0x070A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO267;      /* offset: 0x070B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO268;      /* offset: 0x070C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO269;      /* offset: 0x070D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO270;      /* offset: 0x070E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO271;      /* offset: 0x070F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO272;      /* offset: 0x0710 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO273;      /* offset: 0x0711 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO274;      /* offset: 0x0712 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO275;      /* offset: 0x0713 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO276;      /* offset: 0x0714 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO277;      /* offset: 0x0715 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO278;      /* offset: 0x0716 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO279;      /* offset: 0x0717 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO280;      /* offset: 0x0718 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO281;      /* offset: 0x0719 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO282;      /* offset: 0x071A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO283;      /* offset: 0x071B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO284;      /* offset: 0x071C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO285;      /* offset: 0x071D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO286;      /* offset: 0x071E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO287;      /* offset: 0x071F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO288;      /* offset: 0x0720 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO289;      /* offset: 0x0721 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO290;      /* offset: 0x0722 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO291;      /* offset: 0x0723 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO292;      /* offset: 0x0724 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO293;      /* offset: 0x0725 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO294;      /* offset: 0x0726 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO295;      /* offset: 0x0727 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO296;      /* offset: 0x0728 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO297;      /* offset: 0x0729 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO298;      /* offset: 0x072A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO299;      /* offset: 0x072B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO300;      /* offset: 0x072C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO301;      /* offset: 0x072D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO302;      /* offset: 0x072E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO303;      /* offset: 0x072F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO304;      /* offset: 0x0730 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO305;      /* offset: 0x0731 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO306;      /* offset: 0x0732 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO307;      /* offset: 0x0733 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO308;      /* offset: 0x0734 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO309;      /* offset: 0x0735 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO310;      /* offset: 0x0736 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO311;      /* offset: 0x0737 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO312;      /* offset: 0x0738 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO313;      /* offset: 0x0739 size: 8 bit */
