RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
            SIUL_GPDO_8B_tag GPDO314;      /* offset: 0x073A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO315;      /* offset: 0x073B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO316;      /* offset: 0x073C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO317;      /* offset: 0x073D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO318;      /* offset: 0x073E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO319;      /* offset: 0x073F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO320;      /* offset: 0x0740 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO321;      /* offset: 0x0741 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO322;      /* offset: 0x0742 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO323;      /* offset: 0x0743 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO324;      /* offset: 0x0744 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO325;      /* offset: 0x0745 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO326;      /* offset: 0x0746 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO327;      /* offset: 0x0747 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO328;      /* offset: 0x0748 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO329;      /* offset: 0x0749 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO330;      /* offset: 0x074A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO331;      /* offset: 0x074B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO332;      /* offset: 0x074C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO333;      /* offset: 0x074D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO334;      /* offset: 0x074E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO335;      /* offset: 0x074F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO336;      /* offset: 0x0750 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO337;      /* offset: 0x0751 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO338;      /* offset: 0x0752 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO339;      /* offset: 0x0753 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO340;      /* offset: 0x0754 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO341;      /* offset: 0x0755 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO342;      /* offset: 0x0756 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO343;      /* offset: 0x0757 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO344;      /* offset: 0x0758 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO345;      /* offset: 0x0759 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO346;      /* offset: 0x075A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO347;      /* offset: 0x075B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO348;      /* offset: 0x075C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO349;      /* offset: 0x075D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO350;      /* offset: 0x075E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO351;      /* offset: 0x075F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO352;      /* offset: 0x0760 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO353;      /* offset: 0x0761 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO354;      /* offset: 0x0762 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO355;      /* offset: 0x0763 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO356;      /* offset: 0x0764 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO357;      /* offset: 0x0765 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO358;      /* offset: 0x0766 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO359;      /* offset: 0x0767 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO360;      /* offset: 0x0768 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO361;      /* offset: 0x0769 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO362;      /* offset: 0x076A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO363;      /* offset: 0x076B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO364;      /* offset: 0x076C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO365;      /* offset: 0x076D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO366;      /* offset: 0x076E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO367;      /* offset: 0x076F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO368;      /* offset: 0x0770 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO369;      /* offset: 0x0771 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO370;      /* offset: 0x0772 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO371;      /* offset: 0x0773 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO372;      /* offset: 0x0774 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO373;      /* offset: 0x0775 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO374;      /* offset: 0x0776 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO375;      /* offset: 0x0777 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO376;      /* offset: 0x0778 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO377;      /* offset: 0x0779 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO378;      /* offset: 0x077A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO379;      /* offset: 0x077B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO380;      /* offset: 0x077C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO381;      /* offset: 0x077D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO382;      /* offset: 0x077E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO383;      /* offset: 0x077F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO384;      /* offset: 0x0780 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO385;      /* offset: 0x0781 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO386;      /* offset: 0x0782 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO387;      /* offset: 0x0783 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO388;      /* offset: 0x0784 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO389;      /* offset: 0x0785 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO390;      /* offset: 0x0786 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO391;      /* offset: 0x0787 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO392;      /* offset: 0x0788 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO393;      /* offset: 0x0789 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO394;      /* offset: 0x078A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO395;      /* offset: 0x078B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO396;      /* offset: 0x078C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO397;      /* offset: 0x078D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO398;      /* offset: 0x078E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO399;      /* offset: 0x078F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO400;      /* offset: 0x0790 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO401;      /* offset: 0x0791 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO402;      /* offset: 0x0792 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO403;      /* offset: 0x0793 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO404;      /* offset: 0x0794 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO405;      /* offset: 0x0795 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO406;      /* offset: 0x0796 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO407;      /* offset: 0x0797 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO408;      /* offset: 0x0798 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO409;      /* offset: 0x0799 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO410;      /* offset: 0x079A size: 8 bit */
            SIUL_GPDO_8B_tag GPDO411;      /* offset: 0x079B size: 8 bit */
            SIUL_GPDO_8B_tag GPDO412;      /* offset: 0x079C size: 8 bit */
            SIUL_GPDO_8B_tag GPDO413;      /* offset: 0x079D size: 8 bit */
            SIUL_GPDO_8B_tag GPDO414;      /* offset: 0x079E size: 8 bit */
            SIUL_GPDO_8B_tag GPDO415;      /* offset: 0x079F size: 8 bit */
            SIUL_GPDO_8B_tag GPDO416;      /* offset: 0x07A0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO417;      /* offset: 0x07A1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO418;      /* offset: 0x07A2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO419;      /* offset: 0x07A3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO420;      /* offset: 0x07A4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO421;      /* offset: 0x07A5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO422;      /* offset: 0x07A6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO423;      /* offset: 0x07A7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO424;      /* offset: 0x07A8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO425;      /* offset: 0x07A9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO426;      /* offset: 0x07AA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO427;      /* offset: 0x07AB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO428;      /* offset: 0x07AC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO429;      /* offset: 0x07AD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO430;      /* offset: 0x07AE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO431;      /* offset: 0x07AF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO432;      /* offset: 0x07B0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO433;      /* offset: 0x07B1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO434;      /* offset: 0x07B2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO435;      /* offset: 0x07B3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO436;      /* offset: 0x07B4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO437;      /* offset: 0x07B5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO438;      /* offset: 0x07B6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO439;      /* offset: 0x07B7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO440;      /* offset: 0x07B8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO441;      /* offset: 0x07B9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO442;      /* offset: 0x07BA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO443;      /* offset: 0x07BB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO444;      /* offset: 0x07BC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO445;      /* offset: 0x07BD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO446;      /* offset: 0x07BE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO447;      /* offset: 0x07BF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO448;      /* offset: 0x07C0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO449;      /* offset: 0x07C1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO450;      /* offset: 0x07C2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO451;      /* offset: 0x07C3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO452;      /* offset: 0x07C4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO453;      /* offset: 0x07C5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO454;      /* offset: 0x07C6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO455;      /* offset: 0x07C7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO456;      /* offset: 0x07C8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO457;      /* offset: 0x07C9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO458;      /* offset: 0x07CA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO459;      /* offset: 0x07CB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO460;      /* offset: 0x07CC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO461;      /* offset: 0x07CD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO462;      /* offset: 0x07CE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO463;      /* offset: 0x07CF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO464;      /* offset: 0x07D0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO465;      /* offset: 0x07D1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO466;      /* offset: 0x07D2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO467;      /* offset: 0x07D3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO468;      /* offset: 0x07D4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO469;      /* offset: 0x07D5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO470;      /* offset: 0x07D6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO471;      /* offset: 0x07D7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO472;      /* offset: 0x07D8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO473;      /* offset: 0x07D9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO474;      /* offset: 0x07DA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO475;      /* offset: 0x07DB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO476;      /* offset: 0x07DC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO477;      /* offset: 0x07DD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO478;      /* offset: 0x07DE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO479;      /* offset: 0x07DF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO480;      /* offset: 0x07E0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO481;      /* offset: 0x07E1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO482;      /* offset: 0x07E2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO483;      /* offset: 0x07E3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO484;      /* offset: 0x07E4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO485;      /* offset: 0x07E5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO486;      /* offset: 0x07E6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO487;      /* offset: 0x07E7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO488;      /* offset: 0x07E8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO489;      /* offset: 0x07E9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO490;      /* offset: 0x07EA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO491;      /* offset: 0x07EB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO492;      /* offset: 0x07EC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO493;      /* offset: 0x07ED size: 8 bit */
            SIUL_GPDO_8B_tag GPDO494;      /* offset: 0x07EE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO495;      /* offset: 0x07EF size: 8 bit */
            SIUL_GPDO_8B_tag GPDO496;      /* offset: 0x07F0 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO497;      /* offset: 0x07F1 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO498;      /* offset: 0x07F2 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO499;      /* offset: 0x07F3 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO500;      /* offset: 0x07F4 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO501;      /* offset: 0x07F5 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO502;      /* offset: 0x07F6 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO503;      /* offset: 0x07F7 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO504;      /* offset: 0x07F8 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO505;      /* offset: 0x07F9 size: 8 bit */
            SIUL_GPDO_8B_tag GPDO506;      /* offset: 0x07FA size: 8 bit */
            SIUL_GPDO_8B_tag GPDO507;      /* offset: 0x07FB size: 8 bit */
            SIUL_GPDO_8B_tag GPDO508;      /* offset: 0x07FC size: 8 bit */
            SIUL_GPDO_8B_tag GPDO509;      /* offset: 0x07FD size: 8 bit */
            SIUL_GPDO_8B_tag GPDO510;      /* offset: 0x07FE size: 8 bit */
            SIUL_GPDO_8B_tag GPDO511;      /* offset: 0x07FF size: 8 bit */
         };

