RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
                                  /* GPDI - GPIO Pad Data Input Register */
            SIUL_GPDI_8B_tag GPDI0;        /* offset: 0x0800 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI1;        /* offset: 0x0801 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI2;        /* offset: 0x0802 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI3;        /* offset: 0x0803 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI4;        /* offset: 0x0804 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI5;        /* offset: 0x0805 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI6;        /* offset: 0x0806 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI7;        /* offset: 0x0807 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI8;        /* offset: 0x0808 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI9;        /* offset: 0x0809 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI10;       /* offset: 0x080A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI11;       /* offset: 0x080B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI12;       /* offset: 0x080C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI13;       /* offset: 0x080D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI14;       /* offset: 0x080E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI15;       /* offset: 0x080F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI16;       /* offset: 0x0810 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI17;       /* offset: 0x0811 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI18;       /* offset: 0x0812 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI19;       /* offset: 0x0813 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI20;       /* offset: 0x0814 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI21;       /* offset: 0x0815 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI22;       /* offset: 0x0816 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI23;       /* offset: 0x0817 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI24;       /* offset: 0x0818 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI25;       /* offset: 0x0819 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI26;       /* offset: 0x081A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI27;       /* offset: 0x081B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI28;       /* offset: 0x081C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI29;       /* offset: 0x081D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI30;       /* offset: 0x081E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI31;       /* offset: 0x081F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI32;       /* offset: 0x0820 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI33;       /* offset: 0x0821 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI34;       /* offset: 0x0822 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI35;       /* offset: 0x0823 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI36;       /* offset: 0x0824 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI37;       /* offset: 0x0825 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI38;       /* offset: 0x0826 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI39;       /* offset: 0x0827 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI40;       /* offset: 0x0828 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI41;       /* offset: 0x0829 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI42;       /* offset: 0x082A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI43;       /* offset: 0x082B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI44;       /* offset: 0x082C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI45;       /* offset: 0x082D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI46;       /* offset: 0x082E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI47;       /* offset: 0x082F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI48;       /* offset: 0x0830 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI49;       /* offset: 0x0831 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI50;       /* offset: 0x0832 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI51;       /* offset: 0x0833 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI52;       /* offset: 0x0834 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI53;       /* offset: 0x0835 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI54;       /* offset: 0x0836 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI55;       /* offset: 0x0837 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI56;       /* offset: 0x0838 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI57;       /* offset: 0x0839 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI58;       /* offset: 0x083A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI59;       /* offset: 0x083B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI60;       /* offset: 0x083C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI61;       /* offset: 0x083D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI62;       /* offset: 0x083E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI63;       /* offset: 0x083F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI64;       /* offset: 0x0840 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI65;       /* offset: 0x0841 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI66;       /* offset: 0x0842 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI67;       /* offset: 0x0843 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI68;       /* offset: 0x0844 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI69;       /* offset: 0x0845 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI70;       /* offset: 0x0846 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI71;       /* offset: 0x0847 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI72;       /* offset: 0x0848 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI73;       /* offset: 0x0849 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI74;       /* offset: 0x084A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI75;       /* offset: 0x084B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI76;       /* offset: 0x084C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI77;       /* offset: 0x084D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI78;       /* offset: 0x084E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI79;       /* offset: 0x084F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI80;       /* offset: 0x0850 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI81;       /* offset: 0x0851 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI82;       /* offset: 0x0852 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI83;       /* offset: 0x0853 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI84;       /* offset: 0x0854 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI85;       /* offset: 0x0855 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI86;       /* offset: 0x0856 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI87;       /* offset: 0x0857 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI88;       /* offset: 0x0858 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI89;       /* offset: 0x0859 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI90;       /* offset: 0x085A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI91;       /* offset: 0x085B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI92;       /* offset: 0x085C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI93;       /* offset: 0x085D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI94;       /* offset: 0x085E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI95;       /* offset: 0x085F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI96;       /* offset: 0x0860 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI97;       /* offset: 0x0861 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI98;       /* offset: 0x0862 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI99;       /* offset: 0x0863 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI100;      /* offset: 0x0864 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI101;      /* offset: 0x0865 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI102;      /* offset: 0x0866 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI103;      /* offset: 0x0867 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI104;      /* offset: 0x0868 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI105;      /* offset: 0x0869 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI106;      /* offset: 0x086A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI107;      /* offset: 0x086B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI108;      /* offset: 0x086C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI109;      /* offset: 0x086D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI110;      /* offset: 0x086E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI111;      /* offset: 0x086F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI112;      /* offset: 0x0870 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI113;      /* offset: 0x0871 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI114;      /* offset: 0x0872 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI115;      /* offset: 0x0873 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI116;      /* offset: 0x0874 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI117;      /* offset: 0x0875 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI118;      /* offset: 0x0876 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI119;      /* offset: 0x0877 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI120;      /* offset: 0x0878 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI121;      /* offset: 0x0879 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI122;      /* offset: 0x087A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI123;      /* offset: 0x087B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI124;      /* offset: 0x087C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI125;      /* offset: 0x087D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI126;      /* offset: 0x087E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI127;      /* offset: 0x087F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI128;      /* offset: 0x0880 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI129;      /* offset: 0x0881 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI130;      /* offset: 0x0882 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI131;      /* offset: 0x0883 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI132;      /* offset: 0x0884 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI133;      /* offset: 0x0885 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI134;      /* offset: 0x0886 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI135;      /* offset: 0x0887 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI136;      /* offset: 0x0888 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI137;      /* offset: 0x0889 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI138;      /* offset: 0x088A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI139;      /* offset: 0x088B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI140;      /* offset: 0x088C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI141;      /* offset: 0x088D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI142;      /* offset: 0x088E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI143;      /* offset: 0x088F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI144;      /* offset: 0x0890 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI145;      /* offset: 0x0891 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI146;      /* offset: 0x0892 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI147;      /* offset: 0x0893 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI148;      /* offset: 0x0894 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI149;      /* offset: 0x0895 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI150;      /* offset: 0x0896 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI151;      /* offset: 0x0897 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI152;      /* offset: 0x0898 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI153;      /* offset: 0x0899 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI154;      /* offset: 0x089A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI155;      /* offset: 0x089B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI156;      /* offset: 0x089C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI157;      /* offset: 0x089D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI158;      /* offset: 0x089E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI159;      /* offset: 0x089F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI160;      /* offset: 0x08A0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI161;      /* offset: 0x08A1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI162;      /* offset: 0x08A2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI163;      /* offset: 0x08A3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI164;      /* offset: 0x08A4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI165;      /* offset: 0x08A5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI166;      /* offset: 0x08A6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI167;      /* offset: 0x08A7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI168;      /* offset: 0x08A8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI169;      /* offset: 0x08A9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI170;      /* offset: 0x08AA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI171;      /* offset: 0x08AB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI172;      /* offset: 0x08AC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI173;      /* offset: 0x08AD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI174;      /* offset: 0x08AE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI175;      /* offset: 0x08AF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI176;      /* offset: 0x08B0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI177;      /* offset: 0x08B1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI178;      /* offset: 0x08B2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI179;      /* offset: 0x08B3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI180;      /* offset: 0x08B4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI181;      /* offset: 0x08B5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI182;      /* offset: 0x08B6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI183;      /* offset: 0x08B7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI184;      /* offset: 0x08B8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI185;      /* offset: 0x08B9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI186;      /* offset: 0x08BA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI187;      /* offset: 0x08BB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI188;      /* offset: 0x08BC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI189;      /* offset: 0x08BD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI190;      /* offset: 0x08BE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI191;      /* offset: 0x08BF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI192;      /* offset: 0x08C0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI193;      /* offset: 0x08C1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI194;      /* offset: 0x08C2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI195;      /* offset: 0x08C3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI196;      /* offset: 0x08C4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI197;      /* offset: 0x08C5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI198;      /* offset: 0x08C6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI199;      /* offset: 0x08C7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI200;      /* offset: 0x08C8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI201;      /* offset: 0x08C9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI202;      /* offset: 0x08CA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI203;      /* offset: 0x08CB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI204;      /* offset: 0x08CC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI205;      /* offset: 0x08CD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI206;      /* offset: 0x08CE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI207;      /* offset: 0x08CF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI208;      /* offset: 0x08D0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI209;      /* offset: 0x08D1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI210;      /* offset: 0x08D2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI211;      /* offset: 0x08D3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI212;      /* offset: 0x08D4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI213;      /* offset: 0x08D5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI214;      /* offset: 0x08D6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI215;      /* offset: 0x08D7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI216;      /* offset: 0x08D8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI217;      /* offset: 0x08D9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI218;      /* offset: 0x08DA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI219;      /* offset: 0x08DB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI220;      /* offset: 0x08DC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI221;      /* offset: 0x08DD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI222;      /* offset: 0x08DE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI223;      /* offset: 0x08DF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI224;      /* offset: 0x08E0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI225;      /* offset: 0x08E1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI226;      /* offset: 0x08E2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI227;      /* offset: 0x08E3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI228;      /* offset: 0x08E4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI229;      /* offset: 0x08E5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI230;      /* offset: 0x08E6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI231;      /* offset: 0x08E7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI232;      /* offset: 0x08E8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI233;      /* offset: 0x08E9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI234;      /* offset: 0x08EA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI235;      /* offset: 0x08EB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI236;      /* offset: 0x08EC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI237;      /* offset: 0x08ED size: 8 bit */
            SIUL_GPDI_8B_tag GPDI238;      /* offset: 0x08EE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI239;      /* offset: 0x08EF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI240;      /* offset: 0x08F0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI241;      /* offset: 0x08F1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI242;      /* offset: 0x08F2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI243;      /* offset: 0x08F3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI244;      /* offset: 0x08F4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI245;      /* offset: 0x08F5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI246;      /* offset: 0x08F6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI247;      /* offset: 0x08F7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI248;      /* offset: 0x08F8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI249;      /* offset: 0x08F9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI250;      /* offset: 0x08FA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI251;      /* offset: 0x08FB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI252;      /* offset: 0x08FC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI253;      /* offset: 0x08FD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI254;      /* offset: 0x08FE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI255;      /* offset: 0x08FF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI256;      /* offset: 0x0900 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI257;      /* offset: 0x0901 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI258;      /* offset: 0x0902 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI259;      /* offset: 0x0903 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI260;      /* offset: 0x0904 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI261;      /* offset: 0x0905 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI262;      /* offset: 0x0906 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI263;      /* offset: 0x0907 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI264;      /* offset: 0x0908 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI265;      /* offset: 0x0909 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI266;      /* offset: 0x090A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI267;      /* offset: 0x090B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI268;      /* offset: 0x090C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI269;      /* offset: 0x090D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI270;      /* offset: 0x090E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI271;      /* offset: 0x090F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI272;      /* offset: 0x0910 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI273;      /* offset: 0x0911 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI274;      /* offset: 0x0912 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI275;      /* offset: 0x0913 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI276;      /* offset: 0x0914 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI277;      /* offset: 0x0915 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI278;      /* offset: 0x0916 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI279;      /* offset: 0x0917 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI280;      /* offset: 0x0918 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI281;      /* offset: 0x0919 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI282;      /* offset: 0x091A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI283;      /* offset: 0x091B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI284;      /* offset: 0x091C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI285;      /* offset: 0x091D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI286;      /* offset: 0x091E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI287;      /* offset: 0x091F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI288;      /* offset: 0x0920 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI289;      /* offset: 0x0921 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI290;      /* offset: 0x0922 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI291;      /* offset: 0x0923 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI292;      /* offset: 0x0924 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI293;      /* offset: 0x0925 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI294;      /* offset: 0x0926 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI295;      /* offset: 0x0927 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI296;      /* offset: 0x0928 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI297;      /* offset: 0x0929 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI298;      /* offset: 0x092A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI299;      /* offset: 0x092B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI300;      /* offset: 0x092C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI301;      /* offset: 0x092D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI302;      /* offset: 0x092E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI303;      /* offset: 0x092F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI304;      /* offset: 0x0930 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI305;      /* offset: 0x0931 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI306;      /* offset: 0x0932 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI307;      /* offset: 0x0933 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI308;      /* offset: 0x0934 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI309;      /* offset: 0x0935 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI310;      /* offset: 0x0936 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI311;      /* offset: 0x0937 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI312;      /* offset: 0x0938 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI313;      /* offset: 0x0939 size: 8 bit */
