RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
            SIUL_GPDI_8B_tag GPDI314;      /* offset: 0x093A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI315;      /* offset: 0x093B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI316;      /* offset: 0x093C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI317;      /* offset: 0x093D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI318;      /* offset: 0x093E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI319;      /* offset: 0x093F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI320;      /* offset: 0x0940 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI321;      /* offset: 0x0941 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI322;      /* offset: 0x0942 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI323;      /* offset: 0x0943 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI324;      /* offset: 0x0944 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI325;      /* offset: 0x0945 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI326;      /* offset: 0x0946 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI327;      /* offset: 0x0947 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI328;      /* offset: 0x0948 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI329;      /* offset: 0x0949 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI330;      /* offset: 0x094A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI331;      /* offset: 0x094B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI332;      /* offset: 0x094C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI333;      /* offset: 0x094D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI334;      /* offset: 0x094E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI335;      /* offset: 0x094F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI336;      /* offset: 0x0950 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI337;      /* offset: 0x0951 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI338;      /* offset: 0x0952 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI339;      /* offset: 0x0953 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI340;      /* offset: 0x0954 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI341;      /* offset: 0x0955 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI342;      /* offset: 0x0956 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI343;      /* offset: 0x0957 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI344;      /* offset: 0x0958 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI345;      /* offset: 0x0959 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI346;      /* offset: 0x095A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI347;      /* offset: 0x095B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI348;      /* offset: 0x095C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI349;      /* offset: 0x095D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI350;      /* offset: 0x095E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI351;      /* offset: 0x095F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI352;      /* offset: 0x0960 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI353;      /* offset: 0x0961 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI354;      /* offset: 0x0962 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI355;      /* offset: 0x0963 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI356;      /* offset: 0x0964 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI357;      /* offset: 0x0965 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI358;      /* offset: 0x0966 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI359;      /* offset: 0x0967 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI360;      /* offset: 0x0968 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI361;      /* offset: 0x0969 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI362;      /* offset: 0x096A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI363;      /* offset: 0x096B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI364;      /* offset: 0x096C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI365;      /* offset: 0x096D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI366;      /* offset: 0x096E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI367;      /* offset: 0x096F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI368;      /* offset: 0x0970 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI369;      /* offset: 0x0971 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI370;      /* offset: 0x0972 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI371;      /* offset: 0x0973 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI372;      /* offset: 0x0974 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI373;      /* offset: 0x0975 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI374;      /* offset: 0x0976 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI375;      /* offset: 0x0977 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI376;      /* offset: 0x0978 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI377;      /* offset: 0x0979 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI378;      /* offset: 0x097A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI379;      /* offset: 0x097B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI380;      /* offset: 0x097C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI381;      /* offset: 0x097D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI382;      /* offset: 0x097E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI383;      /* offset: 0x097F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI384;      /* offset: 0x0980 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI385;      /* offset: 0x0981 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI386;      /* offset: 0x0982 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI387;      /* offset: 0x0983 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI388;      /* offset: 0x0984 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI389;      /* offset: 0x0985 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI390;      /* offset: 0x0986 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI391;      /* offset: 0x0987 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI392;      /* offset: 0x0988 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI393;      /* offset: 0x0989 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI394;      /* offset: 0x098A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI395;      /* offset: 0x098B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI396;      /* offset: 0x098C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI397;      /* offset: 0x098D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI398;      /* offset: 0x098E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI399;      /* offset: 0x098F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI400;      /* offset: 0x0990 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI401;      /* offset: 0x0991 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI402;      /* offset: 0x0992 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI403;      /* offset: 0x0993 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI404;      /* offset: 0x0994 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI405;      /* offset: 0x0995 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI406;      /* offset: 0x0996 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI407;      /* offset: 0x0997 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI408;      /* offset: 0x0998 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI409;      /* offset: 0x0999 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI410;      /* offset: 0x099A size: 8 bit */
            SIUL_GPDI_8B_tag GPDI411;      /* offset: 0x099B size: 8 bit */
            SIUL_GPDI_8B_tag GPDI412;      /* offset: 0x099C size: 8 bit */
            SIUL_GPDI_8B_tag GPDI413;      /* offset: 0x099D size: 8 bit */
            SIUL_GPDI_8B_tag GPDI414;      /* offset: 0x099E size: 8 bit */
            SIUL_GPDI_8B_tag GPDI415;      /* offset: 0x099F size: 8 bit */
            SIUL_GPDI_8B_tag GPDI416;      /* offset: 0x09A0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI417;      /* offset: 0x09A1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI418;      /* offset: 0x09A2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI419;      /* offset: 0x09A3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI420;      /* offset: 0x09A4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI421;      /* offset: 0x09A5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI422;      /* offset: 0x09A6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI423;      /* offset: 0x09A7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI424;      /* offset: 0x09A8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI425;      /* offset: 0x09A9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI426;      /* offset: 0x09AA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI427;      /* offset: 0x09AB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI428;      /* offset: 0x09AC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI429;      /* offset: 0x09AD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI430;      /* offset: 0x09AE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI431;      /* offset: 0x09AF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI432;      /* offset: 0x09B0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI433;      /* offset: 0x09B1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI434;      /* offset: 0x09B2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI435;      /* offset: 0x09B3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI436;      /* offset: 0x09B4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI437;      /* offset: 0x09B5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI438;      /* offset: 0x09B6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI439;      /* offset: 0x09B7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI440;      /* offset: 0x09B8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI441;      /* offset: 0x09B9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI442;      /* offset: 0x09BA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI443;      /* offset: 0x09BB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI444;      /* offset: 0x09BC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI445;      /* offset: 0x09BD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI446;      /* offset: 0x09BE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI447;      /* offset: 0x09BF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI448;      /* offset: 0x09C0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI449;      /* offset: 0x09C1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI450;      /* offset: 0x09C2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI451;      /* offset: 0x09C3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI452;      /* offset: 0x09C4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI453;      /* offset: 0x09C5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI454;      /* offset: 0x09C6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI455;      /* offset: 0x09C7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI456;      /* offset: 0x09C8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI457;      /* offset: 0x09C9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI458;      /* offset: 0x09CA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI459;      /* offset: 0x09CB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI460;      /* offset: 0x09CC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI461;      /* offset: 0x09CD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI462;      /* offset: 0x09CE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI463;      /* offset: 0x09CF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI464;      /* offset: 0x09D0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI465;      /* offset: 0x09D1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI466;      /* offset: 0x09D2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI467;      /* offset: 0x09D3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI468;      /* offset: 0x09D4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI469;      /* offset: 0x09D5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI470;      /* offset: 0x09D6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI471;      /* offset: 0x09D7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI472;      /* offset: 0x09D8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI473;      /* offset: 0x09D9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI474;      /* offset: 0x09DA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI475;      /* offset: 0x09DB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI476;      /* offset: 0x09DC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI477;      /* offset: 0x09DD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI478;      /* offset: 0x09DE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI479;      /* offset: 0x09DF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI480;      /* offset: 0x09E0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI481;      /* offset: 0x09E1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI482;      /* offset: 0x09E2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI483;      /* offset: 0x09E3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI484;      /* offset: 0x09E4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI485;      /* offset: 0x09E5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI486;      /* offset: 0x09E6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI487;      /* offset: 0x09E7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI488;      /* offset: 0x09E8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI489;      /* offset: 0x09E9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI490;      /* offset: 0x09EA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI491;      /* offset: 0x09EB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI492;      /* offset: 0x09EC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI493;      /* offset: 0x09ED size: 8 bit */
            SIUL_GPDI_8B_tag GPDI494;      /* offset: 0x09EE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI495;      /* offset: 0x09EF size: 8 bit */
            SIUL_GPDI_8B_tag GPDI496;      /* offset: 0x09F0 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI497;      /* offset: 0x09F1 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI498;      /* offset: 0x09F2 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI499;      /* offset: 0x09F3 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI500;      /* offset: 0x09F4 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI501;      /* offset: 0x09F5 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI502;      /* offset: 0x09F6 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI503;      /* offset: 0x09F7 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI504;      /* offset: 0x09F8 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI505;      /* offset: 0x09F9 size: 8 bit */
            SIUL_GPDI_8B_tag GPDI506;      /* offset: 0x09FA size: 8 bit */
            SIUL_GPDI_8B_tag GPDI507;      /* offset: 0x09FB size: 8 bit */
            SIUL_GPDI_8B_tag GPDI508;      /* offset: 0x09FC size: 8 bit */
            SIUL_GPDI_8B_tag GPDI509;      /* offset: 0x09FD size: 8 bit */
            SIUL_GPDI_8B_tag GPDI510;      /* offset: 0x09FE size: 8 bit */
            SIUL_GPDI_8B_tag GPDI511;      /* offset: 0x09FF size: 8 bit */
         };

