RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      int8_t SIUL_reserved_0D00_C[768];
      union {
                     /* IFMC - Interrupt Filter Maximum Counter Register */
         SIUL_IFMC_32B_tag IFMC[32];       /* offset: 0x1000  (0x0004 x 32) */

         struct {
                     /* IFMC - Interrupt Filter Maximum Counter Register */
            SIUL_IFMC_32B_tag IFMC0;       /* offset: 0x1000 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC1;       /* offset: 0x1004 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC2;       /* offset: 0x1008 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC3;       /* offset: 0x100C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC4;       /* offset: 0x1010 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC5;       /* offset: 0x1014 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC6;       /* offset: 0x1018 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC7;       /* offset: 0x101C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC8;       /* offset: 0x1020 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC9;       /* offset: 0x1024 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC10;      /* offset: 0x1028 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC11;      /* offset: 0x102C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC12;      /* offset: 0x1030 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC13;      /* offset: 0x1034 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC14;      /* offset: 0x1038 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC15;      /* offset: 0x103C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC16;      /* offset: 0x1040 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC17;      /* offset: 0x1044 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC18;      /* offset: 0x1048 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC19;      /* offset: 0x104C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC20;      /* offset: 0x1050 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC21;      /* offset: 0x1054 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC22;      /* offset: 0x1058 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC23;      /* offset: 0x105C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC24;      /* offset: 0x1060 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC25;      /* offset: 0x1064 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC26;      /* offset: 0x1068 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC27;      /* offset: 0x106C size: 32 bit */
            SIUL_IFMC_32B_tag IFMC28;      /* offset: 0x1070 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC29;      /* offset: 0x1074 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC30;      /* offset: 0x1078 size: 32 bit */
            SIUL_IFMC_32B_tag IFMC31;      /* offset: 0x107C size: 32 bit */
         };

      };
                     /* IFCPR - Inerrupt Filter Clock Prescaler Register */
      SIUL_IFCPR_32B_tag IFCPR;            /* offset: 0x1080 size: 32 bit */
   } SIU_tag;


#define SIUL  (*(volatile SIU_tag *) 0xC3F90000UL)



/****************************************************************/
/*                                                              */
/* Module: WKPU  */
/*                                                              */
/****************************************************************/

   typedef union {   /* WKPU_NSR - NMI Status Flag Register */
      uint32_t R;
      struct {
         uint32_t  NIF0:1;            /* NMI Status Flag 0 */
         uint32_t  NOVF0:1;           /* NMI Overrun Status Flag 0 */
         uint32_t:6;
         uint32_t  NIF1:1;            /* NMI Status Flag 1 */
         uint32_t  NOVF1:1;           /* NMI Overrun Status Flag 1 */
         uint32_t:6;
         uint32_t  NIF2:1;            /* NMI Status Flag 2 */
         uint32_t  NOVF2:1;           /* NMI Overrun Status Flag 2 */
         uint32_t:6;
         uint32_t  NIF3:1;            /* NMI Status Flag 3 */
         uint32_t  NOVF3:1;           /* NMI Overrun Status Flag 3 */
         uint32_t:6;
      } B;
   } WKPU_NSR_32B_tag;

   typedef union {   /* WKPU_NCR - NMI Configuration Register */
      uint32_t R;
      struct {
         uint32_t  NLOCK0:1;          /* NMI Configuration Lock Register 0 */
         uint32_t  NDSS0:2;           /* NMI Desination Source Select 0 */
         uint32_t  NWRE0:1;           /* NMI Wakeup Request Enable 0 */
         uint32_t:1;
         uint32_t  NREE0:1;           /* NMI Rising Edge Events Enable 0 */
         uint32_t  NFEE0:1;           /* NMI Falling Edge Events Enable 0 */
         uint32_t  NFE0:1;            /* NMI Filter Enable 0 */
         uint32_t  NLOCK1:1;          /* NMI Configuration Lock Register 1 */
         uint32_t  NDSS1:2;           /* NMI Desination Source Select 1 */
         uint32_t  NWRE1:1;           /* NMI Wakeup Request Enable 1 */
         uint32_t:1;
         uint32_t  NREE1:1;           /* NMI Rising Edge Events Enable 1 */
         uint32_t  NFEE1:1;           /* NMI Falling Edge Events Enable 1 */
         uint32_t  NFE1:1;            /* NMI Filter Enable 1 */
         uint32_t  NLOCK2:1;          /* NMI Configuration Lock Register 2 */
         uint32_t  NDSS2:2;           /* NMI Desination Source Select 2 */
         uint32_t  NWRE2:1;           /* NMI Wakeup Request Enable 2 */
         uint32_t:1;
         uint32_t  NREE2:1;           /* NMI Rising Edge Events Enable 2 */
         uint32_t  NFEE2:1;           /* NMI Falling Edge Events Enable 2 */
         uint32_t  NFE2:1;            /* NMI Filter Enable 2 */
         uint32_t  NLOCK3:1;          /* NMI Configuration Lock Register 3 */
         uint32_t  NDSS3:2;           /* NMI Desination Source Select 3 */
         uint32_t  NWRE3:1;           /* NMI Wakeup Request Enable 3 */
         uint32_t:1;
         uint32_t  NREE3:1;           /* NMI Rising Edge Events Enable 3 */
         uint32_t  NFEE3:1;           /* NMI Falling Edge Events Enable 3 */
         uint32_t  NFE3:1;            /* NMI Filter Enable 3 */
      } B;
   } WKPU_NCR_32B_tag;

