RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* WKPU_WISR - Wakeup/Interrupt Status Flag Register */
      uint32_t R;
      struct {
         uint32_t  EIF:32;            /* External Wakeup/Interrupt Status Flag */
      } B;
   } WKPU_WISR_32B_tag;

   typedef union {   /* WKPU_IRER - Interrupt Request Enable Register */
      uint32_t R;
      struct {
         uint32_t  EIRE:32;           /* Enable External Interrupt Requests */
      } B;
   } WKPU_IRER_32B_tag;

   typedef union {   /* WKPU_WRER - Wakeup Request Enable Register */
      uint32_t R;
      struct {
         uint32_t  WRE:32;            /* Enable Wakeup requests to the mode entry module */
      } B;
   } WKPU_WRER_32B_tag;

   typedef union {   /* WKPU_WIREER - Wakeup/Interrupt Rising-Edge Event Enable Register */
      uint32_t R;
      struct {
         uint32_t  IREE:32;           /* Enable rising-edge events to cause EIF[x] to be set */
      } B;
   } WKPU_WIREER_32B_tag;

   typedef union {   /* WKPU_WIFEER - Wakeup/Interrupt Falling-Edge Event Enable Register */
      uint32_t R;
      struct {
         uint32_t  IFEE:32;           /* Enable Falling-edge events to cause EIF[x] to be set */
      } B;
   } WKPU_WIFEER_32B_tag;

   typedef union {   /* WKPU_WIFER - Wakeup/Interrupt Filter Enable Register */
      uint32_t R;
      struct {
         uint32_t  IFE:32;            /* Enable Digital glitch filter on the interrupt pad input */
      } B;
   } WKPU_WIFER_32B_tag;

   typedef union {   /* WKPU_WIPUER - Wakeup/Interrupt Pullup Enable Register */
      uint32_t R;
      struct {
         uint32_t  IPUE:32;           /* Enable a pullup on the interrupt pad input */
      } B;
   } WKPU_WIPUER_32B_tag;



   typedef struct WKPU_struct_tag { /* start of WKPU_tag */
                                  /* WKPU_NSR - NMI Status Flag Register */
      WKPU_NSR_32B_tag NSR;                /* offset: 0x0000 size: 32 bit */
      int8_t WKPU_reserved_0004[4];
                                /* WKPU_NCR - NMI Configuration Register */
      WKPU_NCR_32B_tag NCR;                /* offset: 0x0008 size: 32 bit */
      int8_t WKPU_reserved_000C[8];
                    /* WKPU_WISR - Wakeup/Interrupt Status Flag Register */
      WKPU_WISR_32B_tag WISR;              /* offset: 0x0014 size: 32 bit */
                        /* WKPU_IRER - Interrupt Request Enable Register */
      WKPU_IRER_32B_tag IRER;              /* offset: 0x0018 size: 32 bit */
                           /* WKPU_WRER - Wakeup Request Enable Register */
      WKPU_WRER_32B_tag WRER;              /* offset: 0x001C size: 32 bit */
      int8_t WKPU_reserved_0020[8];
     /* WKPU_WIREER - Wakeup/Interrupt Rising-Edge Event Enable Register */
      WKPU_WIREER_32B_tag WIREER;          /* offset: 0x0028 size: 32 bit */
    /* WKPU_WIFEER - Wakeup/Interrupt Falling-Edge Event Enable Register */
      WKPU_WIFEER_32B_tag WIFEER;          /* offset: 0x002C size: 32 bit */
                 /* WKPU_WIFER - Wakeup/Interrupt Filter Enable Register */
      WKPU_WIFER_32B_tag WIFER;            /* offset: 0x0030 size: 32 bit */
                /* WKPU_WIPUER - Wakeup/Interrupt Pullup Enable Register */
      WKPU_WIPUER_32B_tag WIPUER;          /* offset: 0x0034 size: 32 bit */
   } WKPU_tag;


#define WKPU  (*(volatile WKPU_tag *) 0xC3F94000UL)



/****************************************************************/
/*                                                              */
/* Module: SSCM  */
/*                                                              */
/****************************************************************/

   typedef union {   /* SSCM_STATUS - System Status Register */
      uint16_t R;
      struct {
         uint16_t  LSM:1;             /* Lock Step Mode */
         uint16_t:2;
         uint16_t  NXEN1:1;           /* Processor 1 Nexus enabled */
         uint16_t  NXEN:1;            /* Processor 0 Nexus enabled */
         uint16_t  PUB:1;             /* Public Serial Access Status */
         uint16_t  SEC:1;             /* Security Status */
         uint16_t:1;
         uint16_t  BMODE:3;           /* Device Boot Mode */
         uint16_t  VLE:1;             /* Variable Length Instruction Mode */
         uint16_t  ABD:1;             /* Autobaud detection */
         uint16_t:3;
      } B;
   } SSCM_STATUS_16B_tag;

   typedef union {   /* SSCM_MEMCONFIG - System Memory Configuration Register */
      uint16_t R;
      struct {
         uint16_t  JPIN:10;           /* JTAG Part ID Number */
         uint16_t  IVLD:1;            /* Instruction Flash Valid */
         uint16_t  MREV:4;            /* Minor Mask Revision */
         uint16_t  DVLD:1;            /* Data Flash Valid */
      } B;
   } SSCM_MEMCONFIG_16B_tag;

   typedef union {   /* SSCM_ERROR - Error Configuration */
      uint16_t R;
      struct {
         uint16_t:14;
         uint16_t  PAE:1;             /* Peripheral Bus Abort Enable */
         uint16_t  RAE:1;             /* Register Bus Abort Enable */
      } B;
   } SSCM_ERROR_16B_tag;

   typedef union {   /* SSCM_DEBUGPORT - Debug Status Port Register */
      uint16_t R;
      struct {
         uint16_t:13;
         uint16_t  DEBUG_MODE:3;      /* Debug Status Port Mode */
      } B;
   } SSCM_DEBUGPORT_16B_tag;

   typedef union {   /* SSCM_PWCMPH - Password Comparison Register High */
      uint32_t R;
      struct {
         uint32_t  PWD_HI:32;         /* Password High */
      } B;
   } SSCM_PWCMPH_32B_tag;

   typedef union {   /* SSCM_PWCMPL - Password Comparison Register Low */
      uint32_t R;
      struct {
         uint32_t  PWD_LO:32;         /* Password Low */
      } B;
   } SSCM_PWCMPL_32B_tag;

   typedef union {   /* SSCM_DPMBOOT - Decoupled Parallel Boot Register */
      uint32_t R;
      struct {
         uint32_t  P2BOOT:30;         /* boot location 2nd processor */
         uint32_t  DVLE:1;            /* VLE mode for 2nd processor */
         uint32_t:1;
      } B;
   } SSCM_DPMBOOT_32B_tag;

   typedef union {   /* SSCM_DPMKEY - Boot Key Register */
      uint32_t R;
      struct {
         uint32_t  KEY:32;            /* Boot Control Key */
      } B;
   } SSCM_DPMKEY_32B_tag;

   typedef union {   /* SSCM_UOPS - User Option Status Register */
      uint32_t R;
      struct {
         uint32_t  UOPT:32;           /* User Option Bits */
      } B;
   } SSCM_UOPS_32B_tag;

   typedef union {   /* SSCM_SCTR - SSCM Control Register */
      uint32_t R;
      struct {
         uint32_t:29;
         uint32_t  TFE:1;             /* Test Flash Enable */
         uint32_t  DSL:1;             /* Disable Software-Controlled MBIST */
         uint32_t  DSM:1;             /* Disable Software-Controlled LBIST */
      } B;
   } SSCM_SCTR_32B_tag;

   typedef union {   /* SSCM_TF_INFO0 - TestFlash Information Register 0 */
      uint32_t R;
      struct {
         uint32_t  TINFO0:32;         /* General purpose TestFlash word 0 */
      } B;
   } SSCM_TF_INFO0_32B_tag;

   typedef union {   /* SSCM_TF_INFO1 - TestFlash Information Register 1 */
      uint32_t R;
      struct {
         uint32_t  TINFO1:32;         /* General purpose TestFlash word 1 */
      } B;
   } SSCM_TF_INFO1_32B_tag;

   typedef union {   /* SSCM_TF_INFO2 - TestFlash Information Register 2 */
      uint32_t R;
      struct {
         uint32_t  TINFO2:32;         /* General purpose TestFlash word 2 */
      } B;
   } SSCM_TF_INFO2_32B_tag;

   typedef union {   /* SSCM_TF_INFO3 - TestFlash Information Register 3 */
      uint32_t R;
      struct {
         uint32_t  TINFO3:32;         /* General purpose TestFlash word */
      } B;
   } SSCM_TF_INFO3_32B_tag;



