RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef struct SSCM_struct_tag { /* start of SSCM_tag */
                                 /* SSCM_STATUS - System Status Register */
      SSCM_STATUS_16B_tag STATUS;          /* offset: 0x0000 size: 16 bit */
                /* SSCM_MEMCONFIG - System Memory Configuration Register */
      SSCM_MEMCONFIG_16B_tag MEMCONFIG;    /* offset: 0x0002 size: 16 bit */
      int8_t SSCM_reserved_0004[2];
                                     /* SSCM_ERROR - Error Configuration */
      SSCM_ERROR_16B_tag ERROR;            /* offset: 0x0006 size: 16 bit */
                          /* SSCM_DEBUGPORT - Debug Status Port Register */
      SSCM_DEBUGPORT_16B_tag DEBUGPORT;    /* offset: 0x0008 size: 16 bit */
      int8_t SSCM_reserved_000A[2];
                      /* SSCM_PWCMPH - Password Comparison Register High */
      SSCM_PWCMPH_32B_tag PWCMPH;          /* offset: 0x000C size: 32 bit */
                       /* SSCM_PWCMPL - Password Comparison Register Low */
      SSCM_PWCMPL_32B_tag PWCMPL;          /* offset: 0x0010 size: 32 bit */
      int8_t SSCM_reserved_0014[4];
                      /* SSCM_DPMBOOT - Decoupled Parallel Boot Register */
      SSCM_DPMBOOT_32B_tag DPMBOOT;        /* offset: 0x0018 size: 32 bit */
                                      /* SSCM_DPMKEY - Boot Key Register */
      SSCM_DPMKEY_32B_tag DPMKEY;          /* offset: 0x001C size: 32 bit */
                              /* SSCM_UOPS - User Option Status Register */
      SSCM_UOPS_32B_tag UOPS;              /* offset: 0x0020 size: 32 bit */
                                    /* SSCM_SCTR - SSCM Control Register */
      SSCM_SCTR_32B_tag SCTR;              /* offset: 0x0024 size: 32 bit */
                     /* SSCM_TF_INFO0 - TestFlash Information Register 0 */
      SSCM_TF_INFO0_32B_tag TF_INFO0;      /* offset: 0x0028 size: 32 bit */
                     /* SSCM_TF_INFO1 - TestFlash Information Register 1 */
      SSCM_TF_INFO1_32B_tag TF_INFO1;      /* offset: 0x002C size: 32 bit */
                     /* SSCM_TF_INFO2 - TestFlash Information Register 2 */
      SSCM_TF_INFO2_32B_tag TF_INFO2;      /* offset: 0x0030 size: 32 bit */
                     /* SSCM_TF_INFO3 - TestFlash Information Register 3 */
      SSCM_TF_INFO3_32B_tag TF_INFO3;      /* offset: 0x0034 size: 32 bit */
   } SSCM_tag;


#define SSCM  (*(volatile SSCM_tag *) 0xC3FD8000UL)



/****************************************************************/
/*                                                              */
/* Module: ME  */
/*                                                              */
/****************************************************************/

   typedef union {   /* ME_GS - Global Status Register */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  S_CURRENT_MODE:4;   /* Current device mode status */
#else
         uint32_t  S_CURRENTMODE:4;     /* deprecated name - please avoid */
#endif
         uint32_t  S_MTRANS:1;        /* Mode transition status */
         uint32_t:3;
         uint32_t  S_PDO:1;           /* Output power-down status */
         uint32_t:2;
         uint32_t  S_MVR:1;           /* Main voltage regulator status */
         uint32_t:2;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  S_FLA:2;           /* Flash availability status */
#else
         uint32_t  S_CFLA:2;            /* deprecated name - please avoid */
#endif
         uint32_t:8;
         uint32_t  S_PLL1:1;          /* Secondary PLL status */
         uint32_t  S_PLL0:1;          /* System PLL status */
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  S_XOSC:1;          /* System crystal oscillator status */
#else
         uint32_t  S_OSC:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  S_IRCOSC:1;        /* System RC oscillator status */
#else
         uint32_t  S_RC:1;              /* deprecated name - please avoid */
#endif
         uint32_t  S_SYSCLK:4;        /* System clock switch status */
      } B;
   } ME_GS_32B_tag;

   typedef union {   /* ME_MCTL - Mode Control Register */
      uint32_t R;
      struct {
         uint32_t  TARGET_MODE:4;     /* Target device mode */
         uint32_t:12;
         uint32_t  KEY:16;            /* Control key */
      } B;
   } ME_MCTL_32B_tag;

   typedef union {   /* ME_MEN - Mode Enable Register */
      uint32_t R;
      struct {
         uint32_t:21;
         uint32_t  STOP0:1;           /* STOP0 mode enable */
         uint32_t:1;
         uint32_t  HALT0:1;           /* HALT0 mode enable */
         uint32_t  RUN3:1;            /* RUN3 mode enable */
         uint32_t  RUN2:1;            /* RUN2 mode enable */
         uint32_t  RUN1:1;            /* RUN1 mode enable */
         uint32_t  RUN0:1;            /* RUN0 mode enable */
         uint32_t  DRUN:1;            /* DRUN mode enable */
         uint32_t  SAFE:1;            /* SAFE mode enable */
         uint32_t:1;
         uint32_t  RESET:1;           /* RESET mode enable */
      } B;
   } ME_MEN_32B_tag;

   typedef union {   /* ME_IS - Interrupt Status Register */
      uint32_t R;
      struct {
         uint32_t:28;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  I_ICONF:1;         /* Invalid mode config interrupt */
#else
         uint32_t  I_CONF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  I_IMODE:1;         /* Invalid mode interrupt */
#else
         uint32_t  I_MODE:1;            /* deprecated name - please avoid */
#endif
         uint32_t  I_SAFE:1;          /* SAFE mode interrupt */
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  I_MTC:1;           /* Mode transition complete interrupt */
#else
         uint32_t  I_TC:1;              /* deprecated name - please avoid */
#endif
      } B;
   } ME_IS_32B_tag;

   typedef union {   /* ME_IM - Interrupt Mask Register */
      uint32_t R;
      struct {
         uint32_t:28;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  M_ICONF:1;         /* Invalid mode config interrupt mask */
#else
         uint32_t  M_CONF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  M_IMODE:1;         /* Invalid mode interrupt mask */
#else
         uint32_t  M_MODE:1;            /* deprecated name - please avoid */
#endif
         uint32_t  M_SAFE:1;          /* SAFE mode interrupt mask */
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  M_MTC:1;           /* Mode transition complete interrupt mask */
#else
         uint32_t  M_TC:1;              /* deprecated name - please avoid */
#endif
      } B;
   } ME_IM_32B_tag;

