RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* ME_IMTS - Invalid Mode Transition Status Register */
      uint32_t R;
      struct {
         uint32_t:27;
         uint32_t  S_MTI:1;           /* Mode Transition Illegal status */
         uint32_t  S_MRI:1;           /* Mode Request Illegal status */
         uint32_t  S_DMA:1;           /* Disabled Mode Access status */
         uint32_t  S_NMA:1;           /* Non-existing Mode Access status */
         uint32_t  S_SEA:1;           /* Safe Event Active status */
      } B;
   } ME_IMTS_32B_tag;

   typedef union {   /* ME_DMTS - Debug Mode Transition Status Register */
      uint32_t R;
      struct {
         uint32_t  PREVIOUS_MODE:4;   /* Previous Device Mode */
         uint32_t:4;
         uint32_t  MPH_BUSY:1;        /* MC_ME/MC_PCU Handshake Busy Indicator */
         uint32_t:2;
         uint32_t  PMC_PROG:1;        /* MC_PCU Mode Change in Process Indicator */
         uint32_t  CORE_DBG:1;        /* Processor is in Debug Mode Indicator */
         uint32_t:2;
         uint32_t  SMR:1;             /* SAFE Mode Request */
         uint32_t:1;
         uint32_t  VREG_CSRC_SC:1;    /* Main VREG Clock Source State Change Indicator */
         uint32_t  CSRC_CSRC_SC:1;    /* Other Clock Source State Change Indicator */
         uint32_t  IRCOSC_SC:1;       /* IRCOSC State Change Indicator */
         uint32_t  SCSRC_SC:1;        /* Secondary System Clock Sources State Change Indicator */
         uint32_t  SYSCLK_SW:1;       /* System Clock Switching pending Status Indicator */
         uint32_t:1;
         uint32_t  FLASH_SC:1;        /* FLASH State Change Indicator */
         uint32_t  CDP_PRPH_0_143:1;   /* Clock Disable Process Pending Status for Periph. 0-143 */
         uint32_t:4;
         uint32_t  CDP_PRPH_64_95:1;   /* Clock Disable Process Pending Status for Periph. 64-95 */
         uint32_t  CDP_PRPH_32_63:1;   /* Clock Disable Process Pending Status for Periph. 32-63 */
         uint32_t  CDP_PRPH_0_31:1;   /* Clock Disable Process Pending Status for Periph. 0-31 */
      } B;
   } ME_DMTS_32B_tag;

   typedef union {   /* ME_RESET_MC - RESET Mode Configuration Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_RESET_MC_32B_tag;

   typedef union {   /* ME_SAFE_MC - Mode Configuration Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_SAFE_MC_32B_tag;

   typedef union {   /* ME_DRUN_MC - DRUN Mode Configuration Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_DRUN_MC_32B_tag;


   /* Register layout for all registers RUN_MC... */

   typedef union {   /* ME_RUN[0..3]_MC - RUN[0..3] Mode Configuration Registers */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_RUN_MC_32B_tag;

   typedef union {   /* ME_HALT0_MC - HALT0 Mode Configuration Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_HALT0_MC_32B_tag;

