RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* ME_STOP0_MC - STOP0 Mode Configration Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_STOP0_MC_32B_tag;

   typedef union {   /* ME_STANDBY0_MC - STANDBY0 Mode Configration Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  PDO:1;             /* IOs output power-down control */
         uint32_t:2;
         uint32_t  MVRON:1;           /* Main voltage regulator control */
         uint32_t:2;
         uint32_t  FLAON:2;           /* Flash power-down control */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL1ON:1;          /* Secondary system clock source [8..0] control */
#else
         uint32_t  PLL2ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  PLL0ON:1;          /* System PLL control */
#else
         uint32_t  PLL1ON:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  XOSCON:1;          /* System crystal oscillator control */
#else
         uint32_t  XOSC0ON:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ME
         uint32_t  IRCOSCON:1;        /* System RC oscillator control */
#else
         uint32_t  IRCON:1;             /* deprecated name - please avoid */
#endif
         uint32_t  SYSCLK:4;          /* System clock switch control */
      } B;
   } ME_STANDBY0_MC_32B_tag;

   typedef union {   /* ME_PS0 - Peripheral Status Register 0 */
      uint32_t R;
      struct {
         uint32_t:7;
         uint32_t  S_FLEXRAY:1;       /* FlexRay status */
         uint32_t:6;
         uint32_t  S_FLEXCAN1:1;      /* FlexCAN1 status */
         uint32_t  S_FLEXCAN0:1;      /* FlexCAN0 status */
         uint32_t:9;
         uint32_t  S_DSPI2:1;         /* DSPI2 status */
         uint32_t  S_DSPI1:1;         /* DSPI1 status */
         uint32_t  S_DSPI0:1;         /* DSPI0 status */
         uint32_t:4;
      } B;
   } ME_PS0_32B_tag;

   typedef union {   /* ME_PS1 - Peripheral Status Register 1 */
      uint32_t R;
      struct {
         uint32_t:1;
         uint32_t  S_SWG:1;           /* SWG status */
         uint32_t:3;
         uint32_t  S_CRC:1;           /* CRC status */
         uint32_t:8;
         uint32_t  S_LIN_FLEX1:1;     /* LinFlex1 status */
         uint32_t  S_LIN_FLEX0:1;     /* LinFlex0 status */
         uint32_t:5;
         uint32_t  S_FLEXPWM1:1;      /* FlexPWM1 status */
         uint32_t  S_FLEXPWM0:1;      /* FlexPWM0 status */
         uint32_t  S_ETIMER2:1;       /* eTimer2 status */
         uint32_t  S_ETIMER1:1;       /* eTimer1 status */
         uint32_t  S_ETIMER0:1;       /* eTimer0 status */
         uint32_t:2;
         uint32_t  S_CTU:1;           /* CTU status */
         uint32_t:1;
         uint32_t  S_ADC1:1;          /* ADC1 status */
         uint32_t  S_ADC0:1;          /* ADC0 status */
      } B;
   } ME_PS1_32B_tag;

   typedef union {   /* ME_PS2 - Peripheral Status Register 2 */
      uint32_t R;
      struct {
         uint32_t:3;
         uint32_t  S_PIT:1;           /* PIT status */
         uint32_t:28;
      } B;
   } ME_PS2_32B_tag;


   /* Register layout for all registers RUN_PC... */

   typedef union {   /* ME_RUN_PC[0...7] - RUN Peripheral Configuration Registers */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  RUN3:1;            /* Peripheral control during RUN3 */
         uint32_t  RUN2:1;            /* Peripheral control during RUN2 */
         uint32_t  RUN1:1;            /* Peripheral control during RUN1 */
         uint32_t  RUN0:1;            /* Peripheral control during RUN0 */
         uint32_t  DRUN:1;            /* Peripheral control during DRUN */
         uint32_t  SAFE:1;            /* Peripheral control during SAFE */
         uint32_t  TEST:1;            /* Peripheral control during TEST */
         uint32_t  RESET:1;           /* Peripheral control during RESET */
      } B;
   } ME_RUN_PC_32B_tag;


   /* Register layout for all registers LP_PC... */

   typedef union {   /* ME_LP_PC[0...7] - Low Power Peripheral Configuration Registers */
      uint32_t R;
      struct {
         uint32_t:21;
         uint32_t  STOP0:1;           /* Peripheral control during STOP0 */
         uint32_t:1;
         uint32_t  HALT0:1;           /* Peripheral control during HALT0 */
         uint32_t:8;
      } B;
   } ME_LP_PC_32B_tag;


   /* Register layout for all registers PCTL... */

   typedef union {   /* ME_PCTL[0...143] - Peripheral Control Registers */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   DBG_F:1;           /* Peripheral control in debug mode */
         uint8_t   LP_CFG:3;          /* Peripheral configuration select for non-RUN modes */
         uint8_t   RUN_CFG:3;         /* Peripheral configuration select for RUN modes */
      } B;
   } ME_PCTL_8B_tag;




