RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   /* Register layout for generated register(s) PS... */

   typedef union {   /*  */
      uint32_t R;
   } ME_PS_32B_tag;






   typedef struct ME_struct_tag { /* start of ME_tag */
                                       /* ME_GS - Global Status Register */
      ME_GS_32B_tag GS;                    /* offset: 0x0000 size: 32 bit */
                                      /* ME_MCTL - Mode Control Register */
      ME_MCTL_32B_tag MCTL;                /* offset: 0x0004 size: 32 bit */
      union {
         ME_MEN_32B_tag MER;               /* deprecated - please avoid */

                                        /* ME_MEN - Mode Enable Register */
         ME_MEN_32B_tag MEN;               /* offset: 0x0008 size: 32 bit */

      };
                                    /* ME_IS - Interrupt Status Register */
      ME_IS_32B_tag IS;                    /* offset: 0x000C size: 32 bit */
                                      /* ME_IM - Interrupt Mask Register */
      ME_IM_32B_tag IM;                    /* offset: 0x0010 size: 32 bit */
                    /* ME_IMTS - Invalid Mode Transition Status Register */
      ME_IMTS_32B_tag IMTS;                /* offset: 0x0014 size: 32 bit */
                      /* ME_DMTS - Debug Mode Transition Status Register */
      ME_DMTS_32B_tag DMTS;                /* offset: 0x0018 size: 32 bit */
      int8_t ME_reserved_001C_C[4];
      union {
                      /* ME_RESET_MC - RESET Mode Configuration Register */
         ME_RESET_MC_32B_tag RESET_MC;     /* offset: 0x0020 size: 32 bit */

         ME_RESET_MC_32B_tag RESET;        /* deprecated - please avoid */

      };
      int8_t ME_reserved_0024_C[4];
      union {
                             /* ME_SAFE_MC - Mode Configuration Register */
         ME_SAFE_MC_32B_tag SAFE_MC;       /* offset: 0x0028 size: 32 bit */

         ME_SAFE_MC_32B_tag SAFE;          /* deprecated - please avoid */

      };
      union {
                        /* ME_DRUN_MC - DRUN Mode Configuration Register */
         ME_DRUN_MC_32B_tag DRUN_MC;       /* offset: 0x002C size: 32 bit */

         ME_DRUN_MC_32B_tag DRUN;          /* deprecated - please avoid */

      };
      union {
             /* ME_RUN[0..3]_MC - RUN[0..3] Mode Configuration Registers */
         ME_RUN_MC_32B_tag RUN_MC[4];      /* offset: 0x0030  (0x0004 x 4) */

         ME_RUN_MC_32B_tag RUN[4];            /* offset: 0x0030  (0x0004 x 4) */ /* deprecated - please avoid */

         struct {
             /* ME_RUN[0..3]_MC - RUN[0..3] Mode Configuration Registers */
            ME_RUN_MC_32B_tag RUN0_MC;     /* offset: 0x0030 size: 32 bit */
            ME_RUN_MC_32B_tag RUN1_MC;     /* offset: 0x0034 size: 32 bit */
            ME_RUN_MC_32B_tag RUN2_MC;     /* offset: 0x0038 size: 32 bit */
            ME_RUN_MC_32B_tag RUN3_MC;     /* offset: 0x003C size: 32 bit */
         };

      };
      union {
                      /* ME_HALT0_MC - HALT0 Mode Configuration Register */
         ME_HALT0_MC_32B_tag HALT0_MC;     /* offset: 0x0040 size: 32 bit */

         ME_HALT0_MC_32B_tag HALT0;        /* deprecated - please avoid */

      };
      int8_t ME_reserved_0044_C[4];
      union {
                       /* ME_STOP0_MC - STOP0 Mode Configration Register */
         ME_STOP0_MC_32B_tag STOP0_MC;     /* offset: 0x0048 size: 32 bit */

         ME_STOP0_MC_32B_tag STOP0;        /* deprecated - please avoid */

      };
      int8_t ME_reserved_004C_C[8];
      union {
                 /* ME_STANDBY0_MC - STANDBY0 Mode Configration Register */
         ME_STANDBY0_MC_32B_tag STANDBY0_MC;  /* offset: 0x0054 size: 32 bit */

         ME_STANDBY0_MC_32B_tag STANDBY0;  /* deprecated - please avoid */

      };
      int8_t ME_reserved_0058_C[8];
      union {
         ME_PS_32B_tag PS[3];              /* offset: 0x0060  (0x0004 x 3) */

         struct {
                                /* ME_PS0 - Peripheral Status Register 0 */
            ME_PS0_32B_tag PS0;            /* offset: 0x0060 size: 32 bit */
                                /* ME_PS1 - Peripheral Status Register 1 */
            ME_PS1_32B_tag PS1;            /* offset: 0x0064 size: 32 bit */
                                /* ME_PS2 - Peripheral Status Register 2 */
            ME_PS2_32B_tag PS2;            /* offset: 0x0068 size: 32 bit */
         };

      };
      int8_t ME_reserved_006C_C[20];
      union {
         ME_RUN_PC_32B_tag RUNPC[8];       /* offset: 0x0080  (0x0004 x 8) */

            /* ME_RUN_PC[0...7] - RUN Peripheral Configuration Registers */
         ME_RUN_PC_32B_tag RUN_PC[8];      /* offset: 0x0080  (0x0004 x 8) */

         struct {
            /* ME_RUN_PC[0...7] - RUN Peripheral Configuration Registers */
            ME_RUN_PC_32B_tag RUN_PC0;     /* offset: 0x0080 size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC1;     /* offset: 0x0084 size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC2;     /* offset: 0x0088 size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC3;     /* offset: 0x008C size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC4;     /* offset: 0x0090 size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC5;     /* offset: 0x0094 size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC6;     /* offset: 0x0098 size: 32 bit */
            ME_RUN_PC_32B_tag RUN_PC7;     /* offset: 0x009C size: 32 bit */
         };

      };
      union {
         ME_LP_PC_32B_tag LPPC[8];          /* offset: 0x00A0  (0x0004 x 8) */

       /* ME_LP_PC[0...7] - Low Power Peripheral Configuration Registers */
         ME_LP_PC_32B_tag LP_PC[8];        /* offset: 0x00A0  (0x0004 x 8) */

         struct {
       /* ME_LP_PC[0...7] - Low Power Peripheral Configuration Registers */
            ME_LP_PC_32B_tag LP_PC0;       /* offset: 0x00A0 size: 32 bit */
            ME_LP_PC_32B_tag LP_PC1;       /* offset: 0x00A4 size: 32 bit */
            ME_LP_PC_32B_tag LP_PC2;       /* offset: 0x00A8 size: 32 bit */
            ME_LP_PC_32B_tag LP_PC3;       /* offset: 0x00AC size: 32 bit */
            ME_LP_PC_32B_tag LP_PC4;       /* offset: 0x00B0 size: 32 bit */
            ME_LP_PC_32B_tag LP_PC5;       /* offset: 0x00B4 size: 32 bit */
            ME_LP_PC_32B_tag LP_PC6;       /* offset: 0x00B8 size: 32 bit */
            ME_LP_PC_32B_tag LP_PC7;       /* offset: 0x00BC size: 32 bit */
         };

