RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
                      /* ME_PCTL[0...143] - Peripheral Control Registers */
         ME_PCTL_8B_tag PCTL[144];         /* offset: 0x00C0  (0x0001 x 144) */

         struct {
                      /* ME_PCTL[0...143] - Peripheral Control Registers */
            ME_PCTL_8B_tag PCTL0;          /* offset: 0x00C0 size: 8 bit */
            ME_PCTL_8B_tag PCTL1;          /* offset: 0x00C1 size: 8 bit */
            ME_PCTL_8B_tag PCTL2;          /* offset: 0x00C2 size: 8 bit */
            ME_PCTL_8B_tag PCTL3;          /* offset: 0x00C3 size: 8 bit */
            ME_PCTL_8B_tag PCTL4;          /* offset: 0x00C4 size: 8 bit */
            ME_PCTL_8B_tag PCTL5;          /* offset: 0x00C5 size: 8 bit */
            ME_PCTL_8B_tag PCTL6;          /* offset: 0x00C6 size: 8 bit */
            ME_PCTL_8B_tag PCTL7;          /* offset: 0x00C7 size: 8 bit */
            ME_PCTL_8B_tag PCTL8;          /* offset: 0x00C8 size: 8 bit */
            ME_PCTL_8B_tag PCTL9;          /* offset: 0x00C9 size: 8 bit */
            ME_PCTL_8B_tag PCTL10;         /* offset: 0x00CA size: 8 bit */
            ME_PCTL_8B_tag PCTL11;         /* offset: 0x00CB size: 8 bit */
            ME_PCTL_8B_tag PCTL12;         /* offset: 0x00CC size: 8 bit */
            ME_PCTL_8B_tag PCTL13;         /* offset: 0x00CD size: 8 bit */
            ME_PCTL_8B_tag PCTL14;         /* offset: 0x00CE size: 8 bit */
            ME_PCTL_8B_tag PCTL15;         /* offset: 0x00CF size: 8 bit */
            ME_PCTL_8B_tag PCTL16;         /* offset: 0x00D0 size: 8 bit */
            ME_PCTL_8B_tag PCTL17;         /* offset: 0x00D1 size: 8 bit */
            ME_PCTL_8B_tag PCTL18;         /* offset: 0x00D2 size: 8 bit */
            ME_PCTL_8B_tag PCTL19;         /* offset: 0x00D3 size: 8 bit */
            ME_PCTL_8B_tag PCTL20;         /* offset: 0x00D4 size: 8 bit */
            ME_PCTL_8B_tag PCTL21;         /* offset: 0x00D5 size: 8 bit */
            ME_PCTL_8B_tag PCTL22;         /* offset: 0x00D6 size: 8 bit */
            ME_PCTL_8B_tag PCTL23;         /* offset: 0x00D7 size: 8 bit */
            ME_PCTL_8B_tag PCTL24;         /* offset: 0x00D8 size: 8 bit */
            ME_PCTL_8B_tag PCTL25;         /* offset: 0x00D9 size: 8 bit */
            ME_PCTL_8B_tag PCTL26;         /* offset: 0x00DA size: 8 bit */
            ME_PCTL_8B_tag PCTL27;         /* offset: 0x00DB size: 8 bit */
            ME_PCTL_8B_tag PCTL28;         /* offset: 0x00DC size: 8 bit */
            ME_PCTL_8B_tag PCTL29;         /* offset: 0x00DD size: 8 bit */
            ME_PCTL_8B_tag PCTL30;         /* offset: 0x00DE size: 8 bit */
            ME_PCTL_8B_tag PCTL31;         /* offset: 0x00DF size: 8 bit */
            ME_PCTL_8B_tag PCTL32;         /* offset: 0x00E0 size: 8 bit */
            ME_PCTL_8B_tag PCTL33;         /* offset: 0x00E1 size: 8 bit */
            ME_PCTL_8B_tag PCTL34;         /* offset: 0x00E2 size: 8 bit */
            ME_PCTL_8B_tag PCTL35;         /* offset: 0x00E3 size: 8 bit */
            ME_PCTL_8B_tag PCTL36;         /* offset: 0x00E4 size: 8 bit */
            ME_PCTL_8B_tag PCTL37;         /* offset: 0x00E5 size: 8 bit */
            ME_PCTL_8B_tag PCTL38;         /* offset: 0x00E6 size: 8 bit */
            ME_PCTL_8B_tag PCTL39;         /* offset: 0x00E7 size: 8 bit */
            ME_PCTL_8B_tag PCTL40;         /* offset: 0x00E8 size: 8 bit */
            ME_PCTL_8B_tag PCTL41;         /* offset: 0x00E9 size: 8 bit */
            ME_PCTL_8B_tag PCTL42;         /* offset: 0x00EA size: 8 bit */
            ME_PCTL_8B_tag PCTL43;         /* offset: 0x00EB size: 8 bit */
            ME_PCTL_8B_tag PCTL44;         /* offset: 0x00EC size: 8 bit */
            ME_PCTL_8B_tag PCTL45;         /* offset: 0x00ED size: 8 bit */
            ME_PCTL_8B_tag PCTL46;         /* offset: 0x00EE size: 8 bit */
            ME_PCTL_8B_tag PCTL47;         /* offset: 0x00EF size: 8 bit */
            ME_PCTL_8B_tag PCTL48;         /* offset: 0x00F0 size: 8 bit */
            ME_PCTL_8B_tag PCTL49;         /* offset: 0x00F1 size: 8 bit */
            ME_PCTL_8B_tag PCTL50;         /* offset: 0x00F2 size: 8 bit */
            ME_PCTL_8B_tag PCTL51;         /* offset: 0x00F3 size: 8 bit */
            ME_PCTL_8B_tag PCTL52;         /* offset: 0x00F4 size: 8 bit */
            ME_PCTL_8B_tag PCTL53;         /* offset: 0x00F5 size: 8 bit */
            ME_PCTL_8B_tag PCTL54;         /* offset: 0x00F6 size: 8 bit */
            ME_PCTL_8B_tag PCTL55;         /* offset: 0x00F7 size: 8 bit */
            ME_PCTL_8B_tag PCTL56;         /* offset: 0x00F8 size: 8 bit */
            ME_PCTL_8B_tag PCTL57;         /* offset: 0x00F9 size: 8 bit */
            ME_PCTL_8B_tag PCTL58;         /* offset: 0x00FA size: 8 bit */
            ME_PCTL_8B_tag PCTL59;         /* offset: 0x00FB size: 8 bit */
            ME_PCTL_8B_tag PCTL60;         /* offset: 0x00FC size: 8 bit */
            ME_PCTL_8B_tag PCTL61;         /* offset: 0x00FD size: 8 bit */
            ME_PCTL_8B_tag PCTL62;         /* offset: 0x00FE size: 8 bit */
            ME_PCTL_8B_tag PCTL63;         /* offset: 0x00FF size: 8 bit */
            ME_PCTL_8B_tag PCTL64;         /* offset: 0x0100 size: 8 bit */
            ME_PCTL_8B_tag PCTL65;         /* offset: 0x0101 size: 8 bit */
            ME_PCTL_8B_tag PCTL66;         /* offset: 0x0102 size: 8 bit */
            ME_PCTL_8B_tag PCTL67;         /* offset: 0x0103 size: 8 bit */
            ME_PCTL_8B_tag PCTL68;         /* offset: 0x0104 size: 8 bit */
            ME_PCTL_8B_tag PCTL69;         /* offset: 0x0105 size: 8 bit */
            ME_PCTL_8B_tag PCTL70;         /* offset: 0x0106 size: 8 bit */
            ME_PCTL_8B_tag PCTL71;         /* offset: 0x0107 size: 8 bit */
            ME_PCTL_8B_tag PCTL72;         /* offset: 0x0108 size: 8 bit */
            ME_PCTL_8B_tag PCTL73;         /* offset: 0x0109 size: 8 bit */
            ME_PCTL_8B_tag PCTL74;         /* offset: 0x010A size: 8 bit */
            ME_PCTL_8B_tag PCTL75;         /* offset: 0x010B size: 8 bit */
            ME_PCTL_8B_tag PCTL76;         /* offset: 0x010C size: 8 bit */
            ME_PCTL_8B_tag PCTL77;         /* offset: 0x010D size: 8 bit */
            ME_PCTL_8B_tag PCTL78;         /* offset: 0x010E size: 8 bit */
            ME_PCTL_8B_tag PCTL79;         /* offset: 0x010F size: 8 bit */
            ME_PCTL_8B_tag PCTL80;         /* offset: 0x0110 size: 8 bit */
            ME_PCTL_8B_tag PCTL81;         /* offset: 0x0111 size: 8 bit */
            ME_PCTL_8B_tag PCTL82;         /* offset: 0x0112 size: 8 bit */
            ME_PCTL_8B_tag PCTL83;         /* offset: 0x0113 size: 8 bit */
            ME_PCTL_8B_tag PCTL84;         /* offset: 0x0114 size: 8 bit */
            ME_PCTL_8B_tag PCTL85;         /* offset: 0x0115 size: 8 bit */
            ME_PCTL_8B_tag PCTL86;         /* offset: 0x0116 size: 8 bit */
            ME_PCTL_8B_tag PCTL87;         /* offset: 0x0117 size: 8 bit */
            ME_PCTL_8B_tag PCTL88;         /* offset: 0x0118 size: 8 bit */
            ME_PCTL_8B_tag PCTL89;         /* offset: 0x0119 size: 8 bit */
            ME_PCTL_8B_tag PCTL90;         /* offset: 0x011A size: 8 bit */
            ME_PCTL_8B_tag PCTL91;         /* offset: 0x011B size: 8 bit */
            ME_PCTL_8B_tag PCTL92;         /* offset: 0x011C size: 8 bit */
            ME_PCTL_8B_tag PCTL93;         /* offset: 0x011D size: 8 bit */
            ME_PCTL_8B_tag PCTL94;         /* offset: 0x011E size: 8 bit */
            ME_PCTL_8B_tag PCTL95;         /* offset: 0x011F size: 8 bit */
            ME_PCTL_8B_tag PCTL96;         /* offset: 0x0120 size: 8 bit */
            ME_PCTL_8B_tag PCTL97;         /* offset: 0x0121 size: 8 bit */
            ME_PCTL_8B_tag PCTL98;         /* offset: 0x0122 size: 8 bit */
            ME_PCTL_8B_tag PCTL99;         /* offset: 0x0123 size: 8 bit */
            ME_PCTL_8B_tag PCTL100;        /* offset: 0x0124 size: 8 bit */
            ME_PCTL_8B_tag PCTL101;        /* offset: 0x0125 size: 8 bit */
            ME_PCTL_8B_tag PCTL102;        /* offset: 0x0126 size: 8 bit */
            ME_PCTL_8B_tag PCTL103;        /* offset: 0x0127 size: 8 bit */
            ME_PCTL_8B_tag PCTL104;        /* offset: 0x0128 size: 8 bit */
            ME_PCTL_8B_tag PCTL105;        /* offset: 0x0129 size: 8 bit */
            ME_PCTL_8B_tag PCTL106;        /* offset: 0x012A size: 8 bit */
            ME_PCTL_8B_tag PCTL107;        /* offset: 0x012B size: 8 bit */
            ME_PCTL_8B_tag PCTL108;        /* offset: 0x012C size: 8 bit */
            ME_PCTL_8B_tag PCTL109;        /* offset: 0x012D size: 8 bit */
            ME_PCTL_8B_tag PCTL110;        /* offset: 0x012E size: 8 bit */
            ME_PCTL_8B_tag PCTL111;        /* offset: 0x012F size: 8 bit */
            ME_PCTL_8B_tag PCTL112;        /* offset: 0x0130 size: 8 bit */
            ME_PCTL_8B_tag PCTL113;        /* offset: 0x0131 size: 8 bit */
            ME_PCTL_8B_tag PCTL114;        /* offset: 0x0132 size: 8 bit */
            ME_PCTL_8B_tag PCTL115;        /* offset: 0x0133 size: 8 bit */
            ME_PCTL_8B_tag PCTL116;        /* offset: 0x0134 size: 8 bit */
            ME_PCTL_8B_tag PCTL117;        /* offset: 0x0135 size: 8 bit */
            ME_PCTL_8B_tag PCTL118;        /* offset: 0x0136 size: 8 bit */
            ME_PCTL_8B_tag PCTL119;        /* offset: 0x0137 size: 8 bit */
            ME_PCTL_8B_tag PCTL120;        /* offset: 0x0138 size: 8 bit */
            ME_PCTL_8B_tag PCTL121;        /* offset: 0x0139 size: 8 bit */
            ME_PCTL_8B_tag PCTL122;        /* offset: 0x013A size: 8 bit */
            ME_PCTL_8B_tag PCTL123;        /* offset: 0x013B size: 8 bit */
            ME_PCTL_8B_tag PCTL124;        /* offset: 0x013C size: 8 bit */
            ME_PCTL_8B_tag PCTL125;        /* offset: 0x013D size: 8 bit */
            ME_PCTL_8B_tag PCTL126;        /* offset: 0x013E size: 8 bit */
            ME_PCTL_8B_tag PCTL127;        /* offset: 0x013F size: 8 bit */
            ME_PCTL_8B_tag PCTL128;        /* offset: 0x0140 size: 8 bit */
            ME_PCTL_8B_tag PCTL129;        /* offset: 0x0141 size: 8 bit */
            ME_PCTL_8B_tag PCTL130;        /* offset: 0x0142 size: 8 bit */
            ME_PCTL_8B_tag PCTL131;        /* offset: 0x0143 size: 8 bit */
            ME_PCTL_8B_tag PCTL132;        /* offset: 0x0144 size: 8 bit */
            ME_PCTL_8B_tag PCTL133;        /* offset: 0x0145 size: 8 bit */
            ME_PCTL_8B_tag PCTL134;        /* offset: 0x0146 size: 8 bit */
            ME_PCTL_8B_tag PCTL135;        /* offset: 0x0147 size: 8 bit */
            ME_PCTL_8B_tag PCTL136;        /* offset: 0x0148 size: 8 bit */
            ME_PCTL_8B_tag PCTL137;        /* offset: 0x0149 size: 8 bit */
            ME_PCTL_8B_tag PCTL138;        /* offset: 0x014A size: 8 bit */
            ME_PCTL_8B_tag PCTL139;        /* offset: 0x014B size: 8 bit */
            ME_PCTL_8B_tag PCTL140;        /* offset: 0x014C size: 8 bit */
            ME_PCTL_8B_tag PCTL141;        /* offset: 0x014D size: 8 bit */
            ME_PCTL_8B_tag PCTL142;        /* offset: 0x014E size: 8 bit */
            ME_PCTL_8B_tag PCTL143;        /* offset: 0x014F size: 8 bit */
         };

