RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
   } ME_tag;


#define ME    (*(volatile ME_tag *) 0xC3FDC000UL)



/****************************************************************/
/*                                                              */
/* Module: OSC  */
/*                                                              */
/****************************************************************/

   typedef union {   /* OSC_CTL - Control Register */
      uint32_t R;
      struct {
         uint32_t  OSCBYP:1;          /* High Frequency Oscillator Bypass */
         uint32_t:7;
         uint32_t  EOCV:8;            /* End of Count Value */
         uint32_t  M_OSC:1;           /* High Frequency Oscillator Clock Interrupt Mask */
         uint32_t:2;
         uint32_t  OSCDIV:5;          /* High Frequency Oscillator Division Factor */
         uint32_t  I_OSC:1;           /* High Frequency Oscillator Clock Interrupt */
         uint32_t:5;
         uint32_t S_OSC:1;
         uint32_t OSCON:1;      } B;
   } OSC_CTL_32B_tag;



   typedef struct OSC_struct_tag { /* start of OSC_tag */
                                           /* OSC_CTL - Control Register */
      OSC_CTL_32B_tag CTL;                 /* offset: 0x0000 size: 32 bit */
   } OSC_tag;


#define OSC   (*(volatile OSC_tag *) 0xC3FE0000UL)



/****************************************************************/
/*                                                              */
/* Module: RC  */
/*                                                              */
/****************************************************************/

   typedef union {   /* RC_CTL - Control Register */
      uint32_t R;
      struct {
         uint32_t:10;
         uint32_t  RCTRIM:6;          /* Main RC Trimming Bits */
         uint32_t:3;
         uint32_t  RCDIV:5;           /* Main RC Clock Division Factor */
         uint32_t:2;
         uint32_t  S_RC_STDBY:1;      /* MRC Oscillator Powerdown Status */
         uint32_t:5;
      } B;
   } RC_CTL_32B_tag;



   typedef struct RC_struct_tag { /* start of RC_tag */
                                            /* RC_CTL - Control Register */
      RC_CTL_32B_tag CTL;                  /* offset: 0x0000 size: 32 bit */
   } RC_tag;


#define RC    (*(volatile RC_tag *) 0xC3FE0060UL)



/****************************************************************/
/*                                                              */
/* Module: PLLD  */
/*                                                              */
/****************************************************************/

   typedef union {   /* PLLD_CR - Control Register */
      uint32_t R;
      struct {
         uint32_t:2;
         uint32_t  IDF:4;             /* PLL Input Division Factor */
         uint32_t  ODF:2;             /* PLL Output Division Factor */
         uint32_t:1;
         uint32_t  NDIV:7;            /* PLL Loop Division Factor */
         uint32_t:7;
         uint32_t  EN_PLL_SW:1;       /* Enable Progressive Clock Switching */
         uint32_t  MODE:1;            /* Activate 1:1 Mode */
         uint32_t  UNLOCK_ONCE:1;     /* PLL Loss of Lock */
         uint32_t  M_LOCK:1;          /* Mask for the i_lock Output Interrupt */
         uint32_t  I_LOCK:1;          /* PLL Lock Signal Toggle Indicator */
         uint32_t  S_LOCK:1;          /* PLL has Aquired Lock */
         uint32_t  PLL_FAIL_MASK:1;   /* PLL Fail Mask */
         uint32_t  PLL_FAIL_FLAG:1;   /* PLL Fail Flag */
         uint32_t  PLL_ON:1;          /* PLL ON Bit */
      } B;
   } PLLD_CR_32B_tag;

   typedef union {   /* PLLD_MR - PLLD Modulation Register */
      uint32_t R;
      struct {
         uint32_t  STRB_BYPASS:1;     /* Strobe Bypass */
         uint32_t:1;
         uint32_t  SPRD_SEL:1;        /* Spread Type Selection */
         uint32_t  MOD_PERIOD:13;     /* Modulation Period */
#ifndef USE_FIELD_ALIASES_PLLD
         uint32_t  SSCG_EN:1;         /* Spread Spectrum Clock Generation Enable */
#else
         uint32_t FM_EN:1;            /* deprecated name - please avoid */
#endif
         uint32_t  INC_STEP:15;       /* Increment Step */
      } B;
   } PLLD_MR_32B_tag;



   typedef struct PLLD_struct_tag { /* start of PLLD_tag */
                                           /* PLLD_CR - Control Register */
      PLLD_CR_32B_tag CR;                  /* offset: 0x0000 size: 32 bit */
                                   /* PLLD_MR - PLLD Modulation Register */
      PLLD_MR_32B_tag MR;                  /* offset: 0x0004 size: 32 bit */
	  
	  uint32_t plld_reserved[6];
   } PLLD_tag;


#define PLLD0 (*(volatile PLLD_tag *) 0xC3FE00A0UL)
#define PLLD1 (*(volatile PLLD_tag *) 0xC3FE00C0UL)



/****************************************************************/
/*                                                              */
/* Module: CMU  */
/*                                                              */
/****************************************************************/

   typedef union {   /* CMU_CSR - Control Status Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  SFM:1;             /* Start Frequency Measure */
         uint32_t:13;
#ifndef USE_FIELD_ALIASES_RGM
         uint32_t  CKSEL1:2;          /* RC Oscillator(s) Selection Bit */
#else
         uint32_t  CLKSEL1:2;          /* deprecated name - please avoid */
#endif
         uint32_t:5;
         uint32_t  RCDIV:2;           /* RCfast Clock Division Factor */
         uint32_t  CME_A:1;           /* PLL_A Clock Monitor Enable */
      } B;
   } CMU_CSR_32B_tag;

   typedef union {   /* CMU_FDR - Frequency Display Register */
      uint32_t R;
      struct {
         uint32_t:12;
         uint32_t  FD:20;             /* Measured Frequency Bits */
      } B;
   } CMU_FDR_32B_tag;

   typedef union {   /* CMU_HFREFR_A - High Frequency Reference Register */
      uint32_t R;
      struct {
         uint32_t:20;
         uint32_t  HFREF_A:12;        /* High Frequency Reference Value */
      } B;
   } CMU_HFREFR_A_32B_tag;

   typedef union {   /* CMU_LFREFR_A - Low Frequency Reference Register */
      uint32_t R;
      struct {
         uint32_t:20;
         uint32_t  LFREF_A:12;        /* Low Frequency Reference Value */
      } B;
   } CMU_LFREFR_A_32B_tag;

   typedef union {   /* CMU_ISR - Interrupt Status Register */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  FLCI_A:1;          /* PLL_A Clock Frequency less than Reference Clock Interrupt */
#ifndef USE_FIELD_ALIASES_RGM
         uint32_t  FHH_AI:1;          /* PLL_A Clock Frequency higher than high Reference Interrupt */
#else
         uint32_t  FHHI_A:1;          /* deprecated name - please avoid */
#endif
         uint32_t  FLLI_A:1;          /* PLL_A Clock Frequency less than low Reference Interrupt */
         uint32_t  OLRI:1;            /* Oscillator Frequency less than RC Frequency Interrupt */
      } B;
   } CMU_ISR_32B_tag;

