RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* CMU_IMR - Interrupt Mask Register */
      uint32_t R;
   } CMU_IMR_32B_tag;

   typedef union {   /* CMU_MDR - Measurement Duration Register */
      uint32_t R;
      struct {
         uint32_t:12;
         uint32_t  MD:20;             /* Measurment Duration Bits */
      } B;
   } CMU_MDR_32B_tag;



   typedef struct CMU_struct_tag { /* start of CMU_tag */
                                    /* CMU_CSR - Control Status Register */
      CMU_CSR_32B_tag CSR;                 /* offset: 0x0000 size: 32 bit */
                                 /* CMU_FDR - Frequency Display Register */
      CMU_FDR_32B_tag FDR;                 /* offset: 0x0004 size: 32 bit */
                     /* CMU_HFREFR_A - High Frequency Reference Register */
      CMU_HFREFR_A_32B_tag HFREFR_A;       /* offset: 0x0008 size: 32 bit */
                      /* CMU_LFREFR_A - Low Frequency Reference Register */
      CMU_LFREFR_A_32B_tag LFREFR_A;       /* offset: 0x000C size: 32 bit */
                                  /* CMU_ISR - Interrupt Status Register */
      CMU_ISR_32B_tag ISR;                 /* offset: 0x0010 size: 32 bit */
                                    /* CMU_IMR - Interrupt Mask Register */
      CMU_IMR_32B_tag IMR;                 /* offset: 0x0014 size: 32 bit */
                              /* CMU_MDR - Measurement Duration Register */
      CMU_MDR_32B_tag MDR;                 /* offset: 0x0018 size: 32 bit */
   } CMU_tag;


#define CMU0  (*(volatile CMU_tag *) 0xC3FE0100UL)
#define CMU1  (*(volatile CMU_tag *) 0xC3FE0120UL)
#define CMU2  (*(volatile CMU_tag *) 0xC3FE0140UL)



/****************************************************************/
/*                                                              */
/* Module: CGM  */
/*                                                              */
/****************************************************************/

   typedef union {   /* Output Clock Enable Register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
      struct {
         uint32_t:31;
         uint32_t  EN:1;              /* Clock Enable Bit */
      } B;
   } CGM_OC_EN_32B_tag;

   typedef union {   /* Output Clock Division Select Register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
      struct {
         uint32_t:2;
         uint32_t  SELDIV:2;          /* Output Clock Division Select */
         uint32_t  SELCTL:4;          /* Output Clock Source Selection Control */
         uint32_t:24;
      } B;
   } CGM_OCDS_SC_32B_tag;

   typedef union {   /* System Clock Select Status Register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
      struct {
         uint32_t:4;
         uint32_t  SELSTAT:4;         /* System Clock Source Selection Status */
         uint32_t:24;
      } B;
   } CGM_SC_SS_32B_tag;

   typedef union {   /* System Clock Divider Configuration Register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
      struct {
         uint32_t  DE0:1;             /* Divider 0 Enable */
         uint32_t:3;
         uint32_t  DIV0:4;            /* Divider 0 Value */
         uint32_t:24;
      } B;
   } CGM_SC_DC0_3_32B_tag;


   /* Register layout for all registers SC_DC... */

   typedef union {   /* System Clock Divider Configuration Register */
      uint8_t R;
      struct {
         uint8_t   DE:1;              /* Divider Enable */
         uint8_t:3;
         uint8_t   DIV:4;             /* Divider Division Value */
      } B;
   } CGM_SC_DC_8B_tag;


   /* Register layout for all registers AC_SC... */

   typedef union {   /* Auxiliary Clock Select Control Registers */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
      struct {
         uint32_t:4;
         uint32_t  SELCTL:4;          /* Auxliary Clock Source Selection Control */
         uint32_t:24;
      } B;
   } CGM_AC_SC_32B_tag;


   /* Register layout for all registers AC_DC0_3... */

   typedef union {   /* Auxiliary Clock Divider Configuration Registers */
      uint32_t R;
      struct {
         uint32_t  DE0:1;             /* Divider 0 Enable */
         uint32_t:3;
         uint32_t  DIV0:4;            /* Divider 0 Value */
         uint32_t  DE1:1;             /* Divider 1 Enable */
         uint32_t:3;
         uint32_t  DIV1:4;            /* Divider 1 Value */
         uint32_t:16;
      } B;
   } CGM_AC_DC0_3_32B_tag;


   typedef struct CGM_AUXCLK_struct_tag {

                             /* Auxiliary Clock Select Control Registers */
      CGM_AC_SC_32B_tag AC_SC;            /* relative offset: 0x0000 */
                      /* Auxiliary Clock Divider Configuration Registers */
      CGM_AC_DC0_3_32B_tag AC_DC0_3;      /* relative offset: 0x0004 */

   } CGM_AUXCLK_tag;


   typedef struct CGM_struct_tag { /* start of CGM_tag */
      OSC_CTL_32B_tag OSC_CTL;             /* offset: 0x0000 size: 32 bit */
      int8_t CGM_reserved_0004[92];
      RC_CTL_32B_tag RC_CTL;               /* offset: 0x0060 size: 32 bit */
      int8_t CGM_reserved_0064[60];
      PLLD_tag FMPLL[2];                   /* offset: 0x00A0  (0x0020 x 2) */
      int8_t CGM_reserved_00E0[32];
      CMU_CSR_32B_tag CMU_0_CSR;           /* offset: 0x0100 size: 32 bit */
      CMU_FDR_32B_tag CMU_0_FDR;           /* offset: 0x0104 size: 32 bit */
      CMU_HFREFR_A_32B_tag CMU_0_HFREFR_A;  /* offset: 0x0108 size: 32 bit */
      CMU_LFREFR_A_32B_tag CMU_0_LFREFR_A;  /* offset: 0x010C size: 32 bit */
      CMU_ISR_32B_tag CMU_0_ISR;           /* offset: 0x0110 size: 32 bit */
      CMU_IMR_32B_tag CMU_0_IMR;           /* offset: 0x0114 size: 32 bit */
      CMU_MDR_32B_tag CMU_0_MDR;           /* offset: 0x0118 size: 32 bit */
      int8_t CGM_reserved_011C[4];
      CMU_CSR_32B_tag CMU_1_CSR;           /* offset: 0x0120 size: 32 bit */
      int8_t CGM_reserved_0124[4];
      CMU_HFREFR_A_32B_tag CMU_1_HFREFR_A;  /* offset: 0x0128 size: 32 bit */
      CMU_LFREFR_A_32B_tag CMU_1_LFREFR_A;  /* offset: 0x012C size: 32 bit */
      CMU_ISR_32B_tag CMU_1_ISR;           /* offset: 0x0130 size: 32 bit */
      int8_t CGM_reserved_0134[572];
      union {
                 /* Output Clock Enable Register */
         CGM_OC_EN_32B_tag OC_EN;             /* offset: 0x0370 size: 32 bit */

         CGM_OC_EN_32B_tag OCEN;  /* deprecated - please avoid */

