RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
                 /* Output Clock Division Select Register */
         CGM_OCDS_SC_32B_tag OCDS_SC;         /* offset: 0x0374 size: 32 bit */

         CGM_OCDS_SC_32B_tag OCDSSC;  /* deprecated - please avoid */

      };
      union {
                 /* Output Clock Division Select Register */
         CGM_SC_SS_32B_tag SC_SS;             /* offset: 0x0378 size: 32 bit */

         CGM_SC_SS_32B_tag SCSS;  /* deprecated - please avoid */

      };                                  /* System Clock Select Status Register */
      union {
         struct {
                          /* System Clock Divider Configuration Register */
            CGM_SC_DC_8B_tag SC_DC[2];     /* offset: 0x037C  (0x0001 x 2) */
            int8_t CGM_reserved_037E_E0[2];
         };

         struct {
                          /* System Clock Divider Configuration Register */
            CGM_SC_DC_8B_tag SC_DC0;       /* offset: 0x037C size: 8 bit */
            CGM_SC_DC_8B_tag SC_DC1;       /* offset: 0x037D size: 8 bit */
            int8_t CGM_reserved_037E_E1[2];
         };

                          /* System Clock Divider Configuration Register */
         union {
            CGM_SC_DC0_3_32B_tag SC_DC0_3;    /* offset: 0x037C size: 32 bit */
            CGM_SC_DC0_3_32B_tag SCDC;    /* deprecated - please avoid */
         };
      };
      union {
                                                 /*  Register set AUXCLK */
         CGM_AUXCLK_tag AUXCLK[6];         /* offset: 0x0380  (0x0008 x 6) */

         struct {
            union {
                             /* Auxiliary Clock Select Control Registers */
               CGM_AC_SC_32B_tag AC0_SC;      /* offset: 0x0380 size: 32 bit */
            
               CGM_AC_SC_32B_tag AC0SC;  /* deprecated - please avoid */
            
            };  
            union {
                      /* Auxiliary Clock Divider Configuration Registers */
               CGM_AC_DC0_3_32B_tag AC0_DC0_3;  /* offset: 0x0384 size: 32 bit */
            
               CGM_AC_DC0_3_32B_tag AC0DC;  /* deprecated - please avoid */
            
            };  
            union {
                             /* Auxiliary Clock Select Control Registers */
               CGM_AC_SC_32B_tag AC1_SC;      /* offset: 0x0388 size: 32 bit */
            
               CGM_AC_SC_32B_tag AC1SC;  /* deprecated - please avoid */
            
            };  
            union {
                      /* Auxiliary Clock Divider Configuration Registers */
               CGM_AC_DC0_3_32B_tag AC1_DC0_3;  /* offset: 0x038C size: 32 bit */
            
               CGM_AC_DC0_3_32B_tag AC1DC;  /* deprecated - please avoid */
            
            };  
            union {
                             /* Auxiliary Clock Select Control Registers */
               CGM_AC_SC_32B_tag AC2_SC;      /* offset: 0x0390 size: 32 bit */
            
               CGM_AC_SC_32B_tag AC2SC;  /* deprecated - please avoid */
            
            };  
            union {
                      /* Auxiliary Clock Divider Configuration Registers */
               CGM_AC_DC0_3_32B_tag AC2_DC0_3;  /* offset: 0x0394 size: 32 bit */
            
               CGM_AC_DC0_3_32B_tag AC2DC;  /* deprecated - please avoid */
            
            };  
            union {
                             /* Auxiliary Clock Select Control Registers */
               CGM_AC_SC_32B_tag AC3_SC;      /* offset: 0x0398 size: 32 bit */
            
               CGM_AC_SC_32B_tag AC3SC;  /* deprecated - please avoid */
            
            };  
            union {
                      /* Auxiliary Clock Divider Configuration Registers */
               CGM_AC_DC0_3_32B_tag AC3_DC0_3;  /* offset: 0x039C size: 32 bit */
            
               CGM_AC_DC0_3_32B_tag AC3DC;  /* deprecated - please avoid */
            
            };  
            union {
                             /* Auxiliary Clock Select Control Registers */
               CGM_AC_SC_32B_tag AC4_SC;      /* offset: 0x03A0 size: 32 bit */
            
               CGM_AC_SC_32B_tag AC4SC;  /* deprecated - please avoid */
            
            };  
			union {
                      /* Auxiliary Clock Divider Configuration Registers */
				CGM_AC_DC0_3_32B_tag AC4_DC0_3;  /* offset: 0x03A4 size: 32 bit */
				
                CGM_AC_DC0_3_32B_tag AC4DC;  /* deprecated - please avoid */
			};
            union {
                             /* Auxiliary Clock Select Control Registers */
               CGM_AC_SC_32B_tag AC5_SC;      /* offset: 0x03A8 size: 32 bit */
            
               CGM_AC_SC_32B_tag AC5SC;  /* deprecated - please avoid */
            
            };  
            union {
                      /* Auxiliary Clock Divider Configuration Registers */
               CGM_AC_DC0_3_32B_tag AC5_DC0_3;  /* offset: 0x03AC size: 32 bit */
            
               CGM_AC_DC0_3_32B_tag AC5DC;  /* deprecated - please avoid */
            
            };
         };

      };
   } CGM_tag;


#define CGM   (*(volatile CGM_tag *) 0xC3FE0000UL)



/****************************************************************/
/*                                                              */
/* Module: RGM  */
/*                                                              */
/****************************************************************/

   typedef union {   /* Functional Event Status Register */
      uint16_t R;
      struct {
         uint16_t  F_EXR:1;           /* Flag for External Reset */
         uint16_t  F_FCCU_HARD:1;     /* Flag for FCCU hard reaction request */
         uint16_t  F_FCCU_SOFT:1;     /* Flag for FCCU soft reaction request */
         uint16_t  F_ST_DONE:1;       /* Flag for self-test completed */
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  F_CMU12_FHL:1;     /* Flag for CMU 1/2 clock freq. too high/low */
#else
         uint16_t  F_CMU1_FHL:1;        /* deprecated name - please avoid */
#endif
         uint16_t  F_FL_ECC_RCC:1;    /* Flag for Flash, ECC, or lock-step error */
         uint16_t  F_PLL1:1;          /* Flag for PLL1 fail */
         uint16_t  F_SWT:1;           /* Flag for Software Watchdog Timer */
         uint16_t  F_FCCU_SAFE:1;     /* Flag for FCCU SAFE mode request */
         uint16_t  F_CMU0_FHL:1;      /* Flag for CMU 0 clock freq. too high/low */
         uint16_t  F_CMU0_OLR:1;      /* Flag for oscillator freq. too low */
         uint16_t  F_PLL0:1;          /* Flag for PLL0 fail */
         uint16_t  F_CWD:1;           /* Flag for Core Watchdog Reset */
         uint16_t  F_SOFT:1;          /* Flag for software reset */
         uint16_t  F_CORE:1;          /* Flag for core reset */
         uint16_t  F_JTAG:1;          /* Flag for JTAG initiated reset */
      } B;
   } RGM_FES_16B_tag;

   typedef union {   /* Destructive Event Status Register */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  F_POR:1;           /* Flag for Power on Reset */
#else
         uint16_t  POR:1;               /* deprecated name - please avoid */
#endif
         uint16_t:7;
         uint16_t  F_COMP:1;          /* Flag for comparator error */
         uint16_t  F_LVD27_IO:1;      /* Flag for 2.7V low-voltage detected (I/O) */
         uint16_t  F_LVD27_FLASH:1;   /* Flag for 2.7V low-voltage detected (Flash) */
         uint16_t  F_LVD27_VREG:1;    /* Flag for 2.7V low-voltage detected (VREG) */
         uint16_t:2;
         uint16_t  F_HVD12:1;         /* Flag for 1.2V high-voltage detected */
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  F_LVD12:1;         /* Flag for 1.2V low-voltage detected */
#else
         uint16_t  F_LVD12_PD0:1;       /* deprecated name - please avoid */
#endif
      } B;
   } RGM_DES_16B_tag;

