RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Functional Event Reset Disable Register */
      uint16_t R;
      struct {
         uint16_t  D_EXR:1;           /* Disable External Pad Event Reset */
         uint16_t  D_FCCU_HARD:1;     /* Disable FCCU hard reaction request */
         uint16_t  D_FCCU_SOFT:1;     /* Disable FCCU soft reaction request */
         uint16_t  D_ST_DONE:1;       /* Disable self-test completed */
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  D_CMU12_FHL:1;     /* Disable CMU 1/2 clock freq. too high/low */
#else
         uint16_t  D_CMU1_FHL:1;        /* deprecated name - please avoid */
#endif
         uint16_t  D_FL_ECC_RCC:1;    /* Disable Flash, ECC, or lock-step error */
         uint16_t  D_PLL1:1;          /* Disable PLL1 fail */
         uint16_t  D_SWT:1;           /* Disable Software Watchdog Timer */
         uint16_t  D_FCCU_SAFE:1;     /* Disable FCCU SAFE mode request */
         uint16_t  D_CMU0_FHL:1;      /* Disable CMU 0 clock freq. too high/low */
         uint16_t  D_CMU0_OLR:1;      /* Disable oscillator freq. too low */
         uint16_t  D_PLL0:1;          /* Disable PLL0 fail */
         uint16_t  D_CWD:1;           /* Disable Core Watchdog Reset */
         uint16_t  D_SOFT:1;          /* Disable software reset */
         uint16_t  D_CORE:1;          /* Disable core reset */
         uint16_t  D_JTAG:1;          /* Disable JTAG initiated reset */
      } B;
   } RGM_FERD_16B_tag;

   typedef union {   /* Destructive Event Reset Disable Register */
      uint16_t R;
      struct {
         uint16_t:8;
         uint16_t  D_COMP:1;          /* Disable comparator error */
         uint16_t  D_LVD27_IO:1;      /* Disable 2.7V low-voltage detected (I/O) */
         uint16_t  D_LVD27_FLASH:1;   /* Disable 2.7V low-voltage detected (Flash) */
         uint16_t  D_LVD27_VREG:1;    /* Disable 2.7V low-voltage detected (VREG) */
         uint16_t:2;
         uint16_t  D_HVD12:1;         /* Disable 1.2V high-voltage detected */
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  D_LVD12:1;         /* Disable 1.2V low-voltage detected */
#else
         uint16_t  D_LVD12_PD0:1;       /* deprecated name - please avoid */
#endif
      } B;
   } RGM_DERD_16B_tag;

   typedef union {   /* Functional Event Alternate Request Register */
      uint16_t R;
      struct {
         uint16_t:4;
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  AR_CMU12_FHL:1;    /* Alternate Request for CMU1/2 clock freq. too high/low */
#else
         uint16_t  AR_CMU1_FHL:1;       /* deprecated name - please avoid */
#endif
         uint16_t:1;
         uint16_t  AR_PLL1:1;         /* Alternate Request for PLL1 fail */
         uint16_t:1;
         uint16_t  AR_FCCU_SAVE:1;    /* Alternate Request for FCCU SAFE mode request */
         uint16_t  AR_CMU0_FHL:1;     /* Alternate Request for CMU0 clock freq.
 too high/low */
         uint16_t  AR_CMU0_OLR:1;     /* Alternate Request for oscillator freq. too low */
         uint16_t  AR_PLL0:1;         /* Alternate Request for PLL0 fail */
         uint16_t  AR_CWD:1;          /* Alternate Request for core watchdog reset */
         uint16_t:3;
      } B;
   } RGM_FEAR_16B_tag;

   typedef union {   /* Functional Event Short Sequence Register */
      uint16_t R;
      struct {
         uint16_t  SS_EXR:1;          /* Short Sequence for External Reset */
         uint16_t  SS_FCCU_HARD:1;    /* Short Sequence for FCCU hard reaction request */
         uint16_t  SS_FCCU_SOFT:1;    /* Short Sequence for FCCU soft reaction request */
         uint16_t  SS_ST_DONE:1;      /* Short Sequence for self-test completed */
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  SS_CMU12_FHL:1;    /* Short Sequence for CMU 1/2 clock freq. too high/low */
#else
         uint16_t  SS_CMU1_FHL:1;       /* deprecated name - please avoid */
#endif
         uint16_t  SS_FL_ECC_RCC:1;   /* Short Sequence for Flash, ECC, or lock-step error */
         uint16_t  SS_PLL1:1;         /* Short Sequence for PLL1 fail */
         uint16_t  SS_SWT:1;          /* Short Sequence for Software Watchdog Timer */
         uint16_t:1;
         uint16_t  SS_CMU0_FHL:1;     /* Short Sequence for CMU 0 clock freq. too high/low */
         uint16_t  SS_CMU0_OLR:1;     /* Short Sequence for oscillator freq. too low */
         uint16_t  SS_PLL0:1;         /* Short Sequence for PLL0 fail */
         uint16_t  SS_CWD:1;          /* Short Sequence for Core Watchdog Reset */
         uint16_t  SS_SOFT:1;         /* Short Sequence for software reset */
         uint16_t  SS_CORE:1;         /* Short Sequence for core reset */
         uint16_t  SS_JTAG:1;         /* Short Sequence for JTAG initiated reset */
      } B;
   } RGM_FESS_16B_tag;

   typedef union {   /* Functional Bidirectional Reset Enable Register */
      uint16_t R;
      struct {
         uint16_t  BE_EXR:1;          /* Bidirectional Reset Enable for External Reset */
         uint16_t  BE_FCCU_HARD:1;    /* Bidirectional Reset Enable for FCCU hard reaction request */
         uint16_t  BE_FCCU_SOFT:1;    /* Bidirectional Reset Enable for FCCU soft reaction request */
         uint16_t  BE_ST_DONE:1;      /* Bidirectional Reset Enable for self-test completed */
#ifndef USE_FIELD_ALIASES_RGM
         uint16_t  BE_CMU12_FHL:1;    /* Bidirectional Reset Enable for CMU 1/2 clock freq. too high/low */
#else
         uint16_t  BE_CMU1_FHL:1;       /* deprecated name - please avoid */
#endif
         uint16_t  BE_FL_ECC_RCC:1;   /* Bidirectional Reset Enable for Flash, ECC, or lock-step error */
         uint16_t  BE_PLL1:1;         /* Bidirectional Reset Enable for PLL1 fail */
         uint16_t  BE_SWT:1;          /* Bidirectional Reset Enable for Software Watchdog Timer */
         uint16_t:1;
         uint16_t  BE_CMU0_FHL:1;     /* Bidirectional Reset Enable for CMU 0 clock freq. too high/low */
         uint16_t  BE_CMU0_OLR:1;     /* Bidirectional Reset Enable for oscillator freq. too low */
         uint16_t  BE_PLL0:1;         /* Bidirectional Reset Enable for PLL0 fail */
         uint16_t  BE_CWD:1;          /* Bidirectional Reset Enable for Core Watchdog Reset */
         uint16_t  BE_SOFT:1;         /* Bidirectional Reset Enable for software reset */
         uint16_t  BE_CORE:1;         /* Bidirectional Reset Enable for core reset */
         uint16_t  BE_JTAG:1;         /* Bidirectional Reset Enable for JTAG initiated reset */
      } B;
   } RGM_FBRE_16B_tag;



   typedef struct RGM_struct_tag { /* start of RGM_tag */
                                     /* Functional Event Status Register */
      RGM_FES_16B_tag FES;                 /* offset: 0x0000 size: 16 bit */
                                    /* Destructive Event Status Register */
      RGM_DES_16B_tag DES;                 /* offset: 0x0002 size: 16 bit */
                              /* Functional Event Reset Disable Register */
      RGM_FERD_16B_tag FERD;               /* offset: 0x0004 size: 16 bit */
                             /* Destructive Event Reset Disable Register */
      RGM_DERD_16B_tag DERD;               /* offset: 0x0006 size: 16 bit */
      int8_t RGM_reserved_0008[8];
                          /* Functional Event Alternate Request Register */
      RGM_FEAR_16B_tag FEAR;               /* offset: 0x0010 size: 16 bit */
      int8_t RGM_reserved_0012[6];
                             /* Functional Event Short Sequence Register */
      RGM_FESS_16B_tag FESS;               /* offset: 0x0018 size: 16 bit */
      int8_t RGM_reserved_001A[2];
                       /* Functional Bidirectional Reset Enable Register */
      RGM_FBRE_16B_tag FBRE;               /* offset: 0x001C size: 16 bit */
   } RGM_tag;


#define RGM   (*(volatile RGM_tag *) 0xC3FE4000UL)



/****************************************************************/
/*                                                              */
/* Module: PCU  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers PCONF... */

   typedef union {   /* PCU_PCONF[0..15] -  Power Domain #0..#15 Configuration Register */
      uint32_t R;
      struct {
         uint32_t:18;
         uint32_t  STBY0:1;           /* Power domain control during STBY0 */
         uint32_t:2;
         uint32_t  STOP0:1;           /* Power domain control during STOP0 */
         uint32_t:1;
         uint32_t  HALT0:1;           /* Power domain control during HALT0 */
         uint32_t  RUN3:1;            /* Power domain control during RUN3 */
         uint32_t  RUN2:1;            /* Power domain control during RUN2 */
         uint32_t  RUN1:1;            /* Power domain control during RUN1 */
         uint32_t  RUN0:1;            /* Power domain control during RUN0 */
         uint32_t  DRUN:1;            /* Power domain control during DRUN */
         uint32_t  SAFE:1;            /* Power domain control during SAFE */
         uint32_t  TEST:1;            /* Power domain control during TEST */
         uint32_t  RST:1;             /* Power domain control during RST */
      } B;
   } PCU_PCONF_32B_tag;

   typedef union {   /* PCU_PSTAT - Power Domain Status Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  PD15:1;            /* Power Status for Power Domain 15 */
         uint32_t  PD14:1;            /* Power Status for Power Domain 14 */
         uint32_t  PD13:1;            /* Power Status for Power Domain 13 */
         uint32_t  PD12:1;            /* Power Status for Power Domain 12 */
         uint32_t  PD11:1;            /* Power Status for Power Domain 11 */
         uint32_t  PD10:1;            /* Power Status for Power Domain 10 */
         uint32_t  PD9:1;             /* Power Status for Power Domain 9 */
         uint32_t  PD8:1;             /* Power Status for Power Domain 8 */
         uint32_t  PD7:1;             /* Power Status for Power Domain 7 */
         uint32_t  PD6:1;             /* Power Status for Power Domain 6 */
         uint32_t  PD5:1;             /* Power Status for Power Domain 5 */
         uint32_t  PD4:1;             /* Power Status for Power Domain 4 */
         uint32_t  PD3:1;             /* Power Status for Power Domain 3 */
         uint32_t  PD2:1;             /* Power Status for Power Domain 2 */
         uint32_t  PD1:1;             /* Power Status for Power Domain 1 */
         uint32_t  PD0:1;             /* Power Status for Power Domain 0 */
      } B;
   } PCU_PSTAT_32B_tag;



   typedef struct PCU_struct_tag { /* start of PCU_tag */
      union {
       /* PCU_PCONF[0..15] -  Power Domain #0..#15 Configuration Register */
         PCU_PCONF_32B_tag PCONF[16];      /* offset: 0x0000  (0x0004 x 16) */

