RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
       /* PCU_PCONF[0..15] -  Power Domain #0..#15 Configuration Register */
            PCU_PCONF_32B_tag PCONF0;      /* offset: 0x0000 size: 32 bit */
            PCU_PCONF_32B_tag PCONF1;      /* offset: 0x0004 size: 32 bit */
            PCU_PCONF_32B_tag PCONF2;      /* offset: 0x0008 size: 32 bit */
            PCU_PCONF_32B_tag PCONF3;      /* offset: 0x000C size: 32 bit */
            PCU_PCONF_32B_tag PCONF4;      /* offset: 0x0010 size: 32 bit */
            PCU_PCONF_32B_tag PCONF5;      /* offset: 0x0014 size: 32 bit */
            PCU_PCONF_32B_tag PCONF6;      /* offset: 0x0018 size: 32 bit */
            PCU_PCONF_32B_tag PCONF7;      /* offset: 0x001C size: 32 bit */
            PCU_PCONF_32B_tag PCONF8;      /* offset: 0x0020 size: 32 bit */
            PCU_PCONF_32B_tag PCONF9;      /* offset: 0x0024 size: 32 bit */
            PCU_PCONF_32B_tag PCONF10;     /* offset: 0x0028 size: 32 bit */
            PCU_PCONF_32B_tag PCONF11;     /* offset: 0x002C size: 32 bit */
            PCU_PCONF_32B_tag PCONF12;     /* offset: 0x0030 size: 32 bit */
            PCU_PCONF_32B_tag PCONF13;     /* offset: 0x0034 size: 32 bit */
            PCU_PCONF_32B_tag PCONF14;     /* offset: 0x0038 size: 32 bit */
            PCU_PCONF_32B_tag PCONF15;     /* offset: 0x003C size: 32 bit */
         };

      };
                             /* PCU_PSTAT - Power Domain Status Register */
      PCU_PSTAT_32B_tag PSTAT;             /* offset: 0x0040 size: 32 bit */
   } PCU_tag;


#define PCU   (*(volatile PCU_tag *) 0xC3FE8000UL)



/****************************************************************/
/*                                                              */
/* Module: PMUCTRL  */
/*                                                              */
/****************************************************************/

   typedef union {   /* PMUCTRL_STATHVD - PMU Status Register HVD */
      uint32_t R;
      struct {
         uint32_t:11;
         uint32_t  HVDT_LPB:5;        /* High Voltage Detector trimming bits LPB bus */
         uint32_t:6;
         uint32_t  HVD_M:1;           /* High Voltage Detector Main */
         uint32_t  HVD_B:1;           /* High Voltage Detector Backup */
         uint32_t:4;
         uint32_t  HVD_LP:4;          /* High Voltage Detector trimming bits LP bus */
      } B;
   } PMUCTRL_STATHVD_32B_tag;

   typedef union {   /* PMUCTRL_STATLVD - PMU Status Register LVD */
      uint32_t R;
      struct {
         uint32_t:11;
         uint32_t  LVDT_LPB:5;        /* Ligh Voltage Detector trimming bits LPB bus */
         uint32_t:6;
         uint32_t  LVD_M:1;           /* Ligh Voltage Detector Main */
         uint32_t  LVD_B:1;           /* Ligh Voltage Detector Backup */
         uint32_t:4;
         uint32_t  LVD_LP:4;          /* Ligh Voltage Detector trimming bits LP bus */
      } B;
   } PMUCTRL_STATLVD_32B_tag;

   typedef union {   /* PMUCTRL_STATIREG - PMU Status Register IREG */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  IIREG_HP:4;        /* Internal ballast REGulator hpreg1 trimming bits */
      } B;
   } PMUCTRL_STATIREG_32B_tag;

   typedef union {   /* PMUCTRL_STATEREG - PMU Status Register EREG */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  EEREG_HP:4;        /* Internal ballast REGulator hpreg1 trimming bits */
      } B;
   } PMUCTRL_STATEREG_32B_tag;

   typedef union {   /* PMUCTRL_STATUS - PMU Status Register STATUS */
      uint32_t R;
      struct {
         uint32_t  EBMM:1;            /* External Ballast Management Mode */
         uint32_t  AEBD:1;            /* Automatic External Ballast Detection */
         uint32_t  ENPN:1;            /* External NPN status flag */
         uint32_t:13;
         uint32_t  CTB:2;             /* Configuration Trace Bits */
         uint32_t:6;
         uint32_t  CBS:4;             /* Current BIST Status */
         uint32_t  CPCS:4;            /* Current Pmu Configuration Status */
      } B;
   } PMUCTRL_STATUS_32B_tag;

   typedef union {   /* PMUCTRL_CTRL - PMU Control Register */
      uint32_t R;
      struct {
         uint32_t:30;
         uint32_t  SILHT:2;           /* Start Idle or LVD or HVD BIST Test */
      } B;
   } PMUCTRL_CTRL_32B_tag;

   typedef union {   /* PMUCTRL_MASKF - PMU Mask Fault Register */
      uint32_t R;
      struct {
         uint32_t  MF_BB:4;           /* Mask Fault Bypass Balast */
         uint32_t:28;
      } B;
   } PMUCTRL_MASKF_32B_tag;

   typedef union {   /* PMUCTRL_FAULT - PMU Fault Monitor Register */
      uint32_t R;
      struct {
         uint32_t  BB_LV:4;           /* Bypass Ballast Low Voltage */
         uint32_t:9;
         uint32_t  FLNCF:1;           /* FLash voltage monitor Non Critical Fault */
         uint32_t  IONCF:1;           /* IO voltage monitor Non Critical Fault */
         uint32_t  RENCF:1;           /* REgulator voltage monitor Non Critical Fault */
         uint32_t:13;
         uint32_t  LHCF:1;            /* Low High voltage detector Critical Fault */
         uint32_t  LNCF:1;            /* Low  voltage detector Non Critical Fault */
         uint32_t  HNCF:1;            /* High voltage detector Non Critical Fault */
      } B;
   } PMUCTRL_FAULT_32B_tag;

   typedef union {   /* PMUCTRL_IRQS - PMU Interrupt Request Status Register */
      uint32_t R;
      struct {
         uint32_t:10;
         uint32_t  MFVMP:1;           /* Main   Flash     Voltage Monitor interrupt Pending */
         uint32_t  BFVMP:1;           /* Backup Flash     Voltage Monitor interrupt Pending */
         uint32_t  MIVMP:1;           /* MAin   IO        Voltage Monitor interrupt Pending */
         uint32_t  BIVMP:1;           /* Backup IO        Voltage Monitor interrupt Pending */
         uint32_t  MRVMP:1;           /* Main   Regulator Voltage Monitor interrupt Pending */
         uint32_t  BRVMP:1;           /* Backup Regulator Voltage Monitor interrupt Pending */
         uint32_t:12;
         uint32_t  MLVDP:1;           /* Main   Low  Voltage Detector error interrupt Pending */
         uint32_t  BLVDP:1;           /* Backup Low  Voltage Detector error interrupt Pending */
         uint32_t  MHVDP:1;           /* Main   High Voltage Detector error interrupt Pending */
         uint32_t  BHVDP:1;           /* Backup High Voltage Detector error interrupt Pending */
      } B;
   } PMUCTRL_IRQS_32B_tag;

