RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* PMUCTRL_IRQE - PMU Interrupt Request Enable Register */
      uint32_t R;
      struct {
         uint32_t:10;
         uint32_t  MFVME:1;           /* Main   Flash     Voltage Monitor interrupt Enable */
         uint32_t  BFVME:1;           /* Backup Flash     Voltage Monitor interrupt Enable */
         uint32_t  MIVME:1;           /* MAin   IO        Voltage Monitor interrupt Enable */
         uint32_t  BIVME:1;           /* Backup IO        Voltage Monitor interrupt Enable */
         uint32_t  MRVME:1;           /* Main   Regulator Voltage Monitor interrupt Enable */
         uint32_t  BRVME:1;           /* Backup Regulator Voltage Monitor interrupt Enable */
         uint32_t:12;
         uint32_t  MLVDE:1;           /* Main   Low  Voltage Detector error interrupt Enable */
         uint32_t  BLVDE:1;           /* Backup Low  Voltage Detector error interrupt Enable */
         uint32_t  MHVDE:1;           /* Main   High Voltage Detector error interrupt Enable */
         uint32_t  BHVDE:1;           /* Backup High Voltage Detector error interrupt Enable */
      } B;
   } PMUCTRL_IRQE_32B_tag;



   typedef struct PMUCTRL_struct_tag { /* start of PMUCTRL_tag */
      int8_t PMUCTRL_reserved_0000[4];
                            /* PMUCTRL_STATHVD - PMU Status Register HVD */
      PMUCTRL_STATHVD_32B_tag STATHVD;     /* offset: 0x0004 size: 32 bit */
                            /* PMUCTRL_STATLVD - PMU Status Register LVD */
      PMUCTRL_STATLVD_32B_tag STATLVD;     /* offset: 0x0008 size: 32 bit */
      int8_t PMUCTRL_reserved_000C[20];
                          /* PMUCTRL_STATIREG - PMU Status Register IREG */
      PMUCTRL_STATIREG_32B_tag STATIREG;   /* offset: 0x0020 size: 32 bit */
                          /* PMUCTRL_STATEREG - PMU Status Register EREG */
      PMUCTRL_STATEREG_32B_tag STATEREG;   /* offset: 0x0024 size: 32 bit */
      int8_t PMUCTRL_reserved_0028[24];
                          /* PMUCTRL_STATUS - PMU Status Register STATUS */
      PMUCTRL_STATUS_32B_tag STATUS;       /* offset: 0x0040 size: 32 bit */
                                  /* PMUCTRL_CTRL - PMU Control Register */
      PMUCTRL_CTRL_32B_tag CTRL;           /* offset: 0x0044 size: 32 bit */
      int8_t PMUCTRL_reserved_0048[40];
                              /* PMUCTRL_MASKF - PMU Mask Fault Register */
      PMUCTRL_MASKF_32B_tag MASKF;         /* offset: 0x0070 size: 32 bit */
                           /* PMUCTRL_FAULT - PMU Fault Monitor Register */
      PMUCTRL_FAULT_32B_tag FAULT;         /* offset: 0x0074 size: 32 bit */
                 /* PMUCTRL_IRQS - PMU Interrupt Request Status Register */
      PMUCTRL_IRQS_32B_tag IRQS;           /* offset: 0x0078 size: 32 bit */
                 /* PMUCTRL_IRQE - PMU Interrupt Request Enable Register */
      PMUCTRL_IRQE_32B_tag IRQE;           /* offset: 0x007C size: 32 bit */
   } PMUCTRL_tag;


#define PMUCTRL (*(volatile PMUCTRL_tag *) 0xC3FE8080UL)



/****************************************************************/
/*                                                              */
/* Module: PIT_RTI  */
/*                                                              */
/****************************************************************/

   typedef union {   /* PIT_RTI_PITMCR - PIT Module Control Register */
      uint32_t R;
      struct {
         uint32_t:30;
         uint32_t  MDIS:1;            /* Module Disable. Disable the module clock */
         uint32_t  FRZ:1;             /* Freeze. Allows the timers to be stoppedwhen the device enters debug mode */
      } B;
   } PIT_RTI_PITMCR_32B_tag;


   /* Register layout for all registers LDVAL... */

   typedef union {   /* PIT_RTI_LDVAL - Timer Load Value Register */
      uint32_t R;
      struct {
         uint32_t  TSV:32;            /* Time Start Value Bits */
      } B;
   } PIT_RTI_LDVAL_32B_tag;


   /* Register layout for all registers CVAL... */

   typedef union {   /* PIT_RTI_CVAL - Current Timer Value Register */
      uint32_t R;
      struct {
         uint32_t  TVL:32;            /* Current Timer Value Bits */
      } B;
   } PIT_RTI_CVAL_32B_tag;


   /* Register layout for all registers TCTRL... */

   typedef union {   /* PIT_RTI_TCTRL - Timer Control Register */
      uint32_t R;
      struct {
         uint32_t:30;
         uint32_t  TIE:1;             /* Timer Interrupt Enable Bit */
         uint32_t  TEN:1;             /* Timer Enable Bit */
      } B;
   } PIT_RTI_TCTRL_32B_tag;


   /* Register layout for all registers TFLG... */

   typedef union {   /* PIT_RTI_TFLG - Timer Flag Register */
      uint32_t R;
      struct {
         uint32_t:31;
         uint32_t  TIF:1;             /* Timer Interrupt Flag Bit */
      } B;
   } PIT_RTI_TFLG_32B_tag;


   typedef struct PIT_RTI_CHANNEL_struct_tag {

                            /* PIT_RTI_LDVAL - Timer Load Value Register */
      PIT_RTI_LDVAL_32B_tag LDVAL;        /* relative offset: 0x0000 */
                          /* PIT_RTI_CVAL - Current Timer Value Register */
      PIT_RTI_CVAL_32B_tag CVAL;          /* relative offset: 0x0004 */
                               /* PIT_RTI_TCTRL - Timer Control Register */
      PIT_RTI_TCTRL_32B_tag TCTRL;        /* relative offset: 0x0008 */
                                   /* PIT_RTI_TFLG - Timer Flag Register */
      PIT_RTI_TFLG_32B_tag TFLG;          /* relative offset: 0x000C */

   } PIT_RTI_CHANNEL_tag;


   typedef struct PIT_RTI_struct_tag { /* start of PIT_RTI_tag */
                         /* PIT_RTI_PITMCR - PIT Module Control Register */
      PIT_RTI_PITMCR_32B_tag PITMCR;       /* offset: 0x0000 size: 32 bit */
      int8_t PIT_RTI_reserved_0004_C[252];
      union {
                                                /*  Register set CHANNEL */
         PIT_RTI_CHANNEL_tag CHANNEL[4];   /* offset: 0x0100  (0x0010 x 4) */
		 
		 PIT_RTI_CHANNEL_tag CH[4];   /* offset: 0x0100  (0x0010 x 4) */

         struct {
                            /* PIT_RTI_LDVAL - Timer Load Value Register */
            PIT_RTI_LDVAL_32B_tag LDVAL0;  /* offset: 0x0100 size: 32 bit */
                          /* PIT_RTI_CVAL - Current Timer Value Register */
            PIT_RTI_CVAL_32B_tag CVAL0;    /* offset: 0x0104 size: 32 bit */
                               /* PIT_RTI_TCTRL - Timer Control Register */
            PIT_RTI_TCTRL_32B_tag TCTRL0;  /* offset: 0x0108 size: 32 bit */
                                   /* PIT_RTI_TFLG - Timer Flag Register */
            PIT_RTI_TFLG_32B_tag TFLG0;    /* offset: 0x010C size: 32 bit */
                            /* PIT_RTI_LDVAL - Timer Load Value Register */
            PIT_RTI_LDVAL_32B_tag LDVAL1;  /* offset: 0x0110 size: 32 bit */
                          /* PIT_RTI_CVAL - Current Timer Value Register */
            PIT_RTI_CVAL_32B_tag CVAL1;    /* offset: 0x0114 size: 32 bit */
                               /* PIT_RTI_TCTRL - Timer Control Register */
            PIT_RTI_TCTRL_32B_tag TCTRL1;  /* offset: 0x0118 size: 32 bit */
                                   /* PIT_RTI_TFLG - Timer Flag Register */
            PIT_RTI_TFLG_32B_tag TFLG1;    /* offset: 0x011C size: 32 bit */
                            /* PIT_RTI_LDVAL - Timer Load Value Register */
            PIT_RTI_LDVAL_32B_tag LDVAL2;  /* offset: 0x0120 size: 32 bit */
                          /* PIT_RTI_CVAL - Current Timer Value Register */
            PIT_RTI_CVAL_32B_tag CVAL2;    /* offset: 0x0124 size: 32 bit */
                               /* PIT_RTI_TCTRL - Timer Control Register */
            PIT_RTI_TCTRL_32B_tag TCTRL2;  /* offset: 0x0128 size: 32 bit */
                                   /* PIT_RTI_TFLG - Timer Flag Register */
            PIT_RTI_TFLG_32B_tag TFLG2;    /* offset: 0x012C size: 32 bit */
                            /* PIT_RTI_LDVAL - Timer Load Value Register */
            PIT_RTI_LDVAL_32B_tag LDVAL3;  /* offset: 0x0130 size: 32 bit */
                          /* PIT_RTI_CVAL - Current Timer Value Register */
            PIT_RTI_CVAL_32B_tag CVAL3;    /* offset: 0x0134 size: 32 bit */
                               /* PIT_RTI_TCTRL - Timer Control Register */
            PIT_RTI_TCTRL_32B_tag TCTRL3;  /* offset: 0x0138 size: 32 bit */
                                   /* PIT_RTI_TFLG - Timer Flag Register */
            PIT_RTI_TFLG_32B_tag TFLG3;    /* offset: 0x013C size: 32 bit */
         };

