RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
   } PIT_RTI_tag;


#define PIT_RTI (*(volatile PIT_RTI_tag *) 0xC3FF0000UL)



/****************************************************************/
/*                                                              */
/* Module: ADC  */
/*                                                              */
/****************************************************************/

   typedef union {   /* module configuration register */
      uint32_t R;
      struct {
         uint32_t  OWREN:1;           /* Overwrite enable */
         uint32_t  WLSIDE:1;          /* Write Left/right Alligned */
         uint32_t  MODE:1;            /* One Shot/Scan Mode Selectiom */
         uint32_t  EDGLEV:1;          /* edge or level selection for external start trigger */
         uint32_t  TRGEN:1;           /* external trigger enable */
         uint32_t  EDGE:1;            /* start trigger egde /level detection */
         uint32_t  XSTRTEN:1;         /* EXTERNAL START ENABLE */
         uint32_t  NSTART:1;          /* start normal conversion */
         uint32_t:1;
         uint32_t  JTRGEN:1;          /* Injectin External Trigger Enable */
         uint32_t  JEDGE:1;           /* start trigger egde /level detection for injected */
         uint32_t  JSTART:1;          /* injected conversion start */
         uint32_t:2;
         uint32_t  CTUEN:1;           /* CTU enabaled */
         uint32_t:8;
         uint32_t  ADCLKSEL:1;        /* Select which clock for device */
         uint32_t  ABORTCHAIN:1;      /* abort chain conversion */
         uint32_t  ABORT:1;           /* abort current conversion */
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  ACKO:1;            /* Auto Clock Off Enable */
#else
         uint32_t  ACK0:1;              /* deprecated name - please avoid */
#endif
         uint32_t  OFFREFRESH:1;      /* offset phase selection */
         uint32_t  OFFCANC:1;         /* offset phase cancellation selection */
         uint32_t:2;
         uint32_t  PWDN:1;            /* Power Down Enable */
      } B;
   } ADC_MCR_32B_tag;

   typedef union {   /* module status register */
      uint32_t R;
      struct {
         uint32_t:7;
         uint32_t  NSTART:1;          /* normal conversion status */
         uint32_t  JABORT:1;          /* Injection chain abort status */
         uint32_t:2;
         uint32_t  JSTART:1;          /* Injection Start status */
         uint32_t:3;
         uint32_t  CTUSTART:1;        /* ctu start status */
         uint32_t  CHADDR:7;          /* which address conv is goin on */
         uint32_t:3;
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  ACKO:1;            /* Auto Clock Off Enable status */
#else
         uint32_t  ACK0:1;              /* deprecated name - please avoid */
#endif
         uint32_t  OFFREFRESH:1;      /* offset refresh status */
         uint32_t  OFFCANC:1;         /* offset phase cancellation status */
         uint32_t  ADCSTATUS:3;       /* status of ADC FSM */
      } B;
   } ADC_MSR_32B_tag;

   typedef union {   /* Interrupt status register */
      uint32_t R;
      struct {
         uint32_t:25;
         uint32_t  OFFCANCOVR:1;      /* Offset cancellation phase over */
         uint32_t  EOFFSET:1;         /* error in offset refresh */
         uint32_t  EOCTU:1;           /* end of CTU channel conversion */
         uint32_t  JEOC:1;            /* end of injected channel conversion */
         uint32_t  JECH:1;            /* end ofinjected chain conversion */
         uint32_t  EOC:1;             /* end of channel conversion */
         uint32_t  ECH:1;             /* end of chain conversion */
      } B;
   } ADC_ISR_32B_tag;

   typedef union {   /* CHANNEL PENDING REGISTER 0 */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH31:1;        /* Channel 31 conversion over */
#else
         uint32_t  EOC31:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH30:1;        /* Channel 30 conversion over */
#else
         uint32_t  EOC30:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH29:1;        /* Channel 29 conversion over */
#else
         uint32_t  EOC29:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH28:1;        /* Channel 28 conversion over */
#else
         uint32_t  EOC28:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH27:1;        /* Channel 27 conversion over */
#else
         uint32_t  EOC27:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH26:1;        /* Channel 26 conversion over */
#else
         uint32_t  EOC26:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH25:1;        /* Channel 25 conversion over */
#else
         uint32_t  EOC25:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH24:1;        /* Channel 24 conversion over */
#else
         uint32_t  EOC24:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH23:1;        /* Channel 23 conversion over */
#else
         uint32_t  EOC23:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH22:1;        /* Channel 22 conversion over */
#else
         uint32_t  EOC22:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH21:1;        /* Channel 21 conversion over */
#else
         uint32_t  EOC21:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH20:1;        /* Channel 20 conversion over */
#else
         uint32_t  EOC20:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH19:1;        /* Channel 19 conversion over */
#else
         uint32_t  EOC19:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH18:1;        /* Channel 18 conversion over */
#else
         uint32_t  EOC18:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH17:1;        /* Channel 17 conversion over */
#else
         uint32_t  EOC17:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH16:1;        /* Channel 16 conversion over */
#else
         uint32_t  EOC16:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH15:1;        /* Channel 15 conversion over */
#else
         uint32_t  EOC15:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH14:1;        /* Channel 14 conversion over */
#else
         uint32_t  EOC14:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH13:1;        /* Channel 13 conversion over */
#else
         uint32_t  EOC13:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH12:1;        /* Channel 12 conversion over */
#else
         uint32_t  EOC12:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH11:1;        /* Channel 11 conversion over */
#else
         uint32_t  EOC11:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH10:1;        /* Channel 10 conversion over */
#else
         uint32_t  EOC10:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH9:1;         /* Channel 9 conversion over */
#else
         uint32_t  EOC9:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH8:1;         /* Channel 8 conversion over */
#else
         uint32_t  EOC8:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH7:1;         /* Channel 7 conversion over */
#else
         uint32_t  EOC7:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH6:1;         /* Channel 6 conversion over */
#else
         uint32_t  EOC6:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH5:1;         /* Channel 5 conversion over */
#else
         uint32_t  EOC5:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH4:1;         /* Channel 4 conversion over */
#else
         uint32_t  EOC4:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH3:1;         /* Channel 3 conversion over */
#else
         uint32_t  EOC3:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH2:1;         /* Channel 2 conversion over */
#else
         uint32_t  EOC2:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH1:1;         /* Channel 1 conversion over */
#else
         uint32_t  EOC1:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  EOC_CH0:1;         /* Channel 0 conversion over */
#else
         uint32_t  EOC0:1;              /* deprecated name - please avoid */
#endif
      } B;
   } ADC_CEOCFR0_32B_tag;

   typedef union {   /* CHANNEL PENDING REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  EOC_CH63:1;        /* Channel 63 conversion over */
         uint32_t  EOC_CH62:1;        /* Channel 62 conversion over */
         uint32_t  EOC_CH61:1;        /* Channel 61 conversion over */
         uint32_t  EOC_CH60:1;        /* Channel 60 conversion over */
         uint32_t  EOC_CH59:1;        /* Channel 59 conversion over */
         uint32_t  EOC_CH58:1;        /* Channel 58 conversion over */
         uint32_t  EOC_CH57:1;        /* Channel 57 conversion over */
         uint32_t  EOC_CH56:1;        /* Channel 56 conversion over */
         uint32_t  EOC_CH55:1;        /* Channel 55 conversion over */
         uint32_t  EOC_CH54:1;        /* Channel 54 conversion over */
         uint32_t  EOC_CH53:1;        /* Channel 53 conversion over */
         uint32_t  EOC_CH52:1;        /* Channel 52 conversion over */
         uint32_t  EOC_CH51:1;        /* Channel 51 conversion over */
         uint32_t  EOC_CH50:1;        /* Channel 50 conversion over */
         uint32_t  EOC_CH49:1;        /* Channel 49 conversion over */
         uint32_t  EOC_CH48:1;        /* Channel 48 conversion over */
         uint32_t  EOC_CH47:1;        /* Channel 47 conversion over */
         uint32_t  EOC_CH46:1;        /* Channel 46 conversion over */
         uint32_t  EOC_CH45:1;        /* Channel 45 conversion over */
         uint32_t  EOC_CH44:1;        /* Channel 44 conversion over */
         uint32_t  EOC_CH43:1;        /* Channel 43 conversion over */
         uint32_t  EOC_CH42:1;        /* Channel 42 conversion over */
         uint32_t  EOC_CH41:1;        /* Channel 41 conversion over */
         uint32_t  EOC_CH40:1;        /* Channel 40 conversion over */
         uint32_t  EOC_CH39:1;        /* Channel 39 conversion over */
         uint32_t  EOC_CH38:1;        /* Channel 38 conversion over */
         uint32_t  EOC_CH37:1;        /* Channel 37 conversion over */
         uint32_t  EOC_CH36:1;        /* Channel 36 conversion over */
         uint32_t  EOC_CH35:1;        /* Channel 35 conversion over */
         uint32_t  EOC_CH34:1;        /* Channel 34 conversion over */
         uint32_t  EOC_CH33:1;        /* Channel 33 conversion over */
         uint32_t  EOC_CH32:1;        /* Channel 32 conversion over */
      } B;
   } ADC_CEOCFR1_32B_tag;

   typedef union {   /* CHANNEL PENDING REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  EOC_CH95:1;        /* Channel 95 conversion over */
         uint32_t  EOC_CH94:1;        /* Channel 94 conversion over */
         uint32_t  EOC_CH93:1;        /* Channel 93 conversion over */
         uint32_t  EOC_CH92:1;        /* Channel 92 conversion over */
         uint32_t  EOC_CH91:1;        /* Channel 91 conversion over */
         uint32_t  EOC_CH90:1;        /* Channel 90 conversion over */
         uint32_t  EOC_CH89:1;        /* Channel 89 conversion over */
         uint32_t  EOC_CH88:1;        /* Channel 88 conversion over */
         uint32_t  EOC_CH87:1;        /* Channel 87 conversion over */
         uint32_t  EOC_CH86:1;        /* Channel 86 conversion over */
         uint32_t  EOC_CH85:1;        /* Channel 85 conversion over */
         uint32_t  EOC_CH84:1;        /* Channel 84 conversion over */
         uint32_t  EOC_CH83:1;        /* Channel 83 conversion over */
         uint32_t  EOC_CH82:1;        /* Channel 82 conversion over */
         uint32_t  EOC_CH81:1;        /* Channel 81 conversion over */
         uint32_t  EOC_CH80:1;        /* Channel 80 conversion over */
         uint32_t  EOC_CH79:1;        /* Channel 79 conversion over */
         uint32_t  EOC_CH78:1;        /* Channel 78 conversion over */
         uint32_t  EOC_CH77:1;        /* Channel 77 conversion over */
         uint32_t  EOC_CH76:1;        /* Channel 76 conversion over */
         uint32_t  EOC_CH75:1;        /* Channel 75 conversion over */
         uint32_t  EOC_CH74:1;        /* Channel 74 conversion over */
         uint32_t  EOC_CH73:1;        /* Channel 73 conversion over */
         uint32_t  EOC_CH72:1;        /* Channel 72 conversion over */
         uint32_t  EOC_CH71:1;        /* Channel 71 conversion over */
         uint32_t  EOC_CH70:1;        /* Channel 70 conversion over */
         uint32_t  EOC_CH69:1;        /* Channel 69 conversion over */
         uint32_t  EOC_CH68:1;        /* Channel 68 conversion over */
         uint32_t  EOC_CH67:1;        /* Channel 67 conversion over */
         uint32_t  EOC_CH66:1;        /* Channel 66 conversion over */
         uint32_t  EOC_CH65:1;        /* Channel 65 conversion over */
         uint32_t  EOC_CH64:1;        /* Channel 64 conversion over */
      } B;
   } ADC_CEOCFR2_32B_tag;

   typedef union {   /* interrupt mask register */
      uint32_t R;
      struct {
         uint32_t:25;
         uint32_t  MSKOFFCANCOVR:1;   /* mask bit for Calibration over */
         uint32_t  MSKEOFFSET:1;      /* mask bit for Error in offset refresh */
         uint32_t  MSKEOCTU:1;        /* mask bit for EOCTU */
         uint32_t  MSKJEOC:1;         /* mask bit for JEOC */
         uint32_t  MSKJECH:1;         /* mask bit for JECH */
         uint32_t  MSKEOC:1;          /* mask bit for EOC */
         uint32_t  MSKECH:1;          /* mask bit for ECH */
      } B;
   } ADC_IMR_32B_tag;

   typedef union {   /* CHANNEL INTERRUPT MASK REGISTER 0 */
      uint32_t R;
      struct {
         uint32_t  CIM31:1;           /* Channel 31 mask register */
         uint32_t  CIM30:1;           /* Channel 30 mask register */
         uint32_t  CIM29:1;           /* Channel 29 mask register */
         uint32_t  CIM28:1;           /* Channel 28 mask register */
         uint32_t  CIM27:1;           /* Channel 27 mask register */
         uint32_t  CIM26:1;           /* Channel 26 mask register */
         uint32_t  CIM25:1;           /* Channel 25 mask register */
         uint32_t  CIM24:1;           /* Channel 24 mask register */
         uint32_t  CIM23:1;           /* Channel 23 mask register */
         uint32_t  CIM22:1;           /* Channel 22 mask register */
         uint32_t  CIM21:1;           /* Channel 21 mask register */
         uint32_t  CIM20:1;           /* Channel 20 mask register */
         uint32_t  CIM19:1;           /* Channel 19 mask register */
         uint32_t  CIM18:1;           /* Channel 18 mask register */
         uint32_t  CIM17:1;           /* Channel 17 mask register */
         uint32_t  CIM16:1;           /* Channel 16 mask register */
         uint32_t  CIM15:1;           /* Channel 15 mask register */
         uint32_t  CIM14:1;           /* Channel 14 mask register */
         uint32_t  CIM13:1;           /* Channel 13 mask register */
         uint32_t  CIM12:1;           /* Channel 12 mask register */
         uint32_t  CIM11:1;           /* Channel 11 mask register */
         uint32_t  CIM10:1;           /* Channel 10 mask register */
         uint32_t  CIM9:1;            /* Channel 9  mask register */
         uint32_t  CIM8:1;            /* Channel 8  mask register */
         uint32_t  CIM7:1;            /* Channel 7  mask register */
         uint32_t  CIM6:1;            /* Channel 6  mask register */
         uint32_t  CIM5:1;            /* Channel 5  mask register */
         uint32_t  CIM4:1;            /* Channel 4  mask register */
         uint32_t  CIM3:1;            /* Channel 3  mask register */
         uint32_t  CIM2:1;            /* Channel 2  mask register */
         uint32_t  CIM1:1;            /* Channel 1  mask register */
         uint32_t  CIM0:1;            /* Channel 0  mask register */
      } B;
   } ADC_CIMR0_32B_tag;

