RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* CHANNEL INTERRUPT MASK REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  CIM63:1;           /* Channel 63 mask register */
         uint32_t  CIM62:1;           /* Channel 62 mask register */
         uint32_t  CIM61:1;           /* Channel 61 mask register */
         uint32_t  CIM60:1;           /* Channel 60 mask register */
         uint32_t  CIM59:1;           /* Channel 59 mask register */
         uint32_t  CIM58:1;           /* Channel 58 mask register */
         uint32_t  CIM57:1;           /* Channel 57 mask register */
         uint32_t  CIM56:1;           /* Channel 56 mask register */
         uint32_t  CIM55:1;           /* Channel 55 mask register */
         uint32_t  CIM54:1;           /* Channel 54 mask register */
         uint32_t  CIM53:1;           /* Channel 53 mask register */
         uint32_t  CIM52:1;           /* Channel 52 mask register */
         uint32_t  CIM51:1;           /* Channel 51 mask register */
         uint32_t  CIM50:1;           /* Channel 50 mask register */
         uint32_t  CIM49:1;           /* Channel 49 mask register */
         uint32_t  CIM48:1;           /* Channel 48 mask register */
         uint32_t  CIM47:1;           /* Channel 47 mask register */
         uint32_t  CIM46:1;           /* Channel 46 mask register */
         uint32_t  CIM45:1;           /* Channel 45 mask register */
         uint32_t  CIM44:1;           /* Channel 44 mask register */
         uint32_t  CIM43:1;           /* Channel 43 mask register */
         uint32_t  CIM42:1;           /* Channel 42 mask register */
         uint32_t  CIM41:1;           /* Channel 41 mask register */
         uint32_t  CIM40:1;           /* Channel 40 mask register */
         uint32_t  CIM39:1;           /* Channel 39 mask register */
         uint32_t  CIM38:1;           /* Channel 38 mask register */
         uint32_t  CIM37:1;           /* Channel 37 mask register */
         uint32_t  CIM36:1;           /* Channel 36 mask register */
         uint32_t  CIM35:1;           /* Channel 35 mask register */
         uint32_t  CIM34:1;           /* Channel 34 mask register */
         uint32_t  CIM33:1;           /* Channel 33 mask register */
         uint32_t  CIM32:1;           /* Channel 32 mask register */
      } B;
   } ADC_CIMR1_32B_tag;

   typedef union {   /* CHANNEL INTERRUPT MASK REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  CIM95:1;           /* Channel 95 mask register */
         uint32_t  CIM94:1;           /* Channel 94 mask register */
         uint32_t  CIM93:1;           /* Channel 93 mask register */
         uint32_t  CIM92:1;           /* Channel 92 mask register */
         uint32_t  CIM91:1;           /* Channel 91 mask register */
         uint32_t  CIM90:1;           /* Channel 90 mask register */
         uint32_t  CIM89:1;           /* Channel 89 mask register */
         uint32_t  CIM88:1;           /* Channel 88 mask register */
         uint32_t  CIM87:1;           /* Channel 87 mask register */
         uint32_t  CIM86:1;           /* Channel 86 mask register */
         uint32_t  CIM85:1;           /* Channel 85 mask register */
         uint32_t  CIM84:1;           /* Channel 84 mask register */
         uint32_t  CIM83:1;           /* Channel 83 mask register */
         uint32_t  CIM82:1;           /* Channel 82 mask register */
         uint32_t  CIM81:1;           /* Channel 81 mask register */
         uint32_t  CIM80:1;           /* Channel 80 mask register */
         uint32_t  CIM79:1;           /* Channel 79 mask register */
         uint32_t  CIM78:1;           /* Channel 78 mask register */
         uint32_t  CIM77:1;           /* Channel 77 mask register */
         uint32_t  CIM76:1;           /* Channel 76 mask register */
         uint32_t  CIM75:1;           /* Channel 75 mask register */
         uint32_t  CIM74:1;           /* Channel 74 mask register */
         uint32_t  CIM73:1;           /* Channel 73 mask register */
         uint32_t  CIM72:1;           /* Channel 72 mask register */
         uint32_t  CIM71:1;           /* Channel 71 mask register */
         uint32_t  CIM70:1;           /* Channel 70 mask register */
         uint32_t  CIM69:1;           /* Channel 69 mask register */
         uint32_t  CIM68:1;           /* Channel 68 mask register */
         uint32_t  CIM67:1;           /* Channel 67 mask register */
         uint32_t  CIM66:1;           /* Channel 66 mask register */
         uint32_t  CIM65:1;           /* Channel 65 mask register */
         uint32_t  CIM64:1;           /* Channel 64 mask register */
      } B;
   } ADC_CIMR2_32B_tag;

   typedef union {   /* Watchdog Threshold interrupt status register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  WDG3H:1;           /* Interrupt generated on the value being higher than the HTHV 3 */
         uint32_t  WDG2H:1;           /* Interrupt generated on the value being higher than the HTHV 2 */
         uint32_t  WDG1H:1;           /* Interrupt generated on the value being higher than the HTHV 1 */
         uint32_t  WDG0H:1;           /* Interrupt generated on the value being higher than the HTHV 0 */
         uint32_t  WDG3L:1;           /* Interrupt generated on the value being lower than the LTHV 3 */
         uint32_t  WDG2L:1;           /* Interrupt generated on the value being lower than the LTHV 2 */
         uint32_t  WDG1L:1;           /* Interrupt generated on the value being lower than the LTHV 1 */
         uint32_t  WDG0L:1;           /* Interrupt generated on the value being lower than the LTHV 0 */
      } B;
   } ADC_WTISR_32B_tag;

   typedef union {   /* Watchdog interrupt MASK register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  MSKWDG3H:1;        /* Mask enable for Interrupt generated on the value being higher than the HTHV 3 */
         uint32_t  MSKWDG2H:1;        /* Mask enable for  Interrupt generated on the value being higher than the HTHV 2 */
         uint32_t  MSKWDG1H:1;        /* Mask enable for Interrupt generated on the value being higher than the HTHV 1 */
         uint32_t  MSKWDG0H:1;        /* Mask enable for Interrupt generated on the value being higher than the HTHV 0 */
         uint32_t  MSKWDG3L:1;        /* Mask enable for Interrupt generated on the value being lower than the LTHV 3 */
         uint32_t  MSKWDG2L:1;        /* Mask enable for Interrupt generated on the value being lower than the LTHV 2 */
         uint32_t  MSKWDG1L:1;        /* MAsk enable for Interrupt generated on the value being lower than the LTHV 1 */
         uint32_t  MSKWDG0L:1;        /* Mask enable for Interrupt generated on the value being lower than the LTHV 0 */
      } B;
   } ADC_WTIMR_32B_tag;

   typedef union {   /* DMAE register */
      uint32_t R;
      struct {
         uint32_t:30;
         uint32_t  DCLR:1;            /* DMA clear sequence enable */
         uint32_t  DMAEN:1;           /* DMA global enable */
      } B;
   } ADC_DMAE_32B_tag;

   typedef union {   /* DMA  REGISTER 0 */
      uint32_t R;
      struct {
         uint32_t  DMA31:1;           /* Channel 31 DMA Enable */
         uint32_t  DMA30:1;           /* Channel 30 DMA Enable */
         uint32_t  DMA29:1;           /* Channel 29 DMA Enable */
         uint32_t  DMA28:1;           /* Channel 28 DMA Enable */
         uint32_t  DMA27:1;           /* Channel 27 DMA Enable */
         uint32_t  DMA26:1;           /* Channel 26 DMA Enable */
         uint32_t  DMA25:1;           /* Channel 25 DMA Enable */
         uint32_t  DMA24:1;           /* Channel 24 DMA Enable */
         uint32_t  DMA23:1;           /* Channel 23 DMA Enable */
         uint32_t  DMA22:1;           /* Channel 22 DMA Enable */
         uint32_t  DMA21:1;           /* Channel 21 DMA Enable */
         uint32_t  DMA20:1;           /* Channel 20 DMA Enable */
         uint32_t  DMA19:1;           /* Channel 19 DMA Enable */
         uint32_t  DMA18:1;           /* Channel 18 DMA Enable */
         uint32_t  DMA17:1;           /* Channel 17 DMA Enable */
         uint32_t  DMA16:1;           /* Channel 16 DMA Enable */
         uint32_t  DMA15:1;           /* Channel 15 DMA Enable */
         uint32_t  DMA14:1;           /* Channel 14 DMA Enable */
         uint32_t  DMA13:1;           /* Channel 13 DMA Enable */
         uint32_t  DMA12:1;           /* Channel 12 DMA Enable */
         uint32_t  DMA11:1;           /* Channel 11 DMA Enable */
         uint32_t  DMA10:1;           /* Channel 10 DMA Enable */
         uint32_t  DMA9:1;            /* Channel 9 DMA Enable */
         uint32_t  DMA8:1;            /* Channel 8 DMA Enable */
         uint32_t  DMA7:1;            /* Channel 7 DMA Enable */
         uint32_t  DMA6:1;            /* Channel 6 DMA Enable */
         uint32_t  DMA5:1;            /* Channel 5 DMA Enable */
         uint32_t  DMA4:1;            /* Channel 4 DMA Enable */
         uint32_t  DMA3:1;            /* Channel 3 DMA Enable */
         uint32_t  DMA2:1;            /* Channel 2 DMA Enable */
         uint32_t  DMA1:1;            /* Channel 1 DMA Enable */
         uint32_t  DMA0:1;            /* Channel 0 DMA Enable */
      } B;
   } ADC_DMAR0_32B_tag;

   typedef union {   /* DMA REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  DMA63:1;           /* Channel 63 DMA Enable */
         uint32_t  DMA62:1;           /* Channel 62 DMA Enable */
         uint32_t  DMA61:1;           /* Channel 61 DMA Enable */
         uint32_t  DMA60:1;           /* Channel 60 DMA Enable */
         uint32_t  DMA59:1;           /* Channel 59 DMA Enable */
         uint32_t  DMA58:1;           /* Channel 58 DMA Enable */
         uint32_t  DMA57:1;           /* Channel 57 DMA Enable */
         uint32_t  DMA56:1;           /* Channel 56 DMA Enable */
         uint32_t  DMA55:1;           /* Channel 55 DMA Enable */
         uint32_t  DMA54:1;           /* Channel 54 DMA Enable */
         uint32_t  DMA53:1;           /* Channel 53 DMA Enable */
         uint32_t  DMA52:1;           /* Channel 52 DMA Enable */
         uint32_t  DMA51:1;           /* Channel 51 DMA Enable */
         uint32_t  DMA50:1;           /* Channel 50 DMA Enable */
         uint32_t  DMA49:1;           /* Channel 49 DMA Enable */
         uint32_t  DMA48:1;           /* Channel 48 DMA Enable */
         uint32_t  DMA47:1;           /* Channel 47 DMA Enable */
         uint32_t  DMA46:1;           /* Channel 46 DMA Enable */
         uint32_t  DMA45:1;           /* Channel 45 DMA Enable */
         uint32_t  DMA44:1;           /* Channel 44 DMA Enable */
         uint32_t  DMA43:1;           /* Channel 43 DMA Enable */
         uint32_t  DMA42:1;           /* Channel 42 DMA Enable */
         uint32_t  DMA41:1;           /* Channel 41 DMA Enable */
         uint32_t  DMA40:1;           /* Channel 40 DMA Enable */
         uint32_t  DMA39:1;           /* Channel 39 DMA Enable */
         uint32_t  DMA38:1;           /* Channel 38 DMA Enable */
         uint32_t  DMA37:1;           /* Channel 37 DMA Enable */
         uint32_t  DMA36:1;           /* Channel 36 DMA Enable */
         uint32_t  DMA35:1;           /* Channel 35 DMA Enable */
         uint32_t  DMA34:1;           /* Channel 34 DMA Enable */
         uint32_t  DMA33:1;           /* Channel 33 DMA Enable */
         uint32_t  DMA32:1;           /* Channel 32 DMA Enable */
      } B;
   } ADC_DMAR1_32B_tag;

   typedef union {   /* DMA REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  DMA95:1;           /* Channel 95 DMA Enable */
         uint32_t  DMA94:1;           /* Channel 94 DMA Enable */
         uint32_t  DMA93:1;           /* Channel 93 DMA Enable */
         uint32_t  DMA92:1;           /* Channel 92 DMA Enable */
         uint32_t  DMA91:1;           /* Channel 91 DMA Enable */
         uint32_t  DMA90:1;           /* Channel 90 DMA Enable */
         uint32_t  DMA89:1;           /* Channel 89 DMA Enable */
         uint32_t  DMA88:1;           /* Channel 88 DMA Enable */
         uint32_t  DMA87:1;           /* Channel 87 DMA Enable */
         uint32_t  DMA86:1;           /* Channel 86 DMA Enable */
         uint32_t  DMA85:1;           /* Channel 85 DMA Enable */
         uint32_t  DMA84:1;           /* Channel 84 DMA Enable */
         uint32_t  DMA83:1;           /* Channel 83 DMA Enable */
         uint32_t  DMA82:1;           /* Channel 82 DMA Enable */
         uint32_t  DMA81:1;           /* Channel 81 DMA Enable */
         uint32_t  DMA80:1;           /* Channel 80 DMA Enable */
         uint32_t  DMA79:1;           /* Channel 79 DMA Enable */
         uint32_t  DMA78:1;           /* Channel 78 DMA Enable */
         uint32_t  DMA77:1;           /* Channel 77 DMA Enable */
         uint32_t  DMA76:1;           /* Channel 76 DMA Enable */
         uint32_t  DMA75:1;           /* Channel 75 DMA Enable */
         uint32_t  DMA74:1;           /* Channel 74 DMA Enable */
         uint32_t  DMA73:1;           /* Channel 73 DMA Enable */
         uint32_t  DMA72:1;           /* Channel 72 DMA Enable */
         uint32_t  DMA71:1;           /* Channel 71 DMA Enable */
         uint32_t  DMA70:1;           /* Channel 70 DMA Enable */
         uint32_t  DMA69:1;           /* Channel 69 DMA Enable */
         uint32_t  DMA68:1;           /* Channel 68 DMA Enable */
         uint32_t  DMA67:1;           /* Channel 67 DMA Enable */
         uint32_t  DMA66:1;           /* Channel 66 DMA Enable */
         uint32_t  DMA65:1;           /* Channel 65 DMA Enable */
         uint32_t  DMA64:1;           /* Channel 64 DMA Enable */
      } B;
   } ADC_DMAR2_32B_tag;


