RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   /* Register layout for all registers TRC... */

   typedef union {   /* Threshold Control register C */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  THREN:1;           /* Threshold enable */
         uint32_t  THRINV:1;          /* invert the output pin */
         uint32_t  THROP:1;           /* output pin register */
         uint32_t:6;
         uint32_t  THRCH:7;           /* Choose channel for threshold register */
      } B;
   } ADC_TRC_32B_tag;


   /* Register layout for all registers THRHLR... */

   typedef union {   /* Upper Threshold register */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR_32B_tag;


   /* Register layout for all registers THRALT... */

   typedef union {   /* alternate Upper Threshold register */
      uint32_t R;
      struct {
         uint32_t:6;
         uint32_t  THRH:10;           /* high threshold value s */
         uint32_t:6;
         uint32_t  THRL:10;           /* low threshold value s */
      } B;
   } ADC_THRALT_32B_tag;

   typedef union {   /* PRESAMPLING CONTROL REGISTER */
      uint32_t R;
      struct {
         uint32_t:25;
         uint32_t  PREVAL2:2;         /* INternal Voltage selection for Presampling */
         uint32_t  PREVAL1:2;         /* INternal Voltage selection for Presampling */
         uint32_t  PREVAL0:2;         /* INternal Voltage selection for Presampling */
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  PRECONV:1;         /* Presampled value */
#else
         uint32_t  PREONCE:1;           /* deprecated name - please avoid */
#endif
      } B;
   } ADC_PSCR_32B_tag;

   typedef union {   /* Presampling  Register 0 */
      uint32_t R;
      struct {
         uint32_t  PRES31:1;          /* Channel 31 Presampling  Enable */
         uint32_t  PRES30:1;          /* Channel 30 Presampling  Enable */
         uint32_t  PRES29:1;          /* Channel 29 Presampling  Enable */
         uint32_t  PRES28:1;          /* Channel 28 Presampling  Enable */
         uint32_t  PRES27:1;          /* Channel 27 Presampling  Enable */
         uint32_t  PRES26:1;          /* Channel 26 Presampling  Enable */
         uint32_t  PRES25:1;          /* Channel 25 Presampling  Enable */
         uint32_t  PRES24:1;          /* Channel 24 Presampling  Enable */
         uint32_t  PRES23:1;          /* Channel 23 Presampling  Enable */
         uint32_t  PRES22:1;          /* Channel 22 Presampling  Enable */
         uint32_t  PRES21:1;          /* Channel 21 Presampling  Enable */
         uint32_t  PRES20:1;          /* Channel 20 Presampling  Enable */
         uint32_t  PRES19:1;          /* Channel 19 Presampling  Enable */
         uint32_t  PRES18:1;          /* Channel 18 Presampling  Enable */
         uint32_t  PRES17:1;          /* Channel 17 Presampling  Enable */
         uint32_t  PRES16:1;          /* Channel 16 Presampling  Enable */
         uint32_t  PRES15:1;          /* Channel 15   Presampling  Enable */
         uint32_t  PRES14:1;          /* Channel 14   Presampling  Enable */
         uint32_t  PRES13:1;          /* Channel 13  Presampling   Enable */
         uint32_t  PRES12:1;          /* Channel 12   Presampling  Enable */
         uint32_t  PRES11:1;          /* Channel 11   Presampling  Enable */
         uint32_t  PRES10:1;          /* Channel 10  Presampling   Enable */
         uint32_t  PRES9:1;           /* Channel 9 Presampling   Enable */
         uint32_t  PRES8:1;           /* Channel 8 Presampling  Enable */
         uint32_t  PRES7:1;           /* Channel 7 Presampling    Enable */
         uint32_t  PRES6:1;           /* Channel 6 Presampling   Enable */
         uint32_t  PRES5:1;           /* Channel 5 Presampling  Enable */
         uint32_t  PRES4:1;           /* Channel 4 Presampling  Enable */
         uint32_t  PRES3:1;           /* Channel 3 Presampling  Enable */
         uint32_t  PRES2:1;           /* Channel 2 Presampling  Enable */
         uint32_t  PRES1:1;           /* Channel 1presampling  Enable */
         uint32_t  PRES0:1;           /* Channel 0 Presampling  Enable */
      } B;
   } ADC_PSR0_32B_tag;

   typedef union {   /* Presampling REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  PRES63:1;          /* Channel 63 Presampling  Enable */
         uint32_t  PRES62:1;          /* Channel 62 Presampling  Enable */
         uint32_t  PRES61:1;          /* Channel 61 Presampling  Enable */
         uint32_t  PRES60:1;          /* Channel 60 Presampling  Enable */
         uint32_t  PRES59:1;          /* Channel 59 Presampling  Enable */
         uint32_t  PRES58:1;          /* Channel 58 Presampling  Enable */
         uint32_t  PRES57:1;          /* Channel 57 Presampling  Enable */
         uint32_t  PRES56:1;          /* Channel 56 Presampling  Enable */
         uint32_t  PRES55:1;          /* Channel 55 Presampling  Enable */
         uint32_t  PRES54:1;          /* Channel 54 Presampling  Enable */
         uint32_t  PRES53:1;          /* Channel 53 Presampling  Enable */
         uint32_t  PRES52:1;          /* Channel 52 Presampling  Enable */
         uint32_t  PRES51:1;          /* Channel 51 Presampling  Enable */
         uint32_t  PRES50:1;          /* Channel 50 Presampling  Enable */
         uint32_t  PRES49:1;          /* Channel 49 Presampling  Enable */
         uint32_t  PRES48:1;          /* Channel 48 Presampling  Enable */
         uint32_t  PRES47:1;          /* Channel 47 Presampling  Enable */
         uint32_t  PRES46:1;          /* Channel 46 Presampling  Enable */
         uint32_t  PRES45:1;          /* Channel 45 Presampling  Enable */
         uint32_t  PRES44:1;          /* Channel 44 Presampling  Enable */
         uint32_t  PRES43:1;          /* Channel 43 Presampling  Enable */
         uint32_t  PRES42:1;          /* Channel 42 Presampling  Enable */
         uint32_t  PRES41:1;          /* Channel 41 Presampling  Enable */
         uint32_t  PRES40:1;          /* Channel 40 Presampling  Enable */
         uint32_t  PRES39:1;          /* Channel 39 Presampling  Enable */
         uint32_t  PRES38:1;          /* Channel 38 Presampling  Enable */
         uint32_t  PRES37:1;          /* Channel 37 Presampling  Enable */
         uint32_t  PRES36:1;          /* Channel 36 Presampling  Enable */
         uint32_t  PRES35:1;          /* Channel 35 Presampling  Enable */
         uint32_t  PRES34:1;          /* Channel 34 Presampling  Enable */
         uint32_t  PRES33:1;          /* Channel 33 Presampling  Enable */
         uint32_t  PRES32:1;          /* Channel 32 Presampling  Enable */
      } B;
   } ADC_PSR1_32B_tag;

   typedef union {   /* Presampling REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  PRES95:1;          /* Channel 95 Presampling  Enable */
         uint32_t  PRES94:1;          /* Channel 94 Presampling  Enable */
         uint32_t  PRES93:1;          /* Channel 93 Presampling  Enable */
         uint32_t  PRES92:1;          /* Channel 92 Presampling  Enable */
         uint32_t  PRES91:1;          /* Channel 91 Presampling  Enable */
         uint32_t  PRES90:1;          /* Channel 90 Presampling  Enable */
         uint32_t  PRES89:1;          /* Channel 89 Presampling  Enable */
         uint32_t  PRES88:1;          /* Channel 88 Presampling  Enable */
         uint32_t  PRES87:1;          /* Channel 87 Presampling  Enable */
         uint32_t  PRES86:1;          /* Channel 86 Presampling  Enable */
         uint32_t  PRES85:1;          /* Channel 85 Presampling  Enable */
         uint32_t  PRES84:1;          /* Channel 84 Presampling  Enable */
         uint32_t  PRES83:1;          /* Channel 83 Presampling  Enable */
         uint32_t  PRES82:1;          /* Channel 82 Presampling  Enable */
         uint32_t  PRES81:1;          /* Channel 81 Presampling  Enable */
         uint32_t  PRES80:1;          /* Channel 80 Presampling  Enable */
         uint32_t  PRES79:1;          /* Channel 79 Presampling  Enable */
         uint32_t  PRES78:1;          /* Channel 78 Presampling  Enable */
         uint32_t  PRES77:1;          /* Channel 77 Presampling  Enable */
         uint32_t  PRES76:1;          /* Channel 76 Presampling  Enable */
         uint32_t  PRES75:1;          /* Channel 75 Presampling  Enable */
         uint32_t  PRES74:1;          /* Channel 74 Presampling  Enable */
         uint32_t  PRES73:1;          /* Channel 73 Presampling  Enable */
         uint32_t  PRES72:1;          /* Channel 72 Presampling  Enable */
         uint32_t  PRES71:1;          /* Channel 71 Presampling  Enable */
         uint32_t  PRES70:1;          /* Channel 70 Presampling  Enable */
         uint32_t  PRES69:1;          /* Channel 69 Presampling  Enable */
         uint32_t  PRES68:1;          /* Channel 68 Presampling  Enable */
         uint32_t  PRES67:1;          /* Channel 67 Presampling  Enable */
         uint32_t  PRES66:1;          /* Channel 66 Presampling  Enable */
         uint32_t  PRES65:1;          /* Channel 65 Presampling  Enable */
         uint32_t  PRES64:1;          /* Channel 64 Presampling  Enable */
      } B;
   } ADC_PSR2_32B_tag;


   /* Register layout for all registers CTR... */

