RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* conversion timing register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  INPLATCH:1;        /* configuration bits for the LATCHING PHASE duration */
         uint32_t:1;
         uint32_t  OFFSHIFT:2;        /* configuration for offset shift characteristics */
         uint32_t:1;
         uint32_t  INPCMP:2;          /* configuration bits for the COMPARISON duration */
         uint32_t:1;
#ifndef USE_FIELD_ALIASES_ADC
         uint32_t  INSAMP:8;          /* configuration bits for the SAMPLING PHASE duration */
#else		 
         uint32_t  INPSAMP:8;
#endif		 
      } B;
   } ADC_CTR_32B_tag;

   typedef union {   /* NORMAL CONVERSION MASK REGISTER 0 */
      uint32_t R;
      struct {
         uint32_t  CH31:1;            /* Channel 31 Normal Sampling Enable */
         uint32_t  CH30:1;            /* Channel 30 Normal Sampling Enable */
         uint32_t  CH29:1;            /* Channel 29 Normal Sampling Enable */
         uint32_t  CH28:1;            /* Channel 28 Normal Sampling Enable */
         uint32_t  CH27:1;            /* Channel 27 Normal Sampling Enable */
         uint32_t  CH26:1;            /* Channel 26 Normal Sampling Enable */
         uint32_t  CH25:1;            /* Channel 25 Normal Sampling Enable */
         uint32_t  CH24:1;            /* Channel 24 Normal Sampling Enable */
         uint32_t  CH23:1;            /* Channel 23 Normal Sampling Enable */
         uint32_t  CH22:1;            /* Channel 22 Normal Sampling Enable */
         uint32_t  CH21:1;            /* Channel 21 Normal Sampling Enable */
         uint32_t  CH20:1;            /* Channel 20 Normal Sampling Enable */
         uint32_t  CH19:1;            /* Channel 19 Normal Sampling Enable */
         uint32_t  CH18:1;            /* Channel 18 Normal Sampling Enable */
         uint32_t  CH17:1;            /* Channel 17 Normal Sampling Enable */
         uint32_t  CH16:1;            /* Channel 16 Normal Sampling Enable */
         uint32_t  CH15:1;            /* Channel 15 Normal Sampling Enable */
         uint32_t  CH14:1;            /* Channel 14 Normal Sampling Enable */
         uint32_t  CH13:1;            /* Channel 13 Normal Sampling Enable */
         uint32_t  CH12:1;            /* Channel 12 Normal Sampling Enable */
         uint32_t  CH11:1;            /* Channel 11 Normal Sampling Enable */
         uint32_t  CH10:1;            /* Channel 10 Normal Sampling Enable */
         uint32_t  CH9:1;             /* Channel 9 Normal Sampling Enable */
         uint32_t  CH8:1;             /* Channel 8 Normal Sampling Enable */
         uint32_t  CH7:1;             /* Channel 7 Normal Sampling Enable */
         uint32_t  CH6:1;             /* Channel 6 Normal Sampling Enable */
         uint32_t  CH5:1;             /* Channel 5 Normal Sampling Enable */
         uint32_t  CH4:1;             /* Channel 4 Normal Sampling Enable */
         uint32_t  CH3:1;             /* Channel 3 Normal Sampling Enable */
         uint32_t  CH2:1;             /* Channel 2 Normal Sampling Enable */
         uint32_t  CH1:1;             /* Channel 1 Normal Sampling Enable */
         uint32_t  CH0:1;             /* Channel 0 Normal Sampling Enable */
      } B;
   } ADC_NCMR0_32B_tag;

   typedef union {   /* NORMAL CONVERSION MASK REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  CH63:1;            /* Channel 63 Normal Sampling Enable */
         uint32_t  CH62:1;            /* Channel 62 Normal Sampling Enable */
         uint32_t  CH61:1;            /* Channel 61 Normal Sampling Enable */
         uint32_t  CH60:1;            /* Channel 60 Normal Sampling Enable */
         uint32_t  CH59:1;            /* Channel 59 Normal Sampling Enable */
         uint32_t  CH58:1;            /* Channel 58 Normal Sampling Enable */
         uint32_t  CH57:1;            /* Channel 57 Normal Sampling Enable */
         uint32_t  CH56:1;            /* Channel 56 Normal Sampling Enable */
         uint32_t  CH55:1;            /* Channel 55 Normal Sampling Enable */
         uint32_t  CH54:1;            /* Channel 54 Normal Sampling Enable */
         uint32_t  CH53:1;            /* Channel 53 Normal Sampling Enable */
         uint32_t  CH52:1;            /* Channel 52 Normal Sampling Enable */
         uint32_t  CH51:1;            /* Channel 51 Normal Sampling Enable */
         uint32_t  CH50:1;            /* Channel 50 Normal Sampling Enable */
         uint32_t  CH49:1;            /* Channel 49 Normal Sampling Enable */
         uint32_t  CH48:1;            /* Channel 48 Normal Sampling Enable */
         uint32_t  CH47:1;            /* Channel 47 Normal Sampling Enable */
         uint32_t  CH46:1;            /* Channel 46 Normal Sampling Enable */
         uint32_t  CH45:1;            /* Channel 45 Normal Sampling Enable */
         uint32_t  CH44:1;            /* Channel 44 Normal Sampling Enable */
         uint32_t  CH43:1;            /* Channel 43 Normal Sampling Enable */
         uint32_t  CH42:1;            /* Channel 42 Normal Sampling Enable */
         uint32_t  CH41:1;            /* Channel 41 Normal Sampling Enable */
         uint32_t  CH40:1;            /* Channel 40 Normal Sampling Enable */
         uint32_t  CH39:1;            /* Channel 39 Normal Sampling Enable */
         uint32_t  CH38:1;            /* Channel 38 Normal Sampling Enable */
         uint32_t  CH37:1;            /* Channel 37 Normal Sampling Enable */
         uint32_t  CH36:1;            /* Channel 36 Normal Sampling Enable */
         uint32_t  CH35:1;            /* Channel 35 Normal Sampling Enable */
         uint32_t  CH34:1;            /* Channel 34 Normal Sampling Enable */
         uint32_t  CH33:1;            /* Channel 33 Normal Sampling Enable */
         uint32_t  CH32:1;            /* Channel 32 Normal Sampling Enable */
      } B;
   } ADC_NCMR1_32B_tag;

   typedef union {   /* NORMAL CONVERSION MASK REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  CH95:1;            /* Channel 95 Normal Sampling Enable */
         uint32_t  CH94:1;            /* Channel 94 Normal Sampling Enable */
         uint32_t  CH93:1;            /* Channel 93 Normal Sampling Enable */
         uint32_t  CH92:1;            /* Channel 92 Normal Sampling Enable */
         uint32_t  CH91:1;            /* Channel 91 Normal Sampling Enable */
         uint32_t  CH90:1;            /* Channel 90 Normal Sampling Enable */
         uint32_t  CH89:1;            /* Channel 89 Normal Sampling Enable */
         uint32_t  CH88:1;            /* Channel 88 Normal Sampling Enable */
         uint32_t  CH87:1;            /* Channel 87 Normal Sampling Enable */
         uint32_t  CH86:1;            /* Channel 86 Normal Sampling Enable */
         uint32_t  CH85:1;            /* Channel 85 Normal Sampling Enable */
         uint32_t  CH84:1;            /* Channel 84 Normal Sampling Enable */
         uint32_t  CH83:1;            /* Channel 83 Normal Sampling Enable */
         uint32_t  CH82:1;            /* Channel 82 Normal Sampling Enable */
         uint32_t  CH81:1;            /* Channel 81 Normal Sampling Enable */
         uint32_t  CH80:1;            /* Channel 80 Normal Sampling Enable */
         uint32_t  CH79:1;            /* Channel 79 Normal Sampling Enable */
         uint32_t  CH78:1;            /* Channel 78 Normal Sampling Enable */
         uint32_t  CH77:1;            /* Channel 77 Normal Sampling Enable */
         uint32_t  CH76:1;            /* Channel 76 Normal Sampling Enable */
         uint32_t  CH75:1;            /* Channel 75 Normal Sampling Enable */
         uint32_t  CH74:1;            /* Channel 74 Normal Sampling Enable */
         uint32_t  CH73:1;            /* Channel 73 Normal Sampling Enable */
         uint32_t  CH72:1;            /* Channel 72 Normal Sampling Enable */
         uint32_t  CH71:1;            /* Channel 71 Normal Sampling Enable */
         uint32_t  CH70:1;            /* Channel 70 Normal Sampling Enable */
         uint32_t  CH69:1;            /* Channel 69 Normal Sampling Enable */
         uint32_t  CH68:1;            /* Channel 68 Normal Sampling Enable */
         uint32_t  CH67:1;            /* Channel 67 Normal Sampling Enable */
         uint32_t  CH66:1;            /* Channel 66 Normal Sampling Enable */
         uint32_t  CH65:1;            /* Channel 65 Normal Sampling Enable */
         uint32_t  CH64:1;            /* Channel 64 Normal Sampling Enable */
      } B;
   } ADC_NCMR2_32B_tag;

