RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Injected Conversion Mask Register 0 */
      uint32_t R;
      struct {
         uint32_t  CH31:1;            /* Channel 31 Injected Sampling Enable */
         uint32_t  CH30:1;            /* Channel 30 Injected Sampling Enable */
         uint32_t  CH29:1;            /* Channel 29 Injected Sampling Enable */
         uint32_t  CH28:1;            /* Channel 28 Injected Sampling Enable */
         uint32_t  CH27:1;            /* Channel 27 Injected Sampling Enable */
         uint32_t  CH26:1;            /* Channel 26 Injected Sampling Enable */
         uint32_t  CH25:1;            /* Channel 25 Injected Sampling Enable */
         uint32_t  CH24:1;            /* Channel 24 Injected Sampling Enable */
         uint32_t  CH23:1;            /* Channel 23 Injected Sampling Enable */
         uint32_t  CH22:1;            /* Channel 22 Injected Sampling Enable */
         uint32_t  CH21:1;            /* Channel 21 Injected Sampling Enable */
         uint32_t  CH20:1;            /* Channel 20 Injected Sampling Enable */
         uint32_t  CH19:1;            /* Channel 19 Injected Sampling Enable */
         uint32_t  CH18:1;            /* Channel 18 Injected Sampling Enable */
         uint32_t  CH17:1;            /* Channel 17 Injected Sampling Enable */
         uint32_t  CH16:1;            /* Channel 16 Injected Sampling Enable */
         uint32_t  CH15:1;            /* Channel 15   Injected Sampling Enable */
         uint32_t  CH14:1;            /* Channel 14   Injected Sampling Enable */
         uint32_t  CH13:1;            /* Channel 13  Injected  Sampling Enable */
         uint32_t  CH12:1;            /* Channel 12   Injected Sampling Enable */
         uint32_t  CH11:1;            /* Channel 11   Injected Sampling Enable */
         uint32_t  CH10:1;            /* Channel 10  Injected  Sampling Enable */
         uint32_t  CH9:1;             /* Channel 9 Injected  Sampling Enable */
         uint32_t  CH8:1;             /* Channel 8 Injected Sampling Enable */
         uint32_t  CH7:1;             /* Channel 7 Injected   Sampling Enable */
         uint32_t  CH6:1;             /* Channel 6 Injected  Sampling Enable */
         uint32_t  CH5:1;             /* Channel 5 Injected Sampling Enable */
         uint32_t  CH4:1;             /* Channel 4 Injected Sampling Enable */
         uint32_t  CH3:1;             /* Channel 3 Injected Sampling Enable */
         uint32_t  CH2:1;             /* Channel 2 Injected Sampling Enable */
         uint32_t  CH1:1;             /* Channel 1 injected Sampling Enable */
         uint32_t  CH0:1;             /* Channel 0 injected Sampling Enable */
      } B;
   } ADC_JCMR0_32B_tag;

   typedef union {   /* INJECTED CONVERSION MASK REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  CH63:1;            /* Channel 63 Injected Sampling Enable */
         uint32_t  CH62:1;            /* Channel 62 Injected Sampling Enable */
         uint32_t  CH61:1;            /* Channel 61 Injected Sampling Enable */
         uint32_t  CH60:1;            /* Channel 60 Injected Sampling Enable */
         uint32_t  CH59:1;            /* Channel 59 Injected Sampling Enable */
         uint32_t  CH58:1;            /* Channel 58 Injected Sampling Enable */
         uint32_t  CH57:1;            /* Channel 57 Injected Sampling Enable */
         uint32_t  CH56:1;            /* Channel 56 Injected Sampling Enable */
         uint32_t  CH55:1;            /* Channel 55 Injected Sampling Enable */
         uint32_t  CH54:1;            /* Channel 54 Injected Sampling Enable */
         uint32_t  CH53:1;            /* Channel 53 Injected Sampling Enable */
         uint32_t  CH52:1;            /* Channel 52 Injected Sampling Enable */
         uint32_t  CH51:1;            /* Channel 51 Injected Sampling Enable */
         uint32_t  CH50:1;            /* Channel 50 Injected Sampling Enable */
         uint32_t  CH49:1;            /* Channel 49 Injected Sampling Enable */
         uint32_t  CH48:1;            /* Channel 48 Injected Sampling Enable */
         uint32_t  CH47:1;            /* Channel 47 Injected Sampling Enable */
         uint32_t  CH46:1;            /* Channel 46 Injected Sampling Enable */
         uint32_t  CH45:1;            /* Channel 45 Injected Sampling Enable */
         uint32_t  CH44:1;            /* Channel 44 Injected Sampling Enable */
         uint32_t  CH43:1;            /* Channel 43 Injected Sampling Enable */
         uint32_t  CH42:1;            /* Channel 42 Injected Sampling Enable */
         uint32_t  CH41:1;            /* Channel 41 Injected Sampling Enable */
         uint32_t  CH40:1;            /* Channel 40 Injected Sampling Enable */
         uint32_t  CH39:1;            /* Channel 39 Injected Sampling Enable */
         uint32_t  CH38:1;            /* Channel 38 Injected Sampling Enable */
         uint32_t  CH37:1;            /* Channel 37 Injected Sampling Enable */
         uint32_t  CH36:1;            /* Channel 36 Injected Sampling Enable */
         uint32_t  CH35:1;            /* Channel 35 Injected Sampling Enable */
         uint32_t  CH34:1;            /* Channel 34 Injected Sampling Enable */
         uint32_t  CH33:1;            /* Channel 33 Injected Sampling Enable */
         uint32_t  CH32:1;            /* Channel 32 Injected Sampling Enable */
      } B;
   } ADC_JCMR1_32B_tag;

   typedef union {   /* INJECTED CONVERSION MASK REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  CH95:1;            /* Channel 95 Injected Sampling Enable */
         uint32_t  CH94:1;            /* Channel 94 Injected Sampling Enable */
         uint32_t  CH93:1;            /* Channel 93 Injected Sampling Enable */
         uint32_t  CH92:1;            /* Channel 92 Injected Sampling Enable */
         uint32_t  CH91:1;            /* Channel 91 Injected Sampling Enable */
         uint32_t  CH90:1;            /* Channel 90 Injected Sampling Enable */
         uint32_t  CH89:1;            /* Channel 89 Injected Sampling Enable */
         uint32_t  CH88:1;            /* Channel 88 Injected Sampling Enable */
         uint32_t  CH87:1;            /* Channel 87 Injected Sampling Enable */
         uint32_t  CH86:1;            /* Channel 86 Injected Sampling Enable */
         uint32_t  CH85:1;            /* Channel 85 Injected Sampling Enable */
         uint32_t  CH84:1;            /* Channel 84 Injected Sampling Enable */
         uint32_t  CH83:1;            /* Channel 83 Injected Sampling Enable */
         uint32_t  CH82:1;            /* Channel 82 Injected Sampling Enable */
         uint32_t  CH81:1;            /* Channel 81 Injected Sampling Enable */
         uint32_t  CH80:1;            /* Channel 80 Injected Sampling Enable */
         uint32_t  CH79:1;            /* Channel 79 Injected Sampling Enable */
         uint32_t  CH78:1;            /* Channel 78 Injected Sampling Enable */
         uint32_t  CH77:1;            /* Channel 77 Injected Sampling Enable */
         uint32_t  CH76:1;            /* Channel 76 Injected Sampling Enable */
         uint32_t  CH75:1;            /* Channel 75 Injected Sampling Enable */
         uint32_t  CH74:1;            /* Channel 74 Injected Sampling Enable */
         uint32_t  CH73:1;            /* Channel 73 Injected Sampling Enable */
         uint32_t  CH72:1;            /* Channel 72 Injected Sampling Enable */
         uint32_t  CH71:1;            /* Channel 71 Injected Sampling Enable */
         uint32_t  CH70:1;            /* Channel 70 Injected Sampling Enable */
         uint32_t  CH69:1;            /* Channel 69 Injected Sampling Enable */
         uint32_t  CH68:1;            /* Channel 68 Injected Sampling Enable */
         uint32_t  CH67:1;            /* Channel 67 Injected Sampling Enable */
         uint32_t  CH66:1;            /* Channel 66 Injected Sampling Enable */
         uint32_t  CH65:1;            /* Channel 65 Injected Sampling Enable */
         uint32_t  CH64:1;            /* Channel 64 Injected Sampling Enable */
      } B;
   } ADC_JCMR2_32B_tag;

   typedef union {   /* Offset Word Regsiter */
      uint32_t R;
      struct {
         uint32_t:15;
         uint32_t  OFFSETLOAD:1;      /* load_offset */
         uint32_t:8;
#ifndef USE_FIELD_ALIASES_ADC		 
         uint32_t  OFFSET_WORD:8;     /* OFFSET word coeff.generated at the end of offset cancellation is lathed int o this register */
#else		
         uint32_t  OFFSETWORD:8;  
#endif		 
      } B;
   } ADC_OFFWR_32B_tag;

