RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Decode Signal Delay Register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  DSD:8;             /* take into account the settling time of the external mux */
      } B;
   } ADC_DSDR_32B_tag;

   typedef union {   /* Power Down Dealy Register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  PDED:8;            /* The delay between the power down bit reset and the starting of conversion */
      } B;
   } ADC_PDEDR_32B_tag;


   /* Register layout for all registers CDR... */

   typedef union {   /* CHANNEL DATA REGS */
      uint32_t R;
      struct {
         uint32_t:12;
         uint32_t  VALID:1;           /* validity of data */
         uint32_t  OVERW:1;           /* overwrite data */
         uint32_t  RESULT:2;          /* reflects mode conversion */
         uint32_t:6;
         uint32_t  CDATA:10;          /* Channel 0 converted data */
      } B;
   } ADC_CDR_32B_tag;

   typedef union {   /* Upper Threshold register 4 is not contiguous to 3 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR4_32B_tag;

   typedef union {   /* Upper Threshold register 5 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR5_32B_tag;

   typedef union {   /* Upper Threshold register 6 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR6_32B_tag;

   typedef union {   /* Upper Threshold register 7 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR7_32B_tag;

   typedef union {   /* Upper Threshold register 8 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR8_32B_tag;

   typedef union {   /* Upper Threshold register 9 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR9_32B_tag;

   typedef union {   /* Upper Threshold register 10 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR10_32B_tag;

   typedef union {   /* Upper Threshold register 11 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR11_32B_tag;

   typedef union {   /* Upper Threshold register 12 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR12_32B_tag;

   typedef union {   /* Upper Threshold register 13 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR13_32B_tag;

   typedef union {   /* Upper Threshold register 14 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR14_32B_tag;

   typedef union {   /* Upper Threshold register 15 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* high threshold value s */
         uint32_t:4;
         uint32_t  THRL:12;           /* low threshold value s */
      } B;
   } ADC_THRHLR15_32B_tag;


   /* Register layout for all registers CWSELR... */

   typedef union {   /* Channel Watchdog Select register */
      uint32_t R;
      struct {
         uint32_t  WSEL_CH7:4;        /* Channel Watchdog select for channel 7+R*8 */
         uint32_t  WSEL_CH6:4;        /* Channel Watchdog select for channel 6+R*8 */
         uint32_t  WSEL_CH5:4;        /* Channel Watchdog select for channel 5+R*8 */
         uint32_t  WSEL_CH4:4;        /* Channel Watchdog select for channel 4+R*8 */
         uint32_t  WSEL_CH3:4;        /* Channel Watchdog select for channel 3+R*8 */
         uint32_t  WSEL_CH2:4;        /* Channel Watchdog select for channel 2+R*8 */
         uint32_t  WSEL_CH1:4;        /* Channel Watchdog select for channel 1+R*8 */
         uint32_t  WSEL_CH0:4;        /* Channel Watchdog select for channel 0+R*8 */
      } B;
   } ADC_CWSELR_32B_tag;


   /* Register layout for all registers CWENR... */

   typedef union {   /* Channel Watchdog Enable Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  CWEN15PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN14PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN13PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN12PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN11PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN10PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN09PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN08PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN07PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN06PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN05PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN04PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN03PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN02PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN01PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
         uint32_t  CWEN00PRT32:1;     /* Channel Watchdog Enable 0+R*32 */
      } B;
   } ADC_CWENR_32B_tag;


   /* Register layout for all registers AWORR... */

   typedef union {   /* Analog Watchdog Out of Range Register */
      uint32_t R;
      struct {
         uint32_t  AWOR_CH31:1;       /* Channel 31+R*32 converted data out of range */
         uint32_t  AWOR_CH30:1;       /* Channel 30+R*32 converted data out of range */
         uint32_t  AWOR_CH29:1;       /* Channel 29+R*32 converted data out of range */
         uint32_t  AWOR_CH28:1;       /* Channel 28+R*32 converted data out of range */
         uint32_t  AWOR_CH27:1;       /* Channel 27+R*32 converted data out of range */
         uint32_t  AWOR_CH26:1;       /* Channel 26+R*32 converted data out of range */
         uint32_t  AWOR_CH25:1;       /* Channel 25+R*32 converted data out of range */
         uint32_t  AWOR_CH24:1;       /* Channel 24+R*32 converted data out of range */
         uint32_t  AWOR_CH23:1;       /* Channel 23+R*32 converted data out of range */
         uint32_t  AWOR_CH22:1;       /* Channel 22+R*32 converted data out of range */
         uint32_t  AWOR_CH21:1;       /* Channel 21+R*32 converted data out of range */
         uint32_t  AWOR_CH20:1;       /* Channel 20+R*32 converted data out of range */
         uint32_t  AWOR_CH19:1;       /* Channel 19+R*32 converted data out of range */
         uint32_t  AWOR_CH18:1;       /* Channel 18+R*32 converted data out of range */
         uint32_t  AWOR_CH17:1;       /* Channel 17+R*32 converted data out of range */
         uint32_t  AWOR_CH16:1;       /* Channel 16+R*32 converted data out of range */
         uint32_t  AWOR_CH15:1;       /* Channel 15+R*32 converted data out of range */
         uint32_t  AWOR_CH14:1;       /* Channel 14+R*32 converted data out of range */
         uint32_t  AWOR_CH13:1;       /* Channel 13+R*32 converted data out of range */
         uint32_t  AWOR_CH12:1;       /* Channel 12+R*32 converted data out of range */
         uint32_t  AWOR_CH11:1;       /* Channel 11+R*32 converted data out of range */
         uint32_t  AWOR_CH10:1;       /* Channel 10+R*32 converted data out of range */
         uint32_t  AWOR_CH9:1;        /* Channel 9+R*32 converted data out of range */
         uint32_t  AWOR_CH8:1;        /* Channel 8+R*32 converted data out of range */
         uint32_t  AWOR_CH7:1;        /* Channel 7+R*32 converted data out of range */
         uint32_t  AWOR_CH6:1;        /* Channel 6+R*32 converted data out of range */
         uint32_t  AWOR_CH5:1;        /* Channel 5+R*32 converted data out of range */
         uint32_t  AWOR_CH4:1;        /* Channel 4+R*32 converted data out of range */
         uint32_t  AWOR_CH3:1;        /* Channel 3+R*32 converted data out of range */
         uint32_t  AWOR_CH2:1;        /* Channel 2+R*32 converted data out of range */
         uint32_t  AWOR_CH1:1;        /* Channel 1+R*32 converted data out of range */
         uint32_t  AWOR_CH0:1;        /* Channel 0+R*32 converted data out of range */
      } B;
   } ADC_AWORR_32B_tag;

