RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* SELF TEST CONFIGURATION REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t  INPSAMP_C:8;       /* Sampling phase duration for the test conversions - algorithm C */
         uint32_t  INPSAMP_RC:8;      /* Sampling phase duration for the test conversions - algorithm RC */
         uint32_t  INPSAMP_S:8;       /* Sampling phase duration for the test conversions - algorithm S */
         uint32_t:5;
         uint32_t  ST_INPCMP:2;       /* Configuration bit for comparison phase duration for self test channel */
         uint32_t  ST_INPLATCH:1;     /* Configuration bit for Latching phase duration for self test channel */
      } B;
   } ADC_STCR1_32B_tag;

   typedef union {   /* SELF TEST CONFIGURATION REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t:5;
         uint32_t  SERR:1;            /* Error fault injection bit (write only) */
         uint32_t  MSKSTWDTERR:1;     /* Interrupt enable (STSR2.WDTERR status bit) */
         uint32_t:1;
         uint32_t  MSKST_EOC:1;       /* Interrupt enable bit for STSR2.ST_EOC */
         uint32_t:4;
         uint32_t  MSKWDG_EOA_C:1;    /* Interrupt enable (WDG_EOA_C status bit) */
         uint32_t  MSKWDG_EOA_RC:1;   /* Interrupt enable (WDG_EOA_RC status bit) */
         uint32_t  MSKWDG_EOA_S:1;    /* Interrupt enable (WDG_EOA_S status bit) */
         uint32_t  MSKERR_C:1;        /* Interrupt enable (ERR_C status bit) */
         uint32_t  MSKERR_RC:1;       /* Interrupt enable (ERR_RC status bit) */
         uint32_t  MSKERR_S2:1;       /* Interrupt enable (ERR_S2 status bit) */
         uint32_t  MSKERR_S1:1;       /* Interrupt enable (ERR_S1 status bit) */
         uint32_t  MSKERR_S0:1;       /* Interrupt enable (ERR_S0 status bit) */
         uint32_t:3;
         uint32_t  EN:1;              /* Self testing channel enable */
         uint32_t:4;
         uint32_t  FMA_C:1;           /* Fault mapping for the algorithm C */
         uint32_t  FMAR_C:1;          /* Fault mapping for the algorithm RC */
         uint32_t  FMA_S:1;           /* Fault mapping for the algorithm BGAP */
      } B;
   } ADC_STCR2_32B_tag;

   typedef union {   /* SELF TEST CONFIGURATION REGISTER 3 */
      uint32_t R;
      struct {
         uint32_t:22;
         uint32_t  ALG:2;             /* Algorithm scheduling */
         uint32_t:8;
      } B;
   } ADC_STCR3_32B_tag;

   typedef union {   /* SELF TEST BAUD RATE REGISTER */
      uint32_t R;
      struct {
         uint32_t:13;
         uint32_t  WDT:3;             /* Watchdog timer value */
         uint32_t:8;
         uint32_t  BR:8;              /* Baud rate for the selected algorithm in SCAN mode */
      } B;
   } ADC_STBRR_32B_tag;

   typedef union {   /* SELF TEST STATUS REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t:6;
         uint32_t  WDTERR:1;          /* Watchdog timer error */
         uint32_t  OVERWR:1;          /* Overwrite error */
         uint32_t  ST_EOC:1;          /* Self test EOC bit */
         uint32_t:4;
         uint32_t  WDG_EOA_C:1;       /* Algorithm  C completed without error */
         uint32_t  WDG_EOA_RC:1;      /* Algorithm RC completed without error */
         uint32_t  WDG_EOA_S:1;       /* Algorithm  S completed without error */
         uint32_t  ERR_C:1;           /* Error on the self testing channel (algorithm  C) */
         uint32_t  ERR_RC:1;          /* Error on the self testing channel (algorithm RC) */
         uint32_t  ERR_S2:1;          /* Error on the self testing channel (algorithm SUPPLY, step 2) */
         uint32_t  ERR_S1:1;          /* Error on the self testing channel (algorithm SUPPLY, step 1) */
         uint32_t  ERR_S0:1;          /* Error on the self testing channel (algorithm SUPPLY, step 0) */
         uint32_t:1;
         uint32_t  STEP_C:5;          /* Step of algorithm  C when ERR_C  has occurred */
         uint32_t  STEP_RC:5;         /* Step of algorithm RC when ERR_RC has occurred */
      } B;
   } ADC_STSR1_32B_tag;

   typedef union {   /* SELF TEST STATUS REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  OVFL:1;            /* Overflow bit */
         uint32_t:3;
         uint32_t  DATA1:12;          /* Test channel converted data when ERR_S1 has occurred */
         uint32_t:4;
         uint32_t  DATA0:12;          /* Test channel converted data when ERR_S1 has occurred */
      } B;
   } ADC_STSR2_32B_tag;

   typedef union {   /* SELF TEST STATUS REGISTER 3 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  DATA1:12;          /* Test channel converted data when ERR_S0 has occurred */
         uint32_t:4;
         uint32_t  DATA0:12;          /* Test channel converted data when ERR_S0 has occurred */
      } B;
   } ADC_STSR3_32B_tag;

   typedef union {   /* SELF TEST STATUS REGISTER 4 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  DATA1:12;          /* Test channel converted data when ERR_C has occurred */
         uint32_t:4;
         uint32_t  DATA0:12;          /* Test channel converted data when ERR_C has occurred */
      } B;
   } ADC_STSR4_32B_tag;

   typedef union {   /* SELF TEST DATA REGISTER 1 */
      uint32_t R;
      struct {
         uint32_t:12;
         uint32_t  VALID:1;           /* Valid data */
         uint32_t  OVERWR:1;          /* Overwrite data */
         uint32_t:6;
         uint32_t  TCDATA:12;         /* Test channel converted data */
      } B;
   } ADC_STDR1_32B_tag;

   typedef union {   /* SELF TEST DATA REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  FDATA:12;          /* Fractional part of the ratio TEST for algorithm S */
         uint32_t  VALID:1;           /* Valid data */
         uint32_t  OVERWR:1;          /* Overwrite data */
         uint32_t:6;
         uint32_t  IDATA:12;          /* Integer part of the ratio TEST for algorithm S */
      } B;
   } ADC_STDR2_32B_tag;

   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 0 */
      uint32_t R;
      struct {
         uint32_t  AWDE:1;            /* Analog WatchDog Enable - algorithm S */
         uint32_t  WDTE:1;            /* WatchDog Timer Enable - algorithm S */
         uint32_t:2;
         uint32_t  THRH:12;           /* High threshold value for channel 0 */
         uint32_t:4;
         uint32_t  THRL:12;           /* Low threshold value for channel 0 */
      } B;
   } ADC_STAW0R_32B_tag;

