RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 1A */
      uint32_t R;
      struct {
         uint32_t  AWDE:1;            /* Analog WatchDog Enable - algorithm S */
         uint32_t:3;
         uint32_t  THRH:12;           /* High threshold value for test channel - algorithm S */
         uint32_t:4;
         uint32_t  THRL:12;           /* Low threshold value for test channel - algorithm S */
      } B;
   } ADC_STAW1AR_32B_tag;

   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 1B */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* High threshold value for test channel - algorithm S */
         uint32_t:4;
         uint32_t  THRL:12;           /* Low threshold value for test channel - algorithm S */
      } B;
   } ADC_STAW1BR_32B_tag;

   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 2 */
      uint32_t R;
      struct {
         uint32_t  AWDE:1;            /* Analog WatchDog Enable - algorithm S */
         uint32_t:19;
         uint32_t  THRL:12;           /* Low threshold value for channel */
      } B;
   } ADC_STAW2R_32B_tag;

   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 3 */
      uint32_t R;
      struct {
         uint32_t  AWDE:1;            /* Analog WatchDog Enable - algorithm RC */
         uint32_t  WDTE:1;            /* WatchDog Timer Enable - algorithm RC */
         uint32_t:2;
         uint32_t  THRH:12;           /* High threshold value for channel 3 */
         uint32_t:4;
         uint32_t  THRL:12;           /* Low threshold value for channel 3 */
      } B;
   } ADC_STAW3R_32B_tag;

   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 4 */
      uint32_t R;
      struct {
         uint32_t  AWDE:1;            /* Analog WatchDog Enable - algorithm C */
         uint32_t  WDTE:1;            /* WatchDog Timer Enable - algorithm C */
         uint32_t:2;
         uint32_t  THRH:12;           /* High threshold value for channel 4 */
         uint32_t:4;
         uint32_t  THRL:12;           /* Low threshold value for channel 4 */
      } B;
   } ADC_STAW4R_32B_tag;

   typedef union {   /* SELF TEST ANALOG WATCHDOG REGISTER 5 */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  THRH:12;           /* High threshold value for algorithm C */
         uint32_t:4;
         uint32_t  THRL:12;           /* Low threshold value for algorithm C */
      } B;
   } ADC_STAW5R_32B_tag;



   typedef struct ADC_struct_tag { /* start of ADC_tag */
                                        /* module configuration register */
      ADC_MCR_32B_tag MCR;                 /* offset: 0x0000 size: 32 bit */
                                               /* module status register */
      ADC_MSR_32B_tag MSR;                 /* offset: 0x0004 size: 32 bit */
      int8_t ADC_reserved_0008[8];
                                            /* Interrupt status register */
      ADC_ISR_32B_tag ISR;                 /* offset: 0x0010 size: 32 bit */
      union {
         ADC_CEOCFR0_32B_tag CEOCFR[3];    /* offset: 0x0014  (0x0004 x 3) */

         struct {
                                           /* CHANNEL PENDING REGISTER 0 */
            ADC_CEOCFR0_32B_tag CEOCFR0;   /* offset: 0x0014 size: 32 bit */
                                           /* CHANNEL PENDING REGISTER 1 */
            ADC_CEOCFR1_32B_tag CEOCFR1;   /* offset: 0x0018 size: 32 bit */
                                           /* CHANNEL PENDING REGISTER 2 */
            ADC_CEOCFR2_32B_tag CEOCFR2;   /* offset: 0x001C size: 32 bit */
         };

      };
                                              /* interrupt mask register */
      ADC_IMR_32B_tag IMR;                 /* offset: 0x0020 size: 32 bit */
      union {
         ADC_CIMR0_32B_tag CIMR[3];        /* offset: 0x0024  (0x0004 x 3) */

         struct {
                                    /* CHANNEL INTERRUPT MASK REGISTER 0 */
            ADC_CIMR0_32B_tag CIMR0;       /* offset: 0x0024 size: 32 bit */
                                    /* CHANNEL INTERRUPT MASK REGISTER 1 */
            ADC_CIMR1_32B_tag CIMR1;       /* offset: 0x0028 size: 32 bit */
                                    /* CHANNEL INTERRUPT MASK REGISTER 2 */
            ADC_CIMR2_32B_tag CIMR2;       /* offset: 0x002C size: 32 bit */
         };

      };
                         /* Watchdog Threshold interrupt status register */
      ADC_WTISR_32B_tag WTISR;             /* offset: 0x0030 size: 32 bit */
                                     /* Watchdog interrupt MASK register */
      ADC_WTIMR_32B_tag WTIMR;             /* offset: 0x0034 size: 32 bit */
      int8_t ADC_reserved_0038[8];
                                                        /* DMAE register */
      ADC_DMAE_32B_tag DMAE;               /* offset: 0x0040 size: 32 bit */
      union {
         ADC_DMAR0_32B_tag DMAR[3];        /* offset: 0x0044  (0x0004 x 3) */

         struct {
                                                      /* DMA  REGISTER 0 */
            ADC_DMAR0_32B_tag DMAR0;       /* offset: 0x0044 size: 32 bit */
                                                       /* DMA REGISTER 1 */
            ADC_DMAR1_32B_tag DMAR1;       /* offset: 0x0048 size: 32 bit */
                                                       /* DMA REGISTER 2 */
            ADC_DMAR2_32B_tag DMAR2;       /* offset: 0x004C size: 32 bit */
         };

      };
      union {
                                         /* Threshold Control register C */
         ADC_TRC_32B_tag TRC[4];           /* offset: 0x0050  (0x0004 x 4) */

         struct {
                                         /* Threshold Control register C */
            ADC_TRC_32B_tag TRC0;          /* offset: 0x0050 size: 32 bit */
            ADC_TRC_32B_tag TRC1;          /* offset: 0x0054 size: 32 bit */
            ADC_TRC_32B_tag TRC2;          /* offset: 0x0058 size: 32 bit */
            ADC_TRC_32B_tag TRC3;          /* offset: 0x005C size: 32 bit */
         };

