RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
                                             /* Upper Threshold register */
         ADC_THRHLR_32B_tag THRHLR[4];     /* offset: 0x0060  (0x0004 x 4) */

         struct {
                                             /* Upper Threshold register */
            ADC_THRHLR_32B_tag THRHLR0;    /* offset: 0x0060 size: 32 bit */
            ADC_THRHLR_32B_tag THRHLR1;    /* offset: 0x0064 size: 32 bit */
            ADC_THRHLR_32B_tag THRHLR2;    /* offset: 0x0068 size: 32 bit */
            ADC_THRHLR_32B_tag THRHLR3;    /* offset: 0x006C size: 32 bit */
         };

      };
      union {
                                   /* alternate Upper Threshold register */
         ADC_THRALT_32B_tag THRALT[4];     /* offset: 0x0070  (0x0004 x 4) */

         struct {
                                   /* alternate Upper Threshold register */
            ADC_THRALT_32B_tag THRALT0;    /* offset: 0x0070 size: 32 bit */
            ADC_THRALT_32B_tag THRALT1;    /* offset: 0x0074 size: 32 bit */
            ADC_THRALT_32B_tag THRALT2;    /* offset: 0x0078 size: 32 bit */
            ADC_THRALT_32B_tag THRALT3;    /* offset: 0x007C size: 32 bit */
         };

      };
                                         /* PRESAMPLING CONTROL REGISTER */
      ADC_PSCR_32B_tag PSCR;               /* offset: 0x0080 size: 32 bit */
      union {
         ADC_PSR0_32B_tag PSR[3];          /* offset: 0x0084  (0x0004 x 3) */

         struct {
                                              /* Presampling  Register 0 */
            ADC_PSR0_32B_tag PSR0;         /* offset: 0x0084 size: 32 bit */
                                               /* Presampling REGISTER 1 */
            ADC_PSR1_32B_tag PSR1;         /* offset: 0x0088 size: 32 bit */
                                               /* Presampling REGISTER 2 */
            ADC_PSR2_32B_tag PSR2;         /* offset: 0x008C size: 32 bit */
         };

      };
      int8_t ADC_reserved_0090_C[4];
      union {
                                           /* conversion timing register */
         ADC_CTR_32B_tag CTR[3];           /* offset: 0x0094  (0x0004 x 3) */

         struct {
                                           /* conversion timing register */
            ADC_CTR_32B_tag CTR0;          /* offset: 0x0094 size: 32 bit */
            ADC_CTR_32B_tag CTR1;          /* offset: 0x0098 size: 32 bit */
            ADC_CTR_32B_tag CTR2;          /* offset: 0x009C size: 32 bit */
         };

      };
      int8_t ADC_reserved_00A0_C[4];
      union {
         ADC_NCMR0_32B_tag NCMR[3];        /* offset: 0x00A4  (0x0004 x 3) */

         struct {
                                    /* NORMAL CONVERSION MASK REGISTER 0 */
            ADC_NCMR0_32B_tag NCMR0;       /* offset: 0x00A4 size: 32 bit */
                                    /* NORMAL CONVERSION MASK REGISTER 1 */
            ADC_NCMR1_32B_tag NCMR1;       /* offset: 0x00A8 size: 32 bit */
                                    /* NORMAL CONVERSION MASK REGISTER 2 */
            ADC_NCMR2_32B_tag NCMR2;       /* offset: 0x00AC size: 32 bit */
         };

      };
      int8_t ADC_reserved_00B0_C[4];
      union {
         ADC_JCMR0_32B_tag JCMR[3];        /* offset: 0x00B4  (0x0004 x 3) */

         struct {
                                  /* Injected Conversion Mask Register 0 */
            ADC_JCMR0_32B_tag JCMR0;       /* offset: 0x00B4 size: 32 bit */
                                  /* INJECTED CONVERSION MASK REGISTER 1 */
            ADC_JCMR1_32B_tag JCMR1;       /* offset: 0x00B8 size: 32 bit */
                                  /* INJECTED CONVERSION MASK REGISTER 2 */
            ADC_JCMR2_32B_tag JCMR2;       /* offset: 0x00BC size: 32 bit */
         };

      };
                                                 /* Offset Word Regsiter */
      ADC_OFFWR_32B_tag OFFWR;             /* offset: 0x00C0 size: 32 bit */
                                         /* Decode Signal Delay Register */
      ADC_DSDR_32B_tag DSDR;               /* offset: 0x00C4 size: 32 bit */
                                            /* Power Down Dealy Register */
      ADC_PDEDR_32B_tag PDEDR;             /* offset: 0x00C8 size: 32 bit */
      int8_t ADC_reserved_00CC_C[52];
      union {
                                                    /* CHANNEL DATA REGS */
         ADC_CDR_32B_tag CDR[96];          /* offset: 0x0100  (0x0004 x 96) */

         struct {
                                                    /* CHANNEL DATA REGS */
            ADC_CDR_32B_tag CDR0;          /* offset: 0x0100 size: 32 bit */
            ADC_CDR_32B_tag CDR1;          /* offset: 0x0104 size: 32 bit */
            ADC_CDR_32B_tag CDR2;          /* offset: 0x0108 size: 32 bit */
            ADC_CDR_32B_tag CDR3;          /* offset: 0x010C size: 32 bit */
            ADC_CDR_32B_tag CDR4;          /* offset: 0x0110 size: 32 bit */
            ADC_CDR_32B_tag CDR5;          /* offset: 0x0114 size: 32 bit */
            ADC_CDR_32B_tag CDR6;          /* offset: 0x0118 size: 32 bit */
            ADC_CDR_32B_tag CDR7;          /* offset: 0x011C size: 32 bit */
            ADC_CDR_32B_tag CDR8;          /* offset: 0x0120 size: 32 bit */
            ADC_CDR_32B_tag CDR9;          /* offset: 0x0124 size: 32 bit */
            ADC_CDR_32B_tag CDR10;         /* offset: 0x0128 size: 32 bit */
            ADC_CDR_32B_tag CDR11;         /* offset: 0x012C size: 32 bit */
            ADC_CDR_32B_tag CDR12;         /* offset: 0x0130 size: 32 bit */
            ADC_CDR_32B_tag CDR13;         /* offset: 0x0134 size: 32 bit */
            ADC_CDR_32B_tag CDR14;         /* offset: 0x0138 size: 32 bit */
            ADC_CDR_32B_tag CDR15;         /* offset: 0x013C size: 32 bit */
            ADC_CDR_32B_tag CDR16;         /* offset: 0x0140 size: 32 bit */
            ADC_CDR_32B_tag CDR17;         /* offset: 0x0144 size: 32 bit */
            ADC_CDR_32B_tag CDR18;         /* offset: 0x0148 size: 32 bit */
            ADC_CDR_32B_tag CDR19;         /* offset: 0x014C size: 32 bit */
            ADC_CDR_32B_tag CDR20;         /* offset: 0x0150 size: 32 bit */
            ADC_CDR_32B_tag CDR21;         /* offset: 0x0154 size: 32 bit */
            ADC_CDR_32B_tag CDR22;         /* offset: 0x0158 size: 32 bit */
            ADC_CDR_32B_tag CDR23;         /* offset: 0x015C size: 32 bit */
            ADC_CDR_32B_tag CDR24;         /* offset: 0x0160 size: 32 bit */
            ADC_CDR_32B_tag CDR25;         /* offset: 0x0164 size: 32 bit */
            ADC_CDR_32B_tag CDR26;         /* offset: 0x0168 size: 32 bit */
            ADC_CDR_32B_tag CDR27;         /* offset: 0x016C size: 32 bit */
            ADC_CDR_32B_tag CDR28;         /* offset: 0x0170 size: 32 bit */
            ADC_CDR_32B_tag CDR29;         /* offset: 0x0174 size: 32 bit */
            ADC_CDR_32B_tag CDR30;         /* offset: 0x0178 size: 32 bit */
            ADC_CDR_32B_tag CDR31;         /* offset: 0x017C size: 32 bit */
            ADC_CDR_32B_tag CDR32;         /* offset: 0x0180 size: 32 bit */
            ADC_CDR_32B_tag CDR33;         /* offset: 0x0184 size: 32 bit */
            ADC_CDR_32B_tag CDR34;         /* offset: 0x0188 size: 32 bit */
            ADC_CDR_32B_tag CDR35;         /* offset: 0x018C size: 32 bit */
            ADC_CDR_32B_tag CDR36;         /* offset: 0x0190 size: 32 bit */
            ADC_CDR_32B_tag CDR37;         /* offset: 0x0194 size: 32 bit */
            ADC_CDR_32B_tag CDR38;         /* offset: 0x0198 size: 32 bit */
            ADC_CDR_32B_tag CDR39;         /* offset: 0x019C size: 32 bit */
            ADC_CDR_32B_tag CDR40;         /* offset: 0x01A0 size: 32 bit */
            ADC_CDR_32B_tag CDR41;         /* offset: 0x01A4 size: 32 bit */
            ADC_CDR_32B_tag CDR42;         /* offset: 0x01A8 size: 32 bit */
            ADC_CDR_32B_tag CDR43;         /* offset: 0x01AC size: 32 bit */
            ADC_CDR_32B_tag CDR44;         /* offset: 0x01B0 size: 32 bit */
            ADC_CDR_32B_tag CDR45;         /* offset: 0x01B4 size: 32 bit */
            ADC_CDR_32B_tag CDR46;         /* offset: 0x01B8 size: 32 bit */
            ADC_CDR_32B_tag CDR47;         /* offset: 0x01BC size: 32 bit */
            ADC_CDR_32B_tag CDR48;         /* offset: 0x01C0 size: 32 bit */
            ADC_CDR_32B_tag CDR49;         /* offset: 0x01C4 size: 32 bit */
            ADC_CDR_32B_tag CDR50;         /* offset: 0x01C8 size: 32 bit */
            ADC_CDR_32B_tag CDR51;         /* offset: 0x01CC size: 32 bit */
            ADC_CDR_32B_tag CDR52;         /* offset: 0x01D0 size: 32 bit */
            ADC_CDR_32B_tag CDR53;         /* offset: 0x01D4 size: 32 bit */
            ADC_CDR_32B_tag CDR54;         /* offset: 0x01D8 size: 32 bit */
            ADC_CDR_32B_tag CDR55;         /* offset: 0x01DC size: 32 bit */
            ADC_CDR_32B_tag CDR56;         /* offset: 0x01E0 size: 32 bit */
            ADC_CDR_32B_tag CDR57;         /* offset: 0x01E4 size: 32 bit */
            ADC_CDR_32B_tag CDR58;         /* offset: 0x01E8 size: 32 bit */
            ADC_CDR_32B_tag CDR59;         /* offset: 0x01EC size: 32 bit */
            ADC_CDR_32B_tag CDR60;         /* offset: 0x01F0 size: 32 bit */
            ADC_CDR_32B_tag CDR61;         /* offset: 0x01F4 size: 32 bit */
            ADC_CDR_32B_tag CDR62;         /* offset: 0x01F8 size: 32 bit */
            ADC_CDR_32B_tag CDR63;         /* offset: 0x01FC size: 32 bit */
            ADC_CDR_32B_tag CDR64;         /* offset: 0x0200 size: 32 bit */
            ADC_CDR_32B_tag CDR65;         /* offset: 0x0204 size: 32 bit */
            ADC_CDR_32B_tag CDR66;         /* offset: 0x0208 size: 32 bit */
            ADC_CDR_32B_tag CDR67;         /* offset: 0x020C size: 32 bit */
            ADC_CDR_32B_tag CDR68;         /* offset: 0x0210 size: 32 bit */
            ADC_CDR_32B_tag CDR69;         /* offset: 0x0214 size: 32 bit */
            ADC_CDR_32B_tag CDR70;         /* offset: 0x0218 size: 32 bit */
            ADC_CDR_32B_tag CDR71;         /* offset: 0x021C size: 32 bit */
            ADC_CDR_32B_tag CDR72;         /* offset: 0x0220 size: 32 bit */
            ADC_CDR_32B_tag CDR73;         /* offset: 0x0224 size: 32 bit */
            ADC_CDR_32B_tag CDR74;         /* offset: 0x0228 size: 32 bit */
            ADC_CDR_32B_tag CDR75;         /* offset: 0x022C size: 32 bit */
            ADC_CDR_32B_tag CDR76;         /* offset: 0x0230 size: 32 bit */
            ADC_CDR_32B_tag CDR77;         /* offset: 0x0234 size: 32 bit */
            ADC_CDR_32B_tag CDR78;         /* offset: 0x0238 size: 32 bit */
            ADC_CDR_32B_tag CDR79;         /* offset: 0x023C size: 32 bit */
            ADC_CDR_32B_tag CDR80;         /* offset: 0x0240 size: 32 bit */
            ADC_CDR_32B_tag CDR81;         /* offset: 0x0244 size: 32 bit */
            ADC_CDR_32B_tag CDR82;         /* offset: 0x0248 size: 32 bit */
            ADC_CDR_32B_tag CDR83;         /* offset: 0x024C size: 32 bit */
            ADC_CDR_32B_tag CDR84;         /* offset: 0x0250 size: 32 bit */
            ADC_CDR_32B_tag CDR85;         /* offset: 0x0254 size: 32 bit */
            ADC_CDR_32B_tag CDR86;         /* offset: 0x0258 size: 32 bit */
            ADC_CDR_32B_tag CDR87;         /* offset: 0x025C size: 32 bit */
            ADC_CDR_32B_tag CDR88;         /* offset: 0x0260 size: 32 bit */
            ADC_CDR_32B_tag CDR89;         /* offset: 0x0264 size: 32 bit */
            ADC_CDR_32B_tag CDR90;         /* offset: 0x0268 size: 32 bit */
            ADC_CDR_32B_tag CDR91;         /* offset: 0x026C size: 32 bit */
            ADC_CDR_32B_tag CDR92;         /* offset: 0x0270 size: 32 bit */
            ADC_CDR_32B_tag CDR93;         /* offset: 0x0274 size: 32 bit */
            ADC_CDR_32B_tag CDR94;         /* offset: 0x0278 size: 32 bit */
            ADC_CDR_32B_tag CDR95;         /* offset: 0x027C size: 32 bit */
         };

