RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
                    /* Upper Threshold register 4 is not contiguous to 3 */
      ADC_THRHLR4_32B_tag THRHLR4;         /* offset: 0x0280 size: 32 bit */
                                           /* Upper Threshold register 5 */
      ADC_THRHLR5_32B_tag THRHLR5;         /* offset: 0x0284 size: 32 bit */
                                           /* Upper Threshold register 6 */
      ADC_THRHLR6_32B_tag THRHLR6;         /* offset: 0x0288 size: 32 bit */
                                           /* Upper Threshold register 7 */
      ADC_THRHLR7_32B_tag THRHLR7;         /* offset: 0x028C size: 32 bit */
                                           /* Upper Threshold register 8 */
      ADC_THRHLR8_32B_tag THRHLR8;         /* offset: 0x0290 size: 32 bit */
                                           /* Upper Threshold register 9 */
      ADC_THRHLR9_32B_tag THRHLR9;         /* offset: 0x0294 size: 32 bit */
                                          /* Upper Threshold register 10 */
      ADC_THRHLR10_32B_tag THRHLR10;       /* offset: 0x0298 size: 32 bit */
                                          /* Upper Threshold register 11 */
      ADC_THRHLR11_32B_tag THRHLR11;       /* offset: 0x029C size: 32 bit */
                                          /* Upper Threshold register 12 */
      ADC_THRHLR12_32B_tag THRHLR12;       /* offset: 0x02A0 size: 32 bit */
                                          /* Upper Threshold register 13 */
      ADC_THRHLR13_32B_tag THRHLR13;       /* offset: 0x02A4 size: 32 bit */
                                          /* Upper Threshold register 14 */
      ADC_THRHLR14_32B_tag THRHLR14;       /* offset: 0x02A8 size: 32 bit */
                                          /* Upper Threshold register 15 */
      ADC_THRHLR15_32B_tag THRHLR15;       /* offset: 0x02AC size: 32 bit */
      union {
                                     /* Channel Watchdog Select register */
         ADC_CWSELR_32B_tag CWSELR[12];    /* offset: 0x02B0  (0x0004 x 12) */

         struct {
                                     /* Channel Watchdog Select register */
            ADC_CWSELR_32B_tag CWSELR0;    /* offset: 0x02B0 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR1;    /* offset: 0x02B4 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR2;    /* offset: 0x02B8 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR3;    /* offset: 0x02BC size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR4;    /* offset: 0x02C0 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR5;    /* offset: 0x02C4 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR6;    /* offset: 0x02C8 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR7;    /* offset: 0x02CC size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR8;    /* offset: 0x02D0 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR9;    /* offset: 0x02D4 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR10;   /* offset: 0x02D8 size: 32 bit */
            ADC_CWSELR_32B_tag CWSELR11;   /* offset: 0x02DC size: 32 bit */
         };

      };
      union {
                                     /* Channel Watchdog Enable Register */
         ADC_CWENR_32B_tag CWENR[3];       /* offset: 0x02E0  (0x0004 x 3) */

         struct {
                                     /* Channel Watchdog Enable Register */
            ADC_CWENR_32B_tag CWENR0;      /* offset: 0x02E0 size: 32 bit */
            ADC_CWENR_32B_tag CWENR1;      /* offset: 0x02E4 size: 32 bit */
            ADC_CWENR_32B_tag CWENR2;      /* offset: 0x02E8 size: 32 bit */
         };

      };
      int8_t ADC_reserved_02EC_C[4];
      union {
                                /* Analog Watchdog Out of Range Register */
         ADC_AWORR_32B_tag AWORR[3];       /* offset: 0x02F0  (0x0004 x 3) */

         struct {
                                /* Analog Watchdog Out of Range Register */
            ADC_AWORR_32B_tag AWORR0;      /* offset: 0x02F0 size: 32 bit */
            ADC_AWORR_32B_tag AWORR1;      /* offset: 0x02F4 size: 32 bit */
            ADC_AWORR_32B_tag AWORR2;      /* offset: 0x02F8 size: 32 bit */
         };

      };
      int8_t ADC_reserved_02FC[68];
                                   /* SELF TEST CONFIGURATION REGISTER 1 */
      ADC_STCR1_32B_tag STCR1;             /* offset: 0x0340 size: 32 bit */
                                   /* SELF TEST CONFIGURATION REGISTER 2 */
      ADC_STCR2_32B_tag STCR2;             /* offset: 0x0344 size: 32 bit */
                                   /* SELF TEST CONFIGURATION REGISTER 3 */
      ADC_STCR3_32B_tag STCR3;             /* offset: 0x0348 size: 32 bit */
                                         /* SELF TEST BAUD RATE REGISTER */
      ADC_STBRR_32B_tag STBRR;             /* offset: 0x034C size: 32 bit */
                                          /* SELF TEST STATUS REGISTER 1 */
      ADC_STSR1_32B_tag STSR1;             /* offset: 0x0350 size: 32 bit */
                                          /* SELF TEST STATUS REGISTER 2 */
      ADC_STSR2_32B_tag STSR2;             /* offset: 0x0354 size: 32 bit */
                                          /* SELF TEST STATUS REGISTER 3 */
      ADC_STSR3_32B_tag STSR3;             /* offset: 0x0358 size: 32 bit */
                                          /* SELF TEST STATUS REGISTER 4 */
      ADC_STSR4_32B_tag STSR4;             /* offset: 0x035C size: 32 bit */
      int8_t ADC_reserved_0360[16];
                                            /* SELF TEST DATA REGISTER 1 */
      ADC_STDR1_32B_tag STDR1;             /* offset: 0x0370 size: 32 bit */
                                            /* SELF TEST DATA REGISTER 2 */
      ADC_STDR2_32B_tag STDR2;             /* offset: 0x0374 size: 32 bit */
      int8_t ADC_reserved_0378[8];
                                 /* SELF TEST ANALOG WATCHDOG REGISTER 0 */
      ADC_STAW0R_32B_tag STAW0R;           /* offset: 0x0380 size: 32 bit */
                                /* SELF TEST ANALOG WATCHDOG REGISTER 1A */
      ADC_STAW1AR_32B_tag STAW1AR;         /* offset: 0x0384 size: 32 bit */
                                /* SELF TEST ANALOG WATCHDOG REGISTER 1B */
      ADC_STAW1BR_32B_tag STAW1BR;         /* offset: 0x0388 size: 32 bit */
                                 /* SELF TEST ANALOG WATCHDOG REGISTER 2 */
      ADC_STAW2R_32B_tag STAW2R;           /* offset: 0x038C size: 32 bit */
                                 /* SELF TEST ANALOG WATCHDOG REGISTER 3 */
      ADC_STAW3R_32B_tag STAW3R;           /* offset: 0x0390 size: 32 bit */
                                 /* SELF TEST ANALOG WATCHDOG REGISTER 4 */
      ADC_STAW4R_32B_tag STAW4R;           /* offset: 0x0394 size: 32 bit */
                                 /* SELF TEST ANALOG WATCHDOG REGISTER 5 */
      ADC_STAW5R_32B_tag STAW5R;           /* offset: 0x0398 size: 32 bit */
   } ADC_tag;


