RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
#define ADC0  (*(volatile ADC_tag *) 0xFFE00000UL)
#define ADC1  (*(volatile ADC_tag *) 0xFFE04000UL)



/****************************************************************/
/*                                                              */
/* Module: CTU  */
/*                                                              */
/****************************************************************/

   typedef union {   /* Trigger Generator Subunit Input Selection register */
      uint32_t R;
      struct {
         uint32_t  I15_FE:1;          /* ext_signal Falling Edge */
         uint32_t  I15_RE:1;          /* ext_signal Rising  Edge */
         uint32_t  I14_FE:1;          /* eTimer2 Falling Edge Enable */
         uint32_t  I14_RE:1;          /* eTimer2 Rising  Edge Enable */
         uint32_t  I13_FE:1;          /* eTimer1 Falling Edge Enable */
         uint32_t  I13_RE:1;          /* eTimer1 Rising  Edge Enable */
         uint32_t  I12_FE:1;          /* RPWM ch3 Falling Edge Enable */
         uint32_t  I12_RE:1;          /* RPWM ch3 Rising  Edge Enable */
         uint32_t  I11_FE:1;          /* RPWM ch2 Falling Edge Enable */
         uint32_t  I11_RE:1;          /* RPWM ch2 Rising  Edge Enable */
         uint32_t  I10_FE:1;          /* RPWM ch1 Falling Edge Enable */
         uint32_t  I10_RE:1;          /* RPWM ch1 Rising  Edge Enable */
         uint32_t  I9_FE:1;           /* RPWM ch0 Falling Edge Enable */
         uint32_t  I9_RE:1;           /* RPWM ch0 Rising  Edge Enable */
         uint32_t  I8_FE:1;           /* PWM ch3 even trig Falling edge Enable */
         uint32_t  I8_RE:1;           /* PWM ch3 even trig Rising  edge Enable */
         uint32_t  I7_FE:1;           /* PWM ch2 even trig Falling edge Enable */
         uint32_t  I7_RE:1;           /* PWM ch2 even trig Rising  edge Enable */
         uint32_t  I6_FE:1;           /* PWM ch1 even trig Falling edge Enable */
         uint32_t  I6_RE:1;           /* PWM ch1 even trig Rising  edge Enable */
         uint32_t  I5_FE:1;           /* PWM ch0 even trig Falling edge Enable */
         uint32_t  I5_RE:1;           /* PWM ch0 even trig Rising edge Enable */
         uint32_t  I4_FE:1;           /* PWM ch3 odd trig Falling edge Enable */
         uint32_t  I4_RE:1;           /* PWM ch3 odd trig Rising  edge Enable */
         uint32_t  I3_FE:1;           /* PWM ch2 odd trig Falling edge Enable */
         uint32_t  I3_RE:1;           /* PWM ch2 odd trig Rising  edge Enable */
         uint32_t  I2_FE:1;           /* PWM ch1 odd trig Falling edge Enable */
         uint32_t  I2_RE:1;           /* PWM ch1 odd trig Rising  edge Enable */
         uint32_t  I1_FE:1;           /* PWM ch0 odd trig Falling edge Enable */
         uint32_t  I1_RE:1;           /* PWM ch0 odd trig Rising  edge Enable */
         uint32_t  I0_FE:1;           /* PWM Reload Falling Edge Enable */
         uint32_t  I0_RE:1;           /* PWM Reload Rising  Edge Enable */
      } B;
   } CTU_TGSISR_32B_tag;

   typedef union {   /* Trigger Generator Subunit Control Register */
      uint16_t R;
      struct {
         uint16_t:7;
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  ET_TM:1;           /* Toggle Mode Enable */
#else
         uint16_t  ETTM:1;              /* deprecated name - please avoid */
#endif
         uint16_t  PRES:2;            /* TGS Prescaler Selection */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_SM:5;          /* MRS Selection in Sequential Mode */
#else
         uint16_t  MRSSM:5;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  TGS_M:1;           /* Trigger Generator Subunit Mode */
#else
         uint16_t  TGSM:1;              /* deprecated name - please avoid */
#endif
      } B;
   } CTU_TGSCR_16B_tag;

   typedef union {   /*  */
      uint16_t R;
   } CTU_TCR_16B_tag;

   typedef union {   /* TGS Counter Compare Register */
      uint16_t R;
#ifndef USE_FIELD_ALIASES_CTU
      struct {
         uint16_t  TGSCCV:16;         /* deprecated field -- do not use */
      } B;
#endif
   } CTU_TGSCCR_16B_tag;

   typedef union {   /* TGS Counter Reload Register */
      uint16_t R;
#ifndef USE_FIELD_ALIASES_CTU
      struct {
         uint16_t  TGSCRV:16;         /* deprecated field -- do not use */
      } B;
#endif
   } CTU_TGSCRR_16B_tag;

   typedef union {   /* Commands List Control Register 1 */
      uint32_t R;
      struct {
         uint32_t:3;
         uint32_t  T3INDEX:5;         /* Trigger 3 First Command address */
         uint32_t:3;
         uint32_t  T2INDEX:5;         /* Trigger 2 First Command address */
         uint32_t:3;
         uint32_t  T1INDEX:5;         /* Trigger 1 First Command address */
         uint32_t:3;
         uint32_t  T0INDEX:5;         /* Trigger 0 First Command address */
      } B;
   } CTU_CLCR1_32B_tag;

   typedef union {   /* Commands List Control Register 2 */
      uint32_t R;
      struct {
         uint32_t:3;
         uint32_t  T7INDEX:5;         /* Trigger 7 First Command address */
         uint32_t:3;
         uint32_t  T6INDEX:5;         /* Trigger 6 First Command address */
         uint32_t:3;
         uint32_t  T5INDEX:5;         /* Trigger 5 First Command address */
         uint32_t:3;
         uint32_t  T4INDEX:5;         /* Trigger 4 First Command address */
      } B;
   } CTU_CLCR2_32B_tag;

   typedef union {   /* Trigger Handler Control Register 1 */
      uint32_t R;
      struct {
         uint32_t:1;
         uint32_t  T3_E:1;            /* Trigger 3 enable */
         uint32_t  T3_ETE:1;          /* Trigger 3 Ext Trigger output enable */
         uint32_t  T3_T4E:1;          /* Trigger 3 Timer4 output enable */
         uint32_t  T3_T3E:1;          /* Trigger 3 Timer3 output enable */
         uint32_t  T3_T2E:1;          /* Trigger 3 Timer2 output enable */
         uint32_t  T3_T1E:1;          /* Trigger 3 Timer1 output enable */
         uint32_t  T3_ADCE:1;         /* Trigger 3 ADC Command output enable */
         uint32_t:1;
         uint32_t  T2_E:1;            /* Trigger 2 enable */
         uint32_t  T2_ETE:1;          /* Trigger 2 Ext Trigger output enable */
         uint32_t  T2_T4E:1;          /* Trigger 2 Timer4 output enable */
         uint32_t  T2_T3E:1;          /* Trigger 2 Timer3 output enable */
         uint32_t  T2_T2E:1;          /* Trigger 2 Timer2 output enable */
         uint32_t  T2_T1E:1;          /* Trigger 2 Timer1 output enable */
         uint32_t  T2_ADCE:1;         /* Trigger 2 ADC Command output enable */
         uint32_t:1;
         uint32_t  T1_E:1;            /* Trigger 1 enable */
         uint32_t  T1_ETE:1;          /* Trigger 1 Ext Trigger output enable */
         uint32_t  T1_T4E:1;          /* Trigger 1 Timer4 output enable */
         uint32_t  T1_T3E:1;          /* Trigger 1 Timer3 output enable */
         uint32_t  T1_T2E:1;          /* Trigger 1 Timer2 output enable */
         uint32_t  T1_T1E:1;          /* Trigger 1 Timer1 output enable */
         uint32_t  T1_ADCE:1;         /* Trigger 1 ADC Command output enable */
         uint32_t:1;
         uint32_t  T0_E:1;            /* Trigger 0 enable */
         uint32_t  T0_ETE:1;          /* Trigger 0 Ext Trigger output enable */
         uint32_t  T0_T4E:1;          /* Trigger 0 Timer4 output enable */
         uint32_t  T0_T3E:1;          /* Trigger 0 Timer3 output enable */
         uint32_t  T0_T2E:1;          /* Trigger 0 Timer2 output enable */
         uint32_t  T0_T1E:1;          /* Trigger 0 Timer1 output enable */
         uint32_t  T0_ADCE:1;         /* Trigger 0 ADC Command output enable */
      } B;
   } CTU_THCR1_32B_tag;

