RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Trigger Handler Control Register 2 */
      uint32_t R;
      struct {
         uint32_t:1;
         uint32_t  T7_E:1;            /* Trigger 7 enable */
         uint32_t  T7_ETE:1;          /* Trigger 7 Ext Trigger output enable */
         uint32_t  T7_T4E:1;          /* Trigger 7 Timer4 output enable */
         uint32_t  T7_T3E:1;          /* Trigger 7 Timer3 output enable */
         uint32_t  T7_T2E:1;          /* Trigger 7 Timer2 output enable */
         uint32_t  T7_T1E:1;          /* Trigger 7 Timer1 output enable */
         uint32_t  T7_ADCE:1;         /* Trigger 7 ADC Command output enable */
         uint32_t:1;
         uint32_t  T6_E:1;            /* Trigger 6 enable */
         uint32_t  T6_ETE:1;          /* Trigger 6 Ext Trigger output enable */
         uint32_t  T6_T4E:1;          /* Trigger 6 Timer4 output enable */
         uint32_t  T6_T3E:1;          /* Trigger 6 Timer3 output enable */
         uint32_t  T6_T2E:1;          /* Trigger 6 Timer2 output enable */
         uint32_t  T6_T1E:1;          /* Trigger 6 Timer1 output enable */
         uint32_t  T6_ADCE:1;         /* Trigger 6 ADC Command output enable */
         uint32_t:1;
         uint32_t  T5_E:1;            /* Trigger 5 enable */
         uint32_t  T5_ETE:1;          /* Trigger 5 Ext Trigger output enable */
         uint32_t  T5_T4E:1;          /* Trigger 5 Timer4 output enable */
         uint32_t  T5_T3E:1;          /* Trigger 5 Timer3 output enable */
         uint32_t  T5_T2E:1;          /* Trigger 5 Timer2 output enable */
         uint32_t  T5_T1E:1;          /* Trigger 5 Timer1 output enable */
         uint32_t  T5_ADCE:1;         /* Trigger 5 ADC Command output enable */
         uint32_t:1;
         uint32_t  T4_E:1;            /* Trigger 4 enable */
         uint32_t  T4_ETE:1;          /* Trigger 4 Ext Trigger output enable */
         uint32_t  T4_T4E:1;          /* Trigger 4 Timer4 output enable */
         uint32_t  T4_T3E:1;          /* Trigger 4 Timer3 output enable */
         uint32_t  T4_T2E:1;          /* Trigger 4 Timer2 output enable */
         uint32_t  T4_T1E:1;          /* Trigger 4 Timer1 output enable */
         uint32_t  T4_ADCE:1;         /* Trigger 4 ADC Command output enable */
      } B;
   } CTU_THCR2_32B_tag;


   /* Register layout for all registers CLR_DCM... */

   typedef union {   /* Command List Register. View: (CMS=BIT13=)ST1 = 1, (BIT9=)ST0 = DONT CARE */
      uint16_t R;
      struct {
         uint16_t  CIR:1;             /* Command Interrupt Request */
         uint16_t  LC:1;              /* Last Command */
         uint16_t  CMS:1;             /* Conversion Mode Selection */
         uint16_t  FIFO:3;            /* FIFO for ADC A/B */
         uint16_t:1;
         uint16_t  CHB:4;             /* ADC unit B channel number */
         uint16_t:1;
         uint16_t  CHA:4;             /* ADC unit A channel number */
      } B;
   } CTU_CLR_DCM_16B_tag;


   /* Register layout for all registers CLR_SCM... */

   typedef union {   /* Command List Register. View: (CMS=BIT13=)ST1 = 0, (BIT9=)ST0 = 0 */
      uint16_t R;
      struct {
         uint16_t  CIR:1;             /* Command Interrupt Request */
         uint16_t  LC:1;              /* Last Command */
         uint16_t  CMS:1;             /* Conversion Mode Selection */
         uint16_t  FIFO:3;            /* FIFO for ADC A/B */
         uint16_t:4;
         uint16_t  SU:1;              /* Selection ADC Unit */
         uint16_t:1;
         uint16_t  CH:4;              /* ADC unit channel number */
      } B;
   } CTU_CLR_SCM_16B_tag;


   /* Register layout for all registers CLR... */


   typedef union {   /* Control Register */
      uint16_t R;
      struct {
         uint16_t  EMPTY_CLR7:1;      /* Empty Clear 7 */
         uint16_t  EMPTY_CLR6:1;      /* Empty Clear 6 */
         uint16_t  EMPTY_CLR5:1;      /* Empty Clear 5 */
         uint16_t  EMPTY_CLR4:1;      /* Empty Clear 4 */
         uint16_t  EMPTY_CLR3:1;      /* Empty Clear 3 */
         uint16_t  EMPTY_CLR2:1;      /* Empty Clear 2 */
         uint16_t  EMPTY_CLR1:1;      /* Empty Clear 1 */
         uint16_t  EMPTY_CLR0:1;      /* Empty Clear 0 */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN7:1;         /* Enable DMA interface for FIFO 7 */
#else
         uint16_t  DMAEN7:1;         /* Enable DMA interface for FIFO 7 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN6:1;         /* Enable DMA interface for FIFO 6 */
#else
         uint16_t  DMAEN6:1;         /* Enable DMA interface for FIFO 6 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN5:1;         /* Enable DMA interface for FIFO 5 */
#else
         uint16_t  DMAEN5:1;         /* Enable DMA interface for FIFO 5 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN4:1;         /* Enable DMA interface for FIFO 4 */
#else
         uint16_t  DMAEN4:1;         /* Enable DMA interface for FIFO 4 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN3:1;         /* Enable DMA interface for FIFO 3 */
#else
         uint16_t  DMAEN3:1;         /* Enable DMA interface for FIFO 3 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN2:1;         /* Enable DMA interface for FIFO 2 */
#else
         uint16_t  DMAEN2:1;         /* Enable DMA interface for FIFO 2 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN1:1;         /* Enable DMA interface for FIFO 1 */
#else
         uint16_t  DMAEN1:1;         /* Enable DMA interface for FIFO 1 */	
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  DMA_EN0:1;         /* Enable DMA interface for FIFO 0 */
#else
         uint16_t  DMAEN0:1;         /* Enable DMA interface for FIFO 0 */	
#endif
      } B;
   } CTU_CR_16B_tag;

   typedef union {   /* Control Register FIFO */
      uint32_t R;
      struct {
         uint32_t  FIFO_OVERRUN_EN7:1;   /* FIFO 7 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN7:1;   /* FIFO 7 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN7:1;   /* FIFO 7 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN7:1;   /* FIFO 7 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN6:1;   /* FIFO 6 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN6:1;   /* FIFO 6 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN6:1;   /* FIFO 6 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN6:1;   /* FIFO 6 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN5:1;   /* FIFO 5 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN5:1;   /* FIFO 5 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN5:1;   /* FIFO 5 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN5:1;   /* FIFO 5 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN4:1;   /* FIFO 4 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN4:1;   /* FIFO 4 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN4:1;   /* FIFO 4 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN4:1;   /* FIFO 4 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN3:1;   /* FIFO 3 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN3:1;   /* FIFO 3 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN3:1;   /* FIFO 3 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN3:1;   /* FIFO 3 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN2:1;   /* FIFO 2 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN2:1;   /* FIFO 2 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN2:1;   /* FIFO 2 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN2:1;   /* FIFO 2 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN1:1;   /* FIFO 1 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN1:1;   /* FIFO 1 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN1:1;   /* FIFO 1 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN1:1;   /* FIFO 1 FULL Enable Interrupt */
         uint32_t  FIFO_OVERRUN_EN0:1;   /* FIFO 0 OVERRUN  Enable Interrupt */
         uint32_t  FIFO_OVERFLOW_EN0:1;   /* FIFO 0 OVERFLOW Enable Interrupt */
         uint32_t  FIFO_EMPTY_EN0:1;   /* FIFO 0 EMPTY Enable Interrupt */
         uint32_t  FIFO_FULL_EN0:1;   /* FIFO 0 FULL Enable Interrupt */
      } B;
   } CTU_FCR_32B_tag;

   typedef union {   /* Threshold 1 Register */
      uint32_t R;
      struct {
         uint32_t  THRESHOLD3:8;       /* Threshlod FIFO 3 */
         uint32_t  THRESHOLD2:8;       /* Threshlod FIFO 2 */
         uint32_t  THRESHOLD1:8;       /* Threshlod FIFO 1 */
         uint32_t  THRESHOLD0:8;       /* Threshlod FIFO 0 */
      } B;
   } CTU_TH1_32B_tag;

