RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Threshold 2 Register */
      uint32_t R;
      struct {
         uint32_t  THRESHOLD7:8;       /* Threshlod FIFO 7 */
         uint32_t  THRESHOLD6:8;       /* Threshlod FIFO 6 */
         uint32_t  THRESHOLD5:8;       /* Threshlod FIFO 5 */
         uint32_t  THRESHOLD4:8;       /* Threshlod FIFO 4 */
      } B;
   } CTU_TH2_32B_tag;

   typedef union {   /* Status Register */
      uint32_t R;
      struct {
         uint32_t  FIFO_OVERRUN7:1;   /* FIFO 7 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW7:1;   /* FIFO 7 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY7:1;     /* FIFO 7 EMPTY Flag */
         uint32_t  FIFO_FULL7:1;      /* FIFO 7 FULL Flag */
         uint32_t  FIFO_OVERRUN6:1;   /* FIFO 6 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW6:1;   /* FIFO 6 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY6:1;     /* FIFO 6 EMPTY Flag */
         uint32_t  FIFO_FULL6:1;      /* FIFO 6 FULL Flag */
         uint32_t  FIFO_OVERRUN5:1;   /* FIFO 5 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW5:1;   /* FIFO 5 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY5:1;     /* FIFO 5 EMPTY Flag */
         uint32_t  FIFO_FULL5:1;      /* FIFO 5 FULL Flag */
         uint32_t  FIFO_OVERRUN4:1;   /* FIFO 4 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW4:1;   /* FIFO 4 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY4:1;     /* FIFO 4 EMPTY Flag */
         uint32_t  FIFO_FULL4:1;      /* FIFO 4 FULL Flag */
         uint32_t  FIFO_OVERRUN3:1;   /* FIFO 3 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW3:1;   /* FIFO 3 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY3:1;     /* FIFO 3 EMPTY Flag */
         uint32_t  FIFO_FULL3:1;      /* FIFO 3 FULL Flag */
         uint32_t  FIFO_OVERRUN2:1;   /* FIFO 2 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW2:1;   /* FIFO 2 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY2:1;     /* FIFO 2 EMPTY Flag */
         uint32_t  FIFO_FULL2:1;      /* FIFO 2 FULL Flag */
         uint32_t  FIFO_OVERRUN1:1;   /* FIFO 1 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW1:1;   /* FIFO 1 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY1:1;     /* FIFO 1 EMPTY Flag */
         uint32_t  FIFO_FULL1:1;      /* FIFO 1 FULL Flag */
         uint32_t  FIFO_OVERRUN0:1;   /* FIFO 0 OVERRUN  Flag */
         uint32_t  FIFO_OVERFLOW0:1;   /* FIFO 0 OVERFLOW Flag */
         uint32_t  FIFO_EMPTY0:1;     /* FIFO 0 EMPTY Flag */
         uint32_t  FIFO_FULL0:1;      /* FIFO 0 FULL Flag */
      } B;
   } CTU_STS_32B_tag;


   /* Register layout for all registers FR... */

   typedef union {   /* FIFO Right Aligned register */
      uint32_t R;
      struct {
         uint32_t:11;
         uint32_t  ADC:1;             /* ADC Unit */
         uint32_t  N_CH:4;            /* Number Channel */
         uint32_t:4;
         uint32_t  DATA:12;           /* Data Fifo */
      } B;
   } CTU_FR_32B_tag;


   /* Register layout for all registers FL... */

   typedef union {   /* FIFO Left Aligned register */
      uint32_t R;
      struct {
         uint32_t:11;
         uint32_t  ADC:1;             /* ADC Unit */
         uint32_t  N_CH:4;            /* Number Channel */
         uint32_t:1;
         uint32_t  DATA:12;           /* Data Fifo */
         uint32_t:3;
      } B;
   } CTU_FL_32B_tag;

   typedef union {   /* CTU Error Flag Register */
      uint16_t R;
      struct {
         uint16_t:3;
         uint16_t  CS:1;              /* Counter Status */
         uint16_t  ET_OE:1;           /* ExtTrigger Generation Overrun */
         uint16_t  ERR_CMP:1;         /* Set if counter reaches TGSCCR register */
         uint16_t  T4_OE:1;           /* Timer4 Generation Overrun */
         uint16_t  T3_OE:1;           /* Timer3 Generation Overrun */
         uint16_t  T2_OE:1;           /* Timer2 Generation Overrun */
         uint16_t  T1_OE:1;           /* Timer1 Generation Overrun */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  ADC_OE:1;          /* ADC Command Generation Overrun */
#else
         uint16_t  ADCOE:1;          /* ADC Command Generation Overrun */
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  TGS_OSM:1;         /* TGS Overrun */
#else
         uint16_t  TGSOSM:1;         /* TGS Overrun */
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_O:1;           /* MRS Overrun */
#else
         uint16_t  MRSO:1;         /* TGS Overrun */
#endif
         uint16_t  ICE:1;             /* Invalid Command Error */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  SM_TO:1;           /* Trigger Overrun */
#else
         uint16_t  SMTO:1;        /* Trigger Overrun */
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_RE:1;          /* MRS Reload Error */
#else
         uint16_t  MRSRE:1;        /* MRS Reload Error */
#endif
      } B;
   } CTU_CTUEFR_16B_tag;

   typedef union {   /* CTU Interrupt Flag Register */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  S_E_B:1;           /* Slice time OK */
         uint16_t  S_E_A:1;           /* Slice time OK */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  ADC_I:1;           /* ADC Command Interrupt Flag */
#else
         uint16_t  ADC:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T7_I:1;            /* Trigger 7  Interrupt Flag */
#else
         uint16_t  T7:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T6_I:1;            /* Trigger 6  Interrupt Flag */
#else
         uint16_t  T6:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T5_I:1;            /* Trigger 5  Interrupt Flag */
#else
         uint16_t  T5:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T4_I:1;            /* Trigger 4  Interrupt Flag */
#else
         uint16_t  T4:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T3_I:1;            /* Trigger 3  Interrupt Flag */
#else
         uint16_t  T3:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T2_I:1;            /* Trigger 2  Interrupt Flag */
#else
         uint16_t  T2:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T1_I:1;            /* Trigger 1  Interrupt Flag */
#else
         uint16_t  T1:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T0_I:1;            /* Trigger 0  Interrupt Flag */
#else
         uint16_t  T0:1;        
#endif  
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_I:1;           /* MRS Interrupt Flag */
#else
         uint16_t  MRS:1;        
#endif
      } B;
   } CTU_CTUIFR_16B_tag;

   typedef union {   /* CTU Interrupt/DMA Register */
      uint16_t R;
      struct {       
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T7_I:1;            /* Trigger 7  Interrupt Enable */
#else
         uint16_t  T7IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T6_I:1;            /* Trigger 6  Interrupt Enable */
#else
         uint16_t  T6IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T5_I:1;            /* Trigger 5  Interrupt Enable */
#else
         uint16_t  T5IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T4_I:1;            /* Trigger 4  Interrupt Enable */
#else
         uint16_t  T4IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T3_I:1;            /* Trigger 3  Interrupt Enable */
#else
         uint16_t  T3IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T2_I:1;            /* Trigger 2  Interrupt Enable */
#else
         uint16_t  T2IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T1_I:1;            /* Trigger 1  Interrupt Enable */
#else
         uint16_t  T1IE:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T0_I:1;            /* Trigger 0  Interrupt Enable */
#else
         uint16_t  T0IE:1;        
#endif
         uint16_t:2;
         uint16_t  SAF_CNT_B_EN:1;    /* Conversion time counter enabled */
         uint16_t  SAF_CNT_A_EN:1;    /* Conversion time counter enabled */
         uint16_t  DMA_DE:1;          /* DMA and gre bit */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_DMAE:1;        /* DMA Transfer Enable */
#else
         uint16_t  MRSDMAE:1;        
#endif      
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_IE:1;          /* MRS Interrupt Enable */
#else
         uint16_t  MRSIE:1;        
#endif
         uint16_t  IEE:1;             /* Interrupt Error Enable */
      } B;
   } CTU_CTUIR_16B_tag;

