RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Control On-Time Register */
      uint16_t R;
      struct {
         uint16_t:8;
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  COTR_COTR:8;       /* Control On-Time Register and Guard Time */
#else
         uint16_t  COTR:8;        
#endif
      } B;
   } CTU_COTR_16B_tag;

   typedef union {   /* CTU Control Register */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T7_SG:1;           /* Trigger 7 Software Generated */
#else
         uint16_t  T7SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T6_SG:1;           /* Trigger 6 Software Generated */
#else
         uint16_t  T6SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T5_SG:1;           /* Trigger 5 Software Generated */
#else
         uint16_t  T5SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T4_SG:1;           /* Trigger 4 Software Generated */
#else
         uint16_t  T4SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T3_SG:1;           /* Trigger 3 Software Generated */
#else
         uint16_t  T3SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T2_SG:1;           /* Trigger 2 Software Generated */
#else
         uint16_t  T2SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T1_SG:1;           /* Trigger 1 Software Generated */
#else
         uint16_t  T1SG:1;        
#endif
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  T0_SG:1;           /* Trigger 0 Software Generated */
#else
         uint16_t  T0SG:1;        
#endif       
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  CTU_ADC_RESET:1;   /* CTU ADC State Machine Reset */
#else
         uint16_t  CTUADCRESET:1;        
#endif 
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  CTU_ODIS:1;        /* CTU Output Disable */
#else
         uint16_t  CTUODIS:1;        
#endif         
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  FILTER_EN:1;       /* Synchronize Filter Register value */
#else
         uint16_t  FILTERENABLE:1;        
#endif
         uint16_t  CGRE:1;            /* Clear GRE */
         uint16_t  FGRE:1;            /* GRE Flag */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  MRS_SG:1;          /* MRS Software Generated */
#else
         uint16_t  MRSSG:1;        
#endif     
         uint16_t  GRE:1;             /* General Reload Enable */
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  TGSISR_RE:1;       /* TGSISR Reload Enable */
#else
         uint16_t  TGSISRRE:1;        
#endif        
      } B;
   } CTU_CTUCR_16B_tag;

   typedef union {   /* CTU Digital Filter Register */
      uint16_t R;
      struct {
         uint16_t:8;
#ifndef USE_FIELD_ALIASES_CTU
         uint16_t  FILTER_VALUE:8;    /* Filter Value */
#else
         uint16_t  FILTERVALUE:8;       /* deprecated name - please avoid */
#endif
      } B;
   } CTU_FILTER_16B_tag;

   typedef union {   /* CTU Expected A Value Register */
      uint16_t R;
      struct {
         uint16_t  EXPECTED_A_VALUE:16;   /* Expected A Value */
      } B;
   } CTU_EXPECTED_A_16B_tag;

   typedef union {   /* CTU Expected B Value Register */
      uint16_t R;
      struct {
         uint16_t  EXPECTED_B_VALUE:16;   /* Expected B Value */
      } B;
   } CTU_EXPECTED_B_16B_tag;

   typedef union {   /* CTU Counter Range Register */
      uint16_t R;
      struct {
         uint16_t:8;
         uint16_t  CNT_RANGE_VALUE:8;   /* Counter Range Value */
      } B;
   } CTU_CNT_RANGE_16B_tag;


   /* Register layout for generated register(s) FRA... */

   typedef union {   /*  */
      uint32_t R;
   } CTU_FRA_32B_tag;


   /* Register layout for generated register(s) FLA... */

   typedef union {   /*  */
      uint32_t R;
   } CTU_FLA_32B_tag;



   typedef struct CTU_struct_tag { /* start of CTU_tag */
                   /* Trigger Generator Subunit Input Selection register */
      CTU_TGSISR_32B_tag TGSISR;           /* offset: 0x0000 size: 32 bit */
                           /* Trigger Generator Subunit Control Register */
      CTU_TGSCR_16B_tag TGSCR;             /* offset: 0x0004 size: 16 bit */
      union {
         CTU_TCR_16B_tag TCR[8];           /* offset: 0x0006  (0x0002 x 8) */

         struct {
            CTU_TCR_16B_tag T0CR;          /* offset: 0x0006 size: 16 bit */
            CTU_TCR_16B_tag T1CR;          /* offset: 0x0008 size: 16 bit */
            CTU_TCR_16B_tag T2CR;          /* offset: 0x000A size: 16 bit */
            CTU_TCR_16B_tag T3CR;          /* offset: 0x000C size: 16 bit */
            CTU_TCR_16B_tag T4CR;          /* offset: 0x000E size: 16 bit */
            CTU_TCR_16B_tag T5CR;          /* offset: 0x0010 size: 16 bit */
            CTU_TCR_16B_tag T6CR;          /* offset: 0x0012 size: 16 bit */
            CTU_TCR_16B_tag T7CR;          /* offset: 0x0014 size: 16 bit */
         };

      };
                                         /* TGS Counter Compare Register */
      CTU_TGSCCR_16B_tag TGSCCR;           /* offset: 0x0016 size: 16 bit */
                                          /* TGS Counter Reload Register */
      CTU_TGSCRR_16B_tag TGSCRR;           /* offset: 0x0018 size: 16 bit */
      int8_t CTU_reserved_001A[2];
                                     /* Commands List Control Register 1 */
      CTU_CLCR1_32B_tag CLCR1;             /* offset: 0x001C size: 32 bit */
                                     /* Commands List Control Register 2 */
      CTU_CLCR2_32B_tag CLCR2;             /* offset: 0x0020 size: 32 bit */
                                   /* Trigger Handler Control Register 1 */
      CTU_THCR1_32B_tag THCR1;             /* offset: 0x0024 size: 32 bit */
                                   /* Trigger Handler Control Register 2 */
      CTU_THCR2_32B_tag THCR2;             /* offset: 0x0028 size: 32 bit */
      union {
                             /* Command List Register. View: BIT13, BIT9 */
         CTU_CLR_SCM_16B_tag CLR[24];          /* offset: 0x002C  (0x0002 x 24) */ /* deprecated name - please avoid */

