RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
         CTU_FLA_32B_tag FLA[8];           /* offset: 0x00A0  (0x0004 x 8) */

                                           /* FIFO Left Aligned register */
         CTU_FL_32B_tag FL[8];             /* offset: 0x00A0  (0x0004 x 8) */

         struct {
                                           /* FIFO Left Aligned register */
            CTU_FL_32B_tag FL0;            /* offset: 0x00A0 size: 32 bit */
            CTU_FL_32B_tag FL1;            /* offset: 0x00A4 size: 32 bit */
            CTU_FL_32B_tag FL2;            /* offset: 0x00A8 size: 32 bit */
            CTU_FL_32B_tag FL3;            /* offset: 0x00AC size: 32 bit */
            CTU_FL_32B_tag FL4;            /* offset: 0x00B0 size: 32 bit */
            CTU_FL_32B_tag FL5;            /* offset: 0x00B4 size: 32 bit */
            CTU_FL_32B_tag FL6;            /* offset: 0x00B8 size: 32 bit */
            CTU_FL_32B_tag FL7;            /* offset: 0x00BC size: 32 bit */
         };

      };
                                              /* CTU Error Flag Register */
      CTU_CTUEFR_16B_tag CTUEFR;           /* offset: 0x00C0 size: 16 bit */
                                          /* CTU Interrupt Flag Register */
      CTU_CTUIFR_16B_tag CTUIFR;           /* offset: 0x00C2 size: 16 bit */
                                           /* CTU Interrupt/DMA Register */
      CTU_CTUIR_16B_tag CTUIR;             /* offset: 0x00C4 size: 16 bit */
                                             /* Control On-Time Register */
      CTU_COTR_16B_tag COTR;               /* offset: 0x00C6 size: 16 bit */
      /* CTU Control Register */
      CTU_CTUCR_16B_tag CTUCR;             /* offset: 0x00C8 size: 16 bit */
      union {
                                          /* CTU Digital Filter Register */
         CTU_FILTER_16B_tag FILTER;        /* offset: 0x00CA size: 16 bit */

         CTU_FILTER_16B_tag CTUFILTER;     /* deprecated - please avoid */

      };
                                        /* CTU Expected A Value Register */
      CTU_EXPECTED_A_16B_tag EXPECTED_A;  /* offset: 0x00CC size: 16 bit */

                                        /* CTU Expected B Value Register */
      CTU_EXPECTED_B_16B_tag EXPECTED_B;   /* offset: 0x00CE size: 16 bit */
                                           /* CTU Counter Range Register */
      CTU_CNT_RANGE_16B_tag CNT_RANGE;     /* offset: 0x00D0 size: 16 bit */
   } CTU_tag;


#define CTU   (*(volatile CTU_tag *) 0xFFE0C000UL)



/****************************************************************/
/*                                                              */
/* Module: mcTIMER  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers COMP1... */

   typedef union {   /* Compare Register 1 */
      uint16_t R;
      struct {
      uint16_t COMP1:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_COMP1_16B_tag;


   /* Register layout for all registers COMP2... */

   typedef union {   /* Compare Register 2 */
      uint16_t R;
      struct {
      uint16_t COMP2:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_COMP2_16B_tag;


   /* Register layout for all registers CAPT1... */

   typedef union {   /* Capture Register 1 */
      uint16_t R;
      struct {
      uint16_t CAPT1:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_CAPT1_16B_tag;


   /* Register layout for all registers CAPT2... */

   typedef union {   /* Capture Register 2 */
      uint16_t R;
      struct {
      uint16_t CAPT2:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_CAPT2_16B_tag;


   /* Register layout for all registers LOAD... */

   typedef union {   /* Load Register */
      uint16_t R;
      struct {
       uint16_t LOAD:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_LOAD_16B_tag;


   /* Register layout for all registers HOLD... */

   typedef union {   /* Hold Register */
      uint16_t R;
      struct {
       uint16_t HOLD:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_HOLD_16B_tag;


   /* Register layout for all registers CNTR... */

   typedef union {   /* Counter Register */
      uint16_t R;
      struct {
       uint16_t CNTR:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_CNTR_16B_tag;


   /* Register layout for all registers CTRL1... */

   typedef union {   /* Control Register */
      uint16_t R;
      struct {
         uint16_t  CNTMODE:3;         /* Count Mode */
         uint16_t  PRISRC:5;          /* Primary Count Source */
         uint16_t  ONCE:1;            /* Count Once */
         uint16_t  LENGTH:1;          /* Count Length */
         uint16_t  DIR:1;             /* Count Direction */
         uint16_t  SECSRC:5;          /* Secondary Count Source */
      } B;
   } mcTIMER_CTRL1_16B_tag;


   /* Register layout for all registers CTRL2... */

   typedef union {   /* Control Register 2 */
      uint16_t R;
      struct {
         uint16_t  OEN:1;             /* Output Enable */
         uint16_t  RDNT:1;            /* Redundant Channel Enable */
         uint16_t  INPUT:1;           /* External Input Signal */
         uint16_t  VAL:1;             /* Forced OFLAG Value */
         uint16_t  FORCE:1;           /* Force the OFLAG output */
         uint16_t  COFRC:1;           /* Co-channel OFLAG Force */
         uint16_t  COINIT:2;          /* Co-channel Initialization */
         uint16_t  SIPS:1;            /* Secondary Source Input Polarity Select */
         uint16_t  PIPS:1;            /* Primary Source Input Polarity Select */
         uint16_t  OPS:1;             /* Output Polarity Select */
         uint16_t  MSTR:1;            /* Master Mode */
         uint16_t  OUTMODE:4;         /* Output Mode */
      } B;
   } mcTIMER_CTRL2_16B_tag;


   /* Register layout for all registers CTRL3... */

   typedef union {   /* Control Register 3 */
      uint16_t R;
      struct {
         uint16_t  STPEN:1;           /* Stop Action Enable */
         uint16_t  ROC:2;             /* Reload On Capture */
         uint16_t  FMODE:1;           /* Fault Safing Mode */
         uint16_t  FDIS:4;            /* Fault Disable Mask */
         uint16_t  C2FCNT:3;          /* CAPT2 FIFO Word Count */
         uint16_t  C1FCNT:3;          /* CAPT1 FIFO Word Count */
         uint16_t  DBGEN:2;           /* Debug Actions Enable */
      } B;
   } mcTIMER_CTRL3_16B_tag;


