RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   /* Register layout for all registers STS... */

   typedef union {   /* Status Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  WDF:1;             /* Watchdog Time-out Flag */
         uint16_t  RCF:1;             /* Redundant Channel Flag */
         uint16_t  ICF2:1;            /* Input Capture 2 Flag */
         uint16_t  ICF1:1;            /* Input Capture 1 Flag */
         uint16_t  IEHF:1;            /* Input Edge High Flag */
         uint16_t  IELF:1;            /* Input Edge Low Flag */
         uint16_t  TOF:1;             /* Timer Overflow Flag */
         uint16_t  TCF2:1;            /* Timer Compare 2 Flag */
         uint16_t  TCF1:1;            /* Timer Compare 1 Flag */
         uint16_t  TCF:1;             /* Timer Compare Flag */
      } B;
   } mcTIMER_STS_16B_tag;


   /* Register layout for all registers INTDMA... */

   typedef union {   /* Interrupt and DMA Enable Register */
      uint16_t R;
      struct {
         uint16_t  ICF2DE:1;          /* Input Capture 2 Flag DMA Enable */
         uint16_t  ICF1DE:1;          /* Input Capture 1 Flag DMA Enable */
         uint16_t  CMPLD2DE:1;        /* Comparator Load Register 2 Flag DMA Enable */
         uint16_t  CMPLD1DE:1;        /* Comparator Load Register 1 Flag DMA Enable */
         uint16_t:2;
         uint16_t  WDFIE:1;           /* Watchdog Flag Interrupt Enable */
         uint16_t  RCFIE:1;           /* Redundant Channel Flag Interrupt Enable */
         uint16_t  ICF2IE:1;          /* Input Capture 2 Flag Interrupt Enable */
         uint16_t  ICF1IE:1;          /* Input Capture 1 Flag Interrupt Enable */
         uint16_t  IEHFIE:1;          /* Input Edge High Flag Interrupt Enable */
         uint16_t  IELFIE:1;          /* Input Edge Low Flag Interrupt Enable */
         uint16_t  TOFIE:1;           /* Timer Overflow Flag Interrupt Enable */
         uint16_t  TCF2IE:1;          /* Timer Compare 2 Flag Interrupt Enable */
         uint16_t  TCF1IE:1;          /* Timer Compare 1 Flag Interrupt Enable */
         uint16_t  TCFIE:1;           /* Timer Compare Flag Interrupt Enable */
      } B;
   } mcTIMER_INTDMA_16B_tag;


   /* Register layout for all registers CMPLD1... */

   typedef union {   /* Comparator Load Register 1 */
      uint16_t R;
      struct {
     uint16_t CMPLD1:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_CMPLD1_16B_tag;


   /* Register layout for all registers CMPLD2... */

   typedef union {   /* Comparator Load Register 2 */
      uint16_t R;
      struct {
     uint16_t CMPLD2:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_CMPLD2_16B_tag;


   /* Register layout for all registers CCCTRL... */

   typedef union {   /* Compare and Capture Control Register */
      uint16_t R;
      struct {
         uint16_t  CLC2:3;            /* Compare Load Control 2 */
         uint16_t  CLC1:3;            /* Compare Load Control 1 */
         uint16_t  CMPMODE:2;         /* Compare Mode */
         uint16_t  CPT2MODE:2;        /* Capture 2 Mode Control */
         uint16_t  CPT1MODE:2;        /* Capture 1 Mode Control */
         uint16_t  CFWM:2;            /* Capture FIFO Water Mark */
         uint16_t  ONESHOT:1;         /* One Shot Capture Mode */
         uint16_t  ARM:1;             /* Arm Capture */
      } B;
   } mcTIMER_CCCTRL_16B_tag;


   /* Register layout for all registers FILT... */

   typedef union {   /* Input Filter Register */
      uint16_t R;
      struct {
         uint16_t:5;
#ifndef USE_FIELD_ALIASES_mcTIMER
         uint16_t  FILT_CNT:3;        /* Input Filter Sample Count */
#else
         uint16_t  FILTCNT:3;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcTIMER
         uint16_t  FILT_PER:8;        /* Input Filter Sample Period */
#else
         uint16_t  FILTPER:8;           /* deprecated name - please avoid */
#endif
      } B;
   } mcTIMER_FILT_16B_tag;

   typedef union {   /* Watchdog Time-out Register */
      uint16_t R;
      struct {
      uint16_t WDTOL:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_WDTOL_16B_tag;

   typedef union {   /* Watchdog Time-out Register */
      uint16_t R;
      struct {
      uint16_t WDTOH:16;  /* deprecated definition -- do not use */
      } B;
   } mcTIMER_WDTOH_16B_tag;

   typedef union {   /* Fault Control Register */
      uint16_t R;
      struct {
         uint16_t:3;
         uint16_t  FTEST:1;           /* Fault Test */
         uint16_t  FIE:4;             /* Fault Interrupt Enable */
         uint16_t:4;
         uint16_t  FLVL:4;            /* Fault Active Logic Level */
      } B;
   } mcTIMER_FCTRL_16B_tag;

   typedef union {   /* Fault Status Register */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  FFPIN:4;           /* Filtered Fault Pin */
         uint16_t:4;
         uint16_t  FFLAG:4;           /* Fault Flag */
      } B;
   } mcTIMER_FSTS_16B_tag;

   typedef union {   /* Fault Filter Registers */
      uint16_t R;
      struct {
         uint16_t:5;
#ifndef USE_FIELD_ALIASES_mcTIMER
         uint16_t  FFPIN:3;           /* Fault Filter Sample Count */
#else
         uint16_t  FFILTCNT:3;          /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcTIMER
         uint16_t  FFILT_PER:8;       /* Fault Filter Sample Period */
#else
         uint16_t  FFILTPER:8;          /* deprecated name - please avoid */
#endif
      } B;
   } mcTIMER_FFILT_16B_tag;

   typedef union {   /* Channel Enable Registers */
      uint16_t R;
      struct {
         uint16_t:8;
         uint16_t  ENBL:8;            /* Timer Channel Enable */
      } B;
   } mcTIMER_ENBL_16B_tag;

   typedef union {   /* DMA Request 0 Select Registers */
      uint16_t R;
      struct {
         uint16_t:11;
         uint16_t  DREQ0V:5;          /* DMA Request Select */
      } B;
   } mcTIMER_DREQ0_16B_tag;

   typedef union {   /* DMA Request 1 Select Registers */
      uint16_t R;
      struct {
         uint16_t:11;
         uint16_t  DREQ1V:5;          /* DMA Request Select */
      } B;
   } mcTIMER_DREQ1_16B_tag;

