RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      int8_t mcTIMER_reserved_00C0[64];
                                           /* Watchdog Time-out Register */
      mcTIMER_WDTOL_16B_tag WDTOL;         /* offset: 0x0100 size: 16 bit */
                                           /* Watchdog Time-out Register */
      mcTIMER_WDTOH_16B_tag WDTOH;         /* offset: 0x0102 size: 16 bit */
                                               /* Fault Control Register */
      mcTIMER_FCTRL_16B_tag FCTRL;         /* offset: 0x0104 size: 16 bit */
                                                /* Fault Status Register */
      mcTIMER_FSTS_16B_tag FSTS;           /* offset: 0x0106 size: 16 bit */
                                               /* Fault Filter Registers */
      mcTIMER_FFILT_16B_tag FFILT;         /* offset: 0x0108 size: 16 bit */
      int8_t mcTIMER_reserved_010A[2];
                                             /* Channel Enable Registers */
      mcTIMER_ENBL_16B_tag ENBL;           /* offset: 0x010C size: 16 bit */
      int8_t mcTIMER_reserved_010E_C[2];
      union {
         mcTIMER_DREQ_16B_tag DREQ[4];     /* offset: 0x0110  (0x0002 x 4) */

         struct {
                                       /* DMA Request 0 Select Registers */
            mcTIMER_DREQ0_16B_tag DREQ0;   /* offset: 0x0110 size: 16 bit */
                                       /* DMA Request 1 Select Registers */
            mcTIMER_DREQ1_16B_tag DREQ1;   /* offset: 0x0112 size: 16 bit */
                                       /* DMA Request 2 Select Registers */
            mcTIMER_DREQ2_16B_tag DREQ2;   /* offset: 0x0114 size: 16 bit */
                                       /* DMA Request 3 Select Registers */
            mcTIMER_DREQ3_16B_tag DREQ3;   /* offset: 0x0116 size: 16 bit */
         };

      };
   } mcTIMER_tag;


#define mcTIMER0 (*(volatile mcTIMER_tag *) 0xFFE18000UL)
#define mcTIMER1 (*(volatile mcTIMER_tag *) 0xFFE1C000UL)
#define mcTIMER2 (*(volatile mcTIMER_tag *) 0xFFE20000UL)



/****************************************************************/
/*                                                              */
/* Module: mcPWM  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers CNT... */

   typedef union {   /* Counter Register */
      uint16_t R;
   } mcPWM_CNT_16B_tag;


   /* Register layout for all registers INIT... */

   typedef union {   /* Initial Counter Register */
      uint16_t R;
   } mcPWM_INIT_16B_tag;


   /* Register layout for all registers CTRL2... */

   typedef union {   /* Control 2 Register */
      uint16_t R;
      struct {
         uint16_t  DBGEN:1;           /* Debug Enable */
         uint16_t  WAITEN:1;          /* Wait Enable */
         uint16_t  INDEP:1;           /* Independent or Complementary Pair Operation */
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  PWM23_INIT:1;      /* PWM23 Initial Value */
#else
         uint16_t  PWMA_INIT:1;         /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  PWM45_INIT:1;      /* PWM23 Initial Value */
#else
         uint16_t  PWMB_INIT:1;         /* deprecated name - please avoid */
#endif
         uint16_t  PWMX_INIT:1;       /* PWMX Initial Value */
         uint16_t  INIT_SEL:2;        /* Initialization Control Select */
         uint16_t  FRCEN:1;           /* Force Initialization enable */
         uint16_t  FORCE:1;           /* Force Initialization */
         uint16_t  FORCE_SEL:3;       /* Force Source Select */
         uint16_t  RELOAD_SEL:1;      /* Reload Source Select */
         uint16_t  CLK_SEL:2;         /* Clock Source Select */
      } B;
   } mcPWM_CTRL2_16B_tag;


   /* Register layout for all registers CTRL1... */

   typedef union {   /* Control Register */
      uint16_t R;
      struct {
         uint16_t  LDFQ:4;            /* Load Frequency */
         uint16_t  HALF:1;            /* Half Cycle Reload */
         uint16_t  FULL:1;            /* Full Cycle Reload */
         uint16_t  DT:2;              /* Deadtime */
         uint16_t:1;
         uint16_t  PRSC:3;            /* Prescaler */
         uint16_t:1;
         uint16_t  LDMOD:1;           /* Load Mode Select */
         uint16_t:1;
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  DBL_EN:1;          /* Double Switching Enable */
#else
         uint16_t  DBLEN:1;             /* deprecated name - please avoid */
#endif
      } B;
   } mcPWM_CTRL1_16B_tag;


   /* Register layout for all registers VAL_0... */

   typedef union {   /* Value Register 0 */
      uint16_t R;
   } mcPWM_VAL_0_16B_tag;


   /* Register layout for all registers VAL_1... */

   typedef union {   /* Value Register 1 */
      uint16_t R;
   } mcPWM_VAL_1_16B_tag;


   /* Register layout for all registers VAL_2... */

   typedef union {   /* Value Register 2 */
      uint16_t R;
   } mcPWM_VAL_2_16B_tag;


   /* Register layout for all registers VAL_3... */

   typedef union {   /* Value Register 3 */
      uint16_t R;
   } mcPWM_VAL_3_16B_tag;


   /* Register layout for all registers VAL_4... */

   typedef union {   /* Value Register 4 */
      uint16_t R;
   } mcPWM_VAL_4_16B_tag;


   /* Register layout for all registers VAL_5... */

   typedef union {   /* Value Register 5 */
      uint16_t R;
   } mcPWM_VAL_5_16B_tag;

   /* Register layout for all registers OCTRL... */

   typedef union {   /* Output Control Register */
      uint16_t R;
      struct {
         uint16_t  PWMA_IN:1;         /* PWMA Input */
         uint16_t  PWMB_IN:1;         /* PWMB Input */
         uint16_t  PWMX_IN:1;         /* PWMX Input */
         uint16_t:2;
         uint16_t  POLA:1;            /* PWMA Output Polarity */
         uint16_t  POLB:1;            /* PWMB Output Polarity */
         uint16_t  POLX:1;            /* PWMX Output Polarity */
         uint16_t:2;
         uint16_t  PWMAFS:2;          /* PWMA Fault State */
         uint16_t  PWMBFS:2;          /* PWMB Fault State */
         uint16_t  PWMXFS:2;          /* PWMX Fault State */
      } B;
   } mcPWM_OCTRL_16B_tag;


