RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   /* Register layout for all registers STS... */

   typedef union {   /* Status Register */
      uint16_t R;
      struct {
         uint16_t:1;
         uint16_t  RUF:1;             /* Registers Updated Flag */
         uint16_t  REF:1;             /* Reload Error Flag */
         uint16_t  RF:1;              /* Reload Flag */
         uint16_t  CFA1:1;            /* Capture Flag A1 */
         uint16_t  CFA0:1;            /* Capture Flag A0 */
         uint16_t  CFB1:1;            /* Capture Flag B1 */
         uint16_t  CFB0:1;            /* Capture Flag B0 */
         uint16_t  CFX1:1;            /* Capture Flag X1 */
         uint16_t  CFX0:1;            /* Capture Flag X0 */
         uint16_t  CMPF:6;            /* Compare Flags */
      } B;
   } mcPWM_STS_16B_tag;


   /* Register layout for all registers INTEN... */

   typedef union {   /* Interrupt Enable Registers */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  REIE:1;            /* Reload Error Interrupt Enable */
         uint16_t  RIE:1;             /* Reload Interrupt Enable */
         uint16_t  CA1IE:1;           /* Capture A1 Interrupt Enable */
         uint16_t  CA0IE:1;           /* Capture A0 Interrupt Enable */
         uint16_t  CB1IE:1;           /* Capture B1 Interrupt Enable */
         uint16_t  CB0IE:1;           /* Capture B0 Interrupt Enable */
         uint16_t  CX1IE:1;           /* Capture X1 Interrupt Enable */
         uint16_t  CX0IE:1;           /* Capture X0 Interrupt Enable */
         uint16_t  CMPIE:6;           /* Compare Interrupt Enables */
      } B;
   } mcPWM_INTEN_16B_tag;


   /* Register layout for all registers DMAEN... */

   typedef union {   /* DMA Enable Registers */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  VALDE:1;           /* Value Register DMA Enable */
         uint16_t  FAND:1;            /* FIFO Watermark AND Control */
         uint16_t  CAPTDE:2;          /* Capture DMA Enable Source Select */
         uint16_t  CA1DE:1;           /* Capture A1 FIFO DMA Enable */
         uint16_t  CA0DE:1;           /* Capture A0 FIFO DMA Enable */
         uint16_t  CB1DE:1;           /* Capture B1 FIFO DMA Enable */
         uint16_t  CB0DE:1;           /* Capture B0 FIFO DMA Enable */
         uint16_t  CX1DE:1;           /* Capture X1 FIFO DMA Enable */
         uint16_t  CX0DE:1;           /* Capture X0 FIFO DMA Enable */
      } B;
   } mcPWM_DMAEN_16B_tag;


   /* Register layout for all registers TCTRL... */

   typedef union {   /* Output Trigger Control  Registers */
      uint16_t R;
      struct {
         uint16_t:10;
         uint16_t  OUT_TRIG_EN:6;     /* Output Trigger Enables */
      } B;
   } mcPWM_TCTRL_16B_tag;


   /* Register layout for all registers DISMAP... */

   typedef union {   /* Fault Disable Mapping   Registers */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  DISX:4;            /* PWMX Fault Disable Mask */
         uint16_t  DISB:4;            /* PWMB Fault Disable Mask */
         uint16_t  DISA:4;            /* PWMA Fault Disable Mask */
      } B;
   } mcPWM_DISMAP_16B_tag;


   /* Register layout for all registers DTCNT0... */

   typedef union {   /* Deadtime Count Register 0 */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  DTCNT0:11;         /* Deadtime Count Register 0 */
      } B;
   } mcPWM_DTCNT0_16B_tag;


   /* Register layout for all registers DTCNT1... */

   typedef union {   /* Deadtime Count Register 1 */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  DTCNT1:11;         /* Deadtime Count Register 1 */
      } B;
   } mcPWM_DTCNT1_16B_tag;

   /* Register layout for all registers CAPTCTRLX... */

   typedef union {   /* Capture Control X Register */
      uint16_t R;
      struct {
         uint16_t  CX1CNT:3;          /* Capture X1 FIFO Word Count */
         uint16_t  CX0CNT:3;          /* Capture X0 FIFO Word Count */
         uint16_t  CFXWM:2;           /* Capture X FIFOs Water Mark */
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  EDGCNTXEN:1;       /* Edge Counter X Enable */
#else
         uint16_t  EDGCNTX_EN:1;        /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  INPSELX:1;         /* Input Select X */
#else
         uint16_t  INP_SELX:1;          /* deprecated name - please avoid */
#endif
         uint16_t  EDGX1:2;           /* Edge X 1 */
         uint16_t  EDGX0:2;           /* Edge X 0 */
         uint16_t  ONESHOTX:1;        /* One Shot Mode X */
         uint16_t  ARMX:1;            /* Arm X */
      } B;
   } mcPWM_CAPTCTRLX_16B_tag;


   /* Register layout for all registers CAPTCMPX... */

   typedef union {   /* Capture Compare X Register */
      uint16_t R;
      struct {
         uint16_t  EDGCNTX:8;         /* Edge Counter X */
         uint16_t  EDGCMPX:8;         /* Edge Compare X */
      } B;
   } mcPWM_CAPTCMPX_16B_tag;


   /* Register layout for all registers CVAL0... */

   typedef union {   /* Capture Value 0 Register */
      uint16_t R;
      struct {
         uint16_t  CAPTVAL0:16;       /* Captured value from submodule counter */
      } B;
   } mcPWM_CVAL0_16B_tag;


   /* Register layout for all registers CVAL0CYC... */

   typedef union {   /* Capture Value 0 Cycle Register */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  CVAL0CYC:4;        /* Capture Value 0 Cycle */
      } B;
   } mcPWM_CVAL0CYC_16B_tag;


   /* Register layout for all registers CVAL1... */

   typedef union {   /* Capture Value 1 Register */
      uint16_t R;
      struct {
         uint16_t  CAPTVAL1:16;       /* Captured value from submodule counter */
      } B;
   } mcPWM_CVAL1_16B_tag;


   /* Register layout for all registers CVAL1CYC... */

   typedef union {   /* Capture Value 1 Cycle Register */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  CVAL1CYC:4;        /* Capture Value 1 Cycle */
      } B;
   } mcPWM_CVAL1CYC_16B_tag;


   /* Register layout for all registers CVAL3... */

   typedef union {   /* Capture Value 3 Register */
      uint16_t R;
      struct {
         uint16_t  CAPTVAL3:16;       /* Captured value from submodule counter */
      } B;
   } mcPWM_CVAL3_16B_tag;


