RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   /* Register layout for all registers CVAL3CYC... */

   typedef union {   /* Capture Value 3 Cycle Register */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  CVAL3CYC:4;        /* Capture Value 3 Cycle */
      } B;
   } mcPWM_CVAL3CYC_16B_tag;


   /* Register layout for all registers CVAL4... */

   typedef union {   /* Capture Value 4 Register */
      uint16_t R;
      struct {
         uint16_t  CAPTVAL4:16;       /* Captured value from submodule counter */
      } B;
   } mcPWM_CVAL4_16B_tag;


   /* Register layout for all registers CVAL4CYC... */

   typedef union {   /* Capture Value 4 Cycle Register */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  CVAL4CYC:4;        /* Capture Value 4 Cycle */
      } B;
   } mcPWM_CVAL4CYC_16B_tag;


   /* Register layout for all registers CVAL5... */

   typedef union {   /* Capture Value 5 Register */
      uint16_t R;
      struct {
         uint16_t  CAPTVAL5:16;       /* Captured value from submodule counter */
      } B;
   } mcPWM_CVAL5_16B_tag;


   /* Register layout for all registers CVAL5CYC... */

   typedef union {   /* Capture Value 5 Cycle Register */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  CVAL5CYC:4;        /* Capture Value 5 Cycle */
      } B;
   } mcPWM_CVAL5CYC_16B_tag;

   typedef union {   /* Output Enable Register */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  PWMA_EN:4;         /* PWMA Output Enables */
         uint16_t  PWMB_EN:4;         /* PWMB Output Enables */
         uint16_t  PWMX_EN:4;         /* PWMX Output Enables */
      } B;
   } mcPWM_OUTEN_16B_tag;

   typedef union {   /* Mask Register */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  MASKA:4;           /* PWMA Masks */
         uint16_t  MASKB:4;           /* PWMB Masks */
         uint16_t  MASKX:4;           /* PWMX Masks */
      } B;
   } mcPWM_MASK_16B_tag;

   typedef union {   /* Software Controlled Output Register */
      uint16_t R;
      struct {
         uint16_t:8;
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT23_3:1;         /* Software Controlled Output 23_3 */
#else
         uint16_t  OUTA_3:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT45_3:1;         /* Software Controlled Output 45_3 */
#else
         uint16_t  OUTB_3:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT23_2:1;         /* Software Controlled Output 23_2 */
#else
         uint16_t  OUTA_2:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT45_2:1;         /* Software Controlled Output 45_2 */
#else
         uint16_t  OUTB_2:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT23_1:1;         /* Software Controlled Output 23_1 */
#else
         uint16_t  OUTA_1:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT45_1:1;         /* Software Controlled Output 45_1 */
#else
         uint16_t  OUTB_1:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT23_0:1;         /* Software Controlled Output 23_0 */
#else
         uint16_t  OUTA_0:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  OUT45_0:1;         /* Software Controlled Output 45_0 */
#else
         uint16_t  OUTB_0:1;            /* deprecated name - please avoid */
#endif
      } B;
   } mcPWM_SWCOUT_16B_tag;

   typedef union {   /* Deadtime Source Select Register */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL23_3:2;         /* PWM23_3 Control Select */
#else
         uint16_t  SELA_3:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL45_3:2;         /* PWM45_3 Control Select */
#else
         uint16_t  SELB_3:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL23_2:2;         /* PWM23_2 Control Select */
#else
         uint16_t  SELA_2:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL45_2:2;         /* PWM45_2 Control Select */
#else
         uint16_t  SELB_2:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL23_1:2;         /* PWM23_1 Control Select */
#else
         uint16_t  SELA_1:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL45_1:2;         /* PWM45_1 Control Select */
#else
         uint16_t  SELB_1:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL23_0:2;         /* PWM23_0 Control Select */
#else
         uint16_t  SELA_0:2;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  SEL45_0:2;         /* PWM45_0 Control Select */
#else
         uint16_t  SELB_0:2;            /* deprecated name - please avoid */
#endif
      } B;
   } mcPWM_DTSRCSEL_16B_tag;

   typedef union {   /* Master Control Register */
      uint16_t R;
      struct {
         uint16_t  IPOL:4;            /* Current Polarity */
         uint16_t  RUN:4;             /* Run */
#ifndef USE_FIELD_ALIASES_mcPWM
         uint16_t  CLOK:4;            /* Clear Load Okay */
#else
         uint16_t  CLDOK:4;             /* deprecated name - please avoid */
#endif
         uint16_t  LDOK:4;            /* Load Okay */
      } B;
   } mcPWM_MCTRL_16B_tag;

   typedef union {   /* Fault Control Register */
      uint16_t R;
      struct {
         uint16_t  FLVL:4;            /* Fault Level */
         uint16_t  FAUTO:4;           /* Automatic Fault Clearing */
         uint16_t  FSAFE:4;           /* Fault Safety Mode */
         uint16_t  FIE:4;             /* Fault Interrupt Enables */
      } B;
   } mcPWM_FCTRL_16B_tag;

   typedef union {   /* Fault Status Register */
      uint16_t R;
      struct {
         uint16_t:3;
         uint16_t  FTEST:1;           /* Fault Test */
         uint16_t  FFPIN:4;           /* Filtered Fault Pins */
         uint16_t:4;
         uint16_t  FFLAG:4;           /* Fault Flags */
      } B;
   } mcPWM_FSTS_16B_tag;

   typedef union {   /* Fault Filter Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  FILT_CNT:3;        /* Fault Filter Count */
         uint16_t  FILT_PER:8;        /* Fault Filter Period */
      } B;
   } mcPWM_FFILT_16B_tag;


   /* Register layout for generated register(s) VAL... */

   typedef union {   /*  */
      uint16_t R;
   } mcPWM_VAL_16B_tag;


