RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
                                               /* Output Enable Register */
      mcPWM_OUTEN_16B_tag OUTEN;           /* offset: 0x0140 size: 16 bit */
                                                        /* Mask Register */
      mcPWM_MASK_16B_tag MASK;             /* offset: 0x0142 size: 16 bit */
                                  /* Software Controlled Output Register */
      mcPWM_SWCOUT_16B_tag SWCOUT;         /* offset: 0x0144 size: 16 bit */
                                      /* Deadtime Source Select Register */
      mcPWM_DTSRCSEL_16B_tag DTSRCSEL;     /* offset: 0x0146 size: 16 bit */
                                              /* Master Control Register */
      mcPWM_MCTRL_16B_tag MCTRL;           /* offset: 0x0148 size: 16 bit */
      int8_t mcPWM_reserved_014A[2];
                                               /* Fault Control Register */
      mcPWM_FCTRL_16B_tag FCTRL;           /* offset: 0x014C size: 16 bit */
                                                /* Fault Status Register */
      mcPWM_FSTS_16B_tag FSTS;             /* offset: 0x014E size: 16 bit */
                                                /* Fault Filter Register */
      mcPWM_FFILT_16B_tag FFILT;           /* offset: 0x0150 size: 16 bit */
   } mcPWM_tag;


#define mcPWM_A (*(volatile mcPWM_tag *) 0xFFE24000UL)
#define mcPWM_B (*(volatile mcPWM_tag *) 0xFFE28000UL)



/****************************************************************/
/*                                                              */
/* Module: LINFLEX  */
/*                                                              */
/****************************************************************/

   typedef union {   /* LIN Control Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  CCD:1;             /* Checksum Calculation Disable */
         uint32_t  CFD:1;             /* Checksum Field Disable */
         uint32_t  LASE:1;            /* LIN Auto Synchronization Enable */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  AUTOWU:1;          /* Auto Wake Up */
#else
         uint32_t  AWUM:1;              /* deprecated name - please avoid */
#endif
         uint32_t  MBL:4;             /* Master Break Length */
         uint32_t  BF:1;              /* By-Pass Filter */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  SLFM:1;            /* Selftest Mode */
#else
         uint32_t  SFTM:1;              /* deprecated name - please avoid */
#endif
         uint32_t  LBKM:1;            /* Loopback Mode */
         uint32_t  MME:1;             /* Master Mode Enable */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  SSBL:1;            /* Slave Mode Synch Break Length */
#else
         uint32_t  SSDT:1;              /* deprecated name - please avoid */
#endif
         uint32_t  RBLM:1;            /* Receiver Buffer Locked Mode */
         uint32_t  SLEEP:1;           /* Sleep Mode Request */
         uint32_t  INIT:1;            /* Initialization Mode Request */
      } B;
   } LINFLEX_LINCR1_32B_tag;

   typedef union {   /* LIN Interrupt Enable Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  SZIE:1;            /* Stuck at Zero Interrupt Enable */
         uint32_t  OCIE:1;            /* Output Compare Interrupt Enable */
         uint32_t  BEIE:1;            /* Bit Error Interrupt Enable */
         uint32_t  CEIE:1;            /* Checksum Error Interrupt Enable */
         uint32_t  HEIE:1;            /* Header Error Interrupt Enable */
         uint32_t:2;
         uint32_t  FEIE:1;            /* Frame Error Interrupt Enable */
         uint32_t  BOIE:1;            /* Buffer Overrun Error Interrupt Enable */
         uint32_t  LSIE:1;            /* LIN State Interrupt Enable */
         uint32_t  WUIE:1;            /* Wakeup Interrupt Enable */
         uint32_t  DBFIE:1;           /* Data Buffer Full Interrupt Enable */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  DBEIE_TOIE:1;      /* Data Buffer Empty Interrupt Enable */
#else
         uint32_t  DBEIE:1;             /* deprecated name - please avoid */
#endif
         uint32_t  DRIE:1;            /* Data Reception complete Interrupt Enable */
         uint32_t  DTIE:1;            /* Data Transmitted Interrupt Enable */
         uint32_t  HRIE:1;            /* Header Received Interrupt Enable */
      } B;
   } LINFLEX_LINIER_32B_tag;

   typedef union {   /* LIN Status Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  LINS:4;            /* LIN State */
         uint32_t:2;
         uint32_t  RMB:1;             /* Release Message Buffer */
         uint32_t:1;
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  RXBUSY:1;          /* Receiver Busy Flag */
#else
         uint32_t  RBSY:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  RDI:1;             /* LIN Receive Signal */
#else
         uint32_t  RPS:1;               /* deprecated name - please avoid */
#endif
         uint32_t  WUF:1;             /* Wake Up Flag */
         uint32_t  DBFF:1;            /* Data Buffer Full Flag */
         uint32_t  DBEF:1;            /* Data Buffer Empty Flag */
         uint32_t  DRF:1;             /* Data Reception Completed Flag */
         uint32_t  DTF:1;             /* Data Transmission Completed Flag */
         uint32_t  HRF:1;             /* Header Received Flag */
      } B;
   } LINFLEX_LINSR_32B_tag;

   typedef union {   /* LIN Error Status Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  SZF:1;             /* Stuck at Zero Flag */
         uint32_t  OCF:1;             /* Output Compare Flag */
         uint32_t  BEF:1;             /* Bit Error Flag */
         uint32_t  CEF:1;             /* Checksum Error Flag */
         uint32_t  SFEF:1;            /* Sync Field Error Flag */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  SDEF:1;            /* Sync Delimiter Error Flag */
#else
         uint32_t  BDEF:1;              /* deprecated name - please avoid */
#endif
         uint32_t  IDPEF:1;           /* ID Parity Error Flag */
         uint32_t  FEF:1;             /* Framing Error Flag */
         uint32_t  BOF:1;             /* Buffer Overrun Flag */
         uint32_t:6;
         uint32_t  NF:1;              /* Noise Flag */
      } B;
   } LINFLEX_LINESR_32B_tag;

   typedef union {   /* UART Mode Control Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  TDFL_TFC:3;        /* Transmitter Data Field Length/TX FIFO Counter */
         uint32_t  RDFL_RFC0:3;       /* Reception Data Field Length/RX FIFO Counter */
         uint32_t  RFBM:1;            /* RX FIFO/ Buffer Mode */
         uint32_t  TFBM:1;            /* TX FIFO/ Buffer Mode */
         uint32_t  WL1:1;             /* Word Length in UART mode - bit 1 */
         uint32_t  PC1:1;             /* Parity Check - bit 1 */
         uint32_t  RXEN:1;            /* Receiver Enable */
         uint32_t  TXEN:1;            /* Transmitter Enable */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  PC0:1;             /* Parity Check - bit 0 */
#else
         uint32_t  OP:1;                /* deprecated name - please avoid */
#endif
         uint32_t  PCE:1;             /* Parity Control Enable */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  WL0:1;             /* Word Length in UART Mode - bit 0 */
#else
         uint32_t  WL:1;                /* deprecated name - please avoid */
#endif
         uint32_t  UART:1;            /* UART Mode */
      } B;
   } LINFLEX_UARTCR_32B_tag;

   typedef union {   /* UART Mode Status Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  SZF:1;             /* Stuck at Zero Flag */
         uint32_t  OCF:1;             /* Output Compare Flag */
         uint32_t  PE:4;              /* Parity Error Flag */
         uint32_t  RMB:1;             /* Release Message Buffer */
         uint32_t  FEF:1;             /* Framing Error Flag */
         uint32_t  BOF:1;             /* Buffer Overrun Flag */
         uint32_t  RDI:1;             /* Receiver Data Input Signal */
         uint32_t  WUF:1;             /* Wakeup Flag */
         uint32_t:1;
         uint32_t  TO:1;              /* Time Out */
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  DRF_RFE:1;         /* Data Reception Completed Flag/RX FIFO Empty Flag */
#else
         uint32_t  DRF:1;               /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  DTF_TFF:1;         /* Data Transmission Completed Flag/TX FIFO Full Flag */
#else
         uint32_t  DTF:1;               /* deprecated name - please avoid */
#endif
         uint32_t  NF:1;              /* Noise Flag */
      } B;
   } LINFLEX_UARTSR_32B_tag;

   typedef union {   /* LIN Time-Out Control Status Register */
      uint32_t R;
      struct {
         uint32_t:21;
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  MODE:1;            /* Time-out Counter Mode */
#else
         uint32_t  LTOM:1;              /* deprecated name - please avoid */
#endif
         uint32_t  IOT:1;             /* Idle on Timeout */
         uint32_t  TOCE:1;            /* Time-Out Counter Enable */
         uint32_t  CNT:8;             /* Counter Value */
      } B;
   } LINFLEX_LINTCSR_32B_tag;

   typedef union {   /* LIN Output Compare Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  OC2:8;             /* Output Compare Value 2 */
         uint32_t  OC1:8;             /* Output Compare Value 1 */
      } B;
   } LINFLEX_LINOCR_32B_tag;

