RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* LIN Time-Out Control Register */
      uint32_t R;
      struct {
         uint32_t:20;
         uint32_t  RTO:4;             /* Response Time-Out Value */
         uint32_t:1;
         uint32_t  HTO:7;             /* Header Time-Out Value */
      } B;
   } LINFLEX_LINTOCR_32B_tag;

   typedef union {   /* LIN Fractional Baud Rate Register */
      uint32_t R;
      struct {
         uint32_t:28;
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  FBR:4;             /* Fractional Baud Rates */
#else
         uint32_t  DIV_F:4;             /* deprecated name - please avoid */
#endif
      } B;
   } LINFLEX_LINFBRR_32B_tag;

   typedef union {   /* LIN Integer Baud Rate Register */
      uint32_t R;
      struct {
         uint32_t:13;
#ifndef USE_FIELD_ALIASES_LINFLEX
         uint32_t  IBR:19;            /* Integer Baud Rates */
#else
         uint32_t  DIV_M:19;            /* deprecated name - please avoid */
#endif
      } B;
   } LINFLEX_LINIBRR_32B_tag;

   typedef union {   /* LIN Checksum Field Register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  CF:8;              /* Checksum Bits */
      } B;
   } LINFLEX_LINCFR_32B_tag;

   typedef union {   /* LIN Control Register 2 */
      uint32_t R;
      struct {
         uint32_t:17;
         uint32_t  IOBE:1;            /* Idle on Bit Error */
         uint32_t  IOPE:1;            /* Idle on Identifier Parity Error */
         uint32_t  WURQ:1;            /* Wakeup Generate Request */
         uint32_t  DDRQ:1;            /* Data Discard Request */
         uint32_t  DTRQ:1;            /* Data Transmission Request */
         uint32_t  ABRQ:1;            /* Abort Request */
         uint32_t  HTRQ:1;            /* Header Transmission Request */
         uint32_t:8;
      } B;
   } LINFLEX_LINCR2_32B_tag;

   typedef union {   /* Buffer Identifier Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  DFL:6;             /* Data Field Length */
         uint32_t  DIR:1;             /* Direction */
         uint32_t  CCS:1;             /* Classic Checksum */
         uint32_t:2;
         uint32_t  ID:6;              /* Identifier */
      } B;
   } LINFLEX_BIDR_32B_tag;

   typedef union {   /* Buffer Data Register Least Significant */
      uint32_t R;
      struct {
         uint32_t  DATA3:8;           /* Data3 */
         uint32_t  DATA2:8;           /* Data2 */
         uint32_t  DATA1:8;           /* Data1 */
         uint32_t  DATA0:8;           /* Data0 */
      } B;
   } LINFLEX_BDRL_32B_tag;

   typedef union {   /* Buffer Data Register Most Significant */
      uint32_t R;
      struct {
         uint32_t  DATA7:8;           /* Data7 */
         uint32_t  DATA6:8;           /* Data6 */
         uint32_t  DATA5:8;           /* Data5 */
         uint32_t  DATA4:8;           /* Data4 */
      } B;
   } LINFLEX_BDRM_32B_tag;

   typedef union {   /* Identifier Filter Enable Register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  FACT:8;            /* Filter Active */
      } B;
   } LINFLEX_IFER_32B_tag;

   typedef union {   /* Identifier Filter Match Index */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  IFMI_IFMI:4;       /* Filter Match Index */
      } B;
   } LINFLEX_IFMI_32B_tag;

   typedef union {   /* Identifier Filter Mode Register */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  IFM:4;             /* Filter Mode */
      } B;
   } LINFLEX_IFMR_32B_tag;


   /* Register layout for all registers IFCR... */

   typedef union {   /* Identifier Filter Control Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  DFL:6;             /* Data Field Length */
         uint32_t  DIR:1;             /* Direction */
         uint32_t  CCS:1;             /* Classic Checksum */
         uint32_t:2;
         uint32_t  ID:6;              /* Identifier */
      } B;
   } LINFLEX_IFCR_32B_tag;

   typedef union {   /* Global Control Register */
      uint32_t R;
      struct {
         uint32_t:26;
         uint32_t  TDFBM:1;           /* Transmit Data First Bit MSB */
         uint32_t  RDFBM:1;           /* Received Data First Bit MSB */
         uint32_t  TDLIS:1;           /* Transmit Data Level Inversion Selection */
         uint32_t  RDLIS:1;           /* Received Data Level Inversion Selection */
         uint32_t  STOP:1;            /* 1/2 stop bit configuration */
         uint32_t  SR:1;              /* Soft Reset */
      } B;
   } LINFLEX_GCR_32B_tag;

   typedef union {   /* UART Preset Time Out Register */
      uint32_t R;
      struct {
         uint32_t:20;
         uint32_t  PTO:12;            /* Preset Time Out */
      } B;
   } LINFLEX_UARTPTO_32B_tag;

   typedef union {   /* UART Current Time Out Register */
      uint32_t R;
      struct {
         uint32_t:20;
         uint32_t  CTO:12;            /* Current Time Out */
      } B;
   } LINFLEX_UARTCTO_32B_tag;

   typedef union {   /* DMA TX Enable Register */
      uint32_t R;
      struct {
         uint32_t:17;
         uint32_t  DTE:15;            /* DMA Tx channel Enable */
      } B;
   } LINFLEX_DMATXE_32B_tag;

   typedef union {   /* DMA RX Enable Register */
      uint32_t R;
      struct {
         uint32_t:17;
         uint32_t  DRE:15;            /* DMA Rx channel Enable */
      } B;
   } LINFLEX_DMARXE_32B_tag;



   typedef struct LINFLEX_struct_tag { /* start of LINFLEX_tag */
                                                 /* LIN Control Register */
      LINFLEX_LINCR1_32B_tag LINCR1;       /* offset: 0x0000 size: 32 bit */
                                        /* LIN Interrupt Enable Register */
      LINFLEX_LINIER_32B_tag LINIER;       /* offset: 0x0004 size: 32 bit */
                                                  /* LIN Status Register */
      LINFLEX_LINSR_32B_tag LINSR;         /* offset: 0x0008 size: 32 bit */
                                            /* LIN Error Status Register */
      LINFLEX_LINESR_32B_tag LINESR;       /* offset: 0x000C size: 32 bit */
                                           /* UART Mode Control Register */
      LINFLEX_UARTCR_32B_tag UARTCR;       /* offset: 0x0010 size: 32 bit */
                                            /* UART Mode Status Register */
      LINFLEX_UARTSR_32B_tag UARTSR;       /* offset: 0x0014 size: 32 bit */
                                 /* LIN Time-Out Control Status Register */
      LINFLEX_LINTCSR_32B_tag LINTCSR;     /* offset: 0x0018 size: 32 bit */
                                          /* LIN Output Compare Register */
      LINFLEX_LINOCR_32B_tag LINOCR;       /* offset: 0x001C size: 32 bit */
                                        /* LIN Time-Out Control Register */
      LINFLEX_LINTOCR_32B_tag LINTOCR;     /* offset: 0x0020 size: 32 bit */
                                    /* LIN Fractional Baud Rate Register */
      LINFLEX_LINFBRR_32B_tag LINFBRR;     /* offset: 0x0024 size: 32 bit */
                                       /* LIN Integer Baud Rate Register */
      LINFLEX_LINIBRR_32B_tag LINIBRR;     /* offset: 0x0028 size: 32 bit */
                                          /* LIN Checksum Field Register */
      LINFLEX_LINCFR_32B_tag LINCFR;       /* offset: 0x002C size: 32 bit */
                                               /* LIN Control Register 2 */
      LINFLEX_LINCR2_32B_tag LINCR2;       /* offset: 0x0030 size: 32 bit */
                                           /* Buffer Identifier Register */
      LINFLEX_BIDR_32B_tag BIDR;           /* offset: 0x0034 size: 32 bit */
                               /* Buffer Data Register Least Significant */
      LINFLEX_BDRL_32B_tag BDRL;           /* offset: 0x0038 size: 32 bit */
                                /* Buffer Data Register Most Significant */
      LINFLEX_BDRM_32B_tag BDRM;           /* offset: 0x003C size: 32 bit */
                                    /* Identifier Filter Enable Register */
      LINFLEX_IFER_32B_tag IFER;           /* offset: 0x0040 size: 32 bit */
                                        /* Identifier Filter Match Index */
      LINFLEX_IFMI_32B_tag IFMI;           /* offset: 0x0044 size: 32 bit */
                                      /* Identifier Filter Mode Register */
      LINFLEX_IFMR_32B_tag IFMR;           /* offset: 0x0048 size: 32 bit */
      union {
                                   /* Identifier Filter Control Register */
         LINFLEX_IFCR_32B_tag IFCR[8];     /* offset: 0x004C  (0x0004 x 8) */

