RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
                                   /* Identifier Filter Control Register */
            LINFLEX_IFCR_32B_tag IFCR0;    /* offset: 0x004C size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR1;    /* offset: 0x0050 size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR2;    /* offset: 0x0054 size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR3;    /* offset: 0x0058 size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR4;    /* offset: 0x005C size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR5;    /* offset: 0x0060 size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR6;    /* offset: 0x0064 size: 32 bit */
            LINFLEX_IFCR_32B_tag IFCR7;    /* offset: 0x0068 size: 32 bit */
         };

      };
      int8_t LINFLEX_reserved_006C[32];
                                              /* Global Control Register */
      LINFLEX_GCR_32B_tag GCR;             /* offset: 0x008C size: 32 bit */
                                        /* UART Preset Time Out Register */
      LINFLEX_UARTPTO_32B_tag UARTPTO;     /* offset: 0x0090 size: 32 bit */
                                       /* UART Current Time Out Register */
      LINFLEX_UARTCTO_32B_tag UARTCTO;     /* offset: 0x0094 size: 32 bit */
                                               /* DMA TX Enable Register */
      LINFLEX_DMATXE_32B_tag DMATXE;       /* offset: 0x0098 size: 32 bit */
                                               /* DMA RX Enable Register */
      LINFLEX_DMARXE_32B_tag DMARXE;       /* offset: 0x009C size: 32 bit */
   } LINFLEX_tag;


#define LINFLEX0 (*(volatile LINFLEX_tag *) 0xFFE40000UL)
#define LINFLEX1 (*(volatile LINFLEX_tag *) 0xFFE44000UL)



/****************************************************************/
/*                                                              */
/* Module: CRC  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers CFG... */

   typedef union {   /* CRC_CFG - CRC Configuration register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
      struct {
         uint32_t:29;
         uint32_t  POLYG:1;           /* Polynomal selection 0- CRC-CCITT, 1- CRC-CRC-32 INV selection */
         uint32_t  SWAP:1;            /* SWAP selection */
         uint32_t  INV:1;             /* INV selection */
      } B;
   } CRC_CFG_32B_tag;


   /* Register layout for all registers INP... */

   typedef union {   /* CRC_INP - CRC Input register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
   } CRC_INP_32B_tag;


   /* Register layout for all registers CSTAT... */

   typedef union {   /* CRC_STATUS - CRC Status register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
   } CRC_CSTAT_32B_tag;


   /* Register layout for all registers OUTP... */

   typedef union {   /* CRC_STATUS - CRC OUTPUT register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint16_t  HALF[2];    /* individual halfwords can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
   } CRC_OUTP_32B_tag;


   typedef struct CRC_CNTX_struct_tag {

                                 /* CRC_CFG - CRC Configuration register */
      CRC_CFG_32B_tag CFG;                /* relative offset: 0x0000 */
                                         /* CRC_INP - CRC Input register */
      CRC_INP_32B_tag INP;                /* relative offset: 0x0004 */
                                     /* CRC_STATUS - CRC Status register */
      CRC_CSTAT_32B_tag CSTAT;            /* relative offset: 0x0008 */
                                     /* CRC_STATUS - CRC OUTPUT register */
      CRC_OUTP_32B_tag OUTP;              /* relative offset: 0x000C */

   } CRC_CNTX_tag;


   typedef struct CRC_struct_tag { /* start of CRC_tag */
      union {
                                                   /*  Register set CNTX */
         CRC_CNTX_tag CNTX[3];             /* offset: 0x0000  (0x0010 x 3) */

         struct {
                                 /* CRC_CFG - CRC Configuration register */
            CRC_CFG_32B_tag CFG0;          /* offset: 0x0000 size: 32 bit */
                                         /* CRC_INP - CRC Input register */
            CRC_INP_32B_tag INP0;          /* offset: 0x0004 size: 32 bit */
                                     /* CRC_STATUS - CRC Status register */
            CRC_CSTAT_32B_tag CSTAT0;      /* offset: 0x0008 size: 32 bit */
                                     /* CRC_STATUS - CRC OUTPUT register */
            CRC_OUTP_32B_tag OUTP0;        /* offset: 0x000C size: 32 bit */
                                 /* CRC_CFG - CRC Configuration register */
            CRC_CFG_32B_tag CFG1;          /* offset: 0x0010 size: 32 bit */
                                         /* CRC_INP - CRC Input register */
            CRC_INP_32B_tag INP1;          /* offset: 0x0014 size: 32 bit */
                                     /* CRC_STATUS - CRC Status register */
            CRC_CSTAT_32B_tag CSTAT1;      /* offset: 0x0018 size: 32 bit */
                                     /* CRC_STATUS - CRC OUTPUT register */
            CRC_OUTP_32B_tag OUTP1;        /* offset: 0x001C size: 32 bit */
                                 /* CRC_CFG - CRC Configuration register */
            CRC_CFG_32B_tag CFG2;          /* offset: 0x0020 size: 32 bit */
                                         /* CRC_INP - CRC Input register */
            CRC_INP_32B_tag INP2;          /* offset: 0x0024 size: 32 bit */
                                     /* CRC_STATUS - CRC Status register */
            CRC_CSTAT_32B_tag CSTAT2;      /* offset: 0x0028 size: 32 bit */
                                     /* CRC_STATUS - CRC OUTPUT register */
            CRC_OUTP_32B_tag OUTP2;        /* offset: 0x002C size: 32 bit */
         };

