RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
   } CRC_tag;


#define CRC   (*(volatile CRC_tag *) 0xFFE68000UL)



/****************************************************************/
/*                                                              */
/* Module: FCCU  */
/*                                                              */
/****************************************************************/

   typedef union {   /* FCCU Control Register */
      uint32_t R;
      struct {
         uint32_t:23;
         uint32_t  NVML:1;            /* NVM configuration loaded */
         uint32_t  OPS:2;             /* Operation status */
         uint32_t:1;
         uint32_t  OPR:5;             /* Operation run */
      } B;
   } FCCU_CTRL_32B_tag;

   typedef union {   /* FCCU CTRL Key Register */
      uint32_t R;
   } FCCU_CTRLK_32B_tag;

   typedef union {   /* FCCU Configuration Register */
      uint32_t R;
      struct {
         uint32_t:10;
         uint32_t  RCCE1:1;           /* RCC1 enable */
         uint32_t  RCCE0:1;           /* RCC0 enable */
         uint32_t  SMRT:4;            /* Safe Mode Request Timer */
         uint32_t:4;
         uint32_t  CM:1;              /* Config mode */
         uint32_t  SM:1;              /* Switching mode */
         uint32_t  PS:1;              /* Polarity Selection */
         uint32_t  FOM:3;             /* Fault Output Mode Selection */
         uint32_t  FOP:6;             /* Fault Output Prescaler */
      } B;
   } FCCU_CFG_32B_tag;

   typedef union {   /* FCCU CF Configuration Register 0 */
      uint32_t R;
      struct {
         uint32_t  CFC31:1;           /* CF 31 configuration */
         uint32_t  CFC30:1;           /* CF 30 configuration */
         uint32_t  CFC29:1;           /* CF 29 configuration */
         uint32_t  CFC28:1;           /* CF 28 configuration */
         uint32_t  CFC27:1;           /* CF 27 configuration */
         uint32_t  CFC26:1;           /* CF 26 configuration */
         uint32_t  CFC25:1;           /* CF 25 configuration */
         uint32_t  CFC24:1;           /* CF 24 configuration */
         uint32_t  CFC23:1;           /* CF 23 configuration */
         uint32_t  CFC22:1;           /* CF 22 configuration */
         uint32_t  CFC21:1;           /* CF 21 configuration */
         uint32_t  CFC20:1;           /* CF 20 configuration */
         uint32_t  CFC19:1;           /* CF 19 configuration */
         uint32_t  CFC18:1;           /* CF 18 configuration */
         uint32_t  CFC17:1;           /* CF 17 configuration */
         uint32_t  CFC16:1;           /* CF 16 configuration */
         uint32_t  CFC15:1;           /* CF 15 configuration */
         uint32_t  CFC14:1;           /* CF 14 configuration */
         uint32_t  CFC13:1;           /* CF 13 configuration */
         uint32_t  CFC12:1;           /* CF 12 configuration */
         uint32_t  CFC11:1;           /* CF 11 configuration */
         uint32_t  CFC10:1;           /* CF 10 configuration */
         uint32_t  CFC9:1;            /* CF 9 configuration */
         uint32_t  CFC8:1;            /* CF 8 configuration */
         uint32_t  CFC7:1;            /* CF 7 configuration */
         uint32_t  CFC6:1;            /* CF 6 configuration */
         uint32_t  CFC5:1;            /* CF 5 configuration */
         uint32_t  CFC4:1;            /* CF 4 configuration */
         uint32_t  CFC3:1;            /* CF 3 configuration */
         uint32_t  CFC2:1;            /* CF 2 configuration */
         uint32_t  CFC1:1;            /* CF 1 configuration */
         uint32_t  CFC0:1;            /* CF 0 configuration */
      } B;
   } FCCU_CF_CFG0_32B_tag;

   typedef union {   /* FCCU CF Configuration Register 1 */
      uint32_t R;
      struct {
         uint32_t  CFC63:1;           /* CF 63 configuration */
         uint32_t  CFC62:1;           /* CF 62 configuration */
         uint32_t  CFC61:1;           /* CF 61 configuration */
         uint32_t  CFC60:1;           /* CF 60 configuration */
         uint32_t  CFC59:1;           /* CF 59 configuration */
         uint32_t  CFC58:1;           /* CF 58 configuration */
         uint32_t  CFC57:1;           /* CF 57 configuration */
         uint32_t  CFC56:1;           /* CF 56 configuration */
         uint32_t  CFC55:1;           /* CF 55 configuration */
         uint32_t  CFC54:1;           /* CF 54 configuration */
         uint32_t  CFC53:1;           /* CF 53 configuration */
         uint32_t  CFC52:1;           /* CF 52 configuration */
         uint32_t  CFC51:1;           /* CF 51 configuration */
         uint32_t  CFC50:1;           /* CF 50 configuration */
         uint32_t  CFC49:1;           /* CF 49 configuration */
         uint32_t  CFC48:1;           /* CF 48 configuration */
         uint32_t  CFC47:1;           /* CF 47 configuration */
         uint32_t  CFC46:1;           /* CF 46 configuration */
         uint32_t  CFC45:1;           /* CF 45 configuration */
         uint32_t  CFC44:1;           /* CF 44 configuration */
         uint32_t  CFC43:1;           /* CF 43 configuration */
         uint32_t  CFC42:1;           /* CF 42 configuration */
         uint32_t  CFC41:1;           /* CF 41 configuration */
         uint32_t  CFC40:1;           /* CF 40 configuration */
         uint32_t  CFC39:1;           /* CF 39 configuration */
         uint32_t  CFC38:1;           /* CF 38 configuration */
         uint32_t  CFC37:1;           /* CF 37 configuration */
         uint32_t  CFC36:1;           /* CF 36 configuration */
         uint32_t  CFC35:1;           /* CF 35 configuration */
         uint32_t  CFC34:1;           /* CF 34 configuration */
         uint32_t  CFC33:1;           /* CF 33 configuration */
         uint32_t  CFC32:1;           /* CF 32 configuration */
      } B;
   } FCCU_CF_CFG1_32B_tag;

   typedef union {   /* FCCU CF Configuration Register 2 */
      uint32_t R;
      struct {
         uint32_t  CFC95:1;           /* CF 95 configuration */
         uint32_t  CFC94:1;           /* CF 94 configuration */
         uint32_t  CFC93:1;           /* CF 93 configuration */
         uint32_t  CFC92:1;           /* CF 92 configuration */
         uint32_t  CFC91:1;           /* CF 91 configuration */
         uint32_t  CFC90:1;           /* CF 90 configuration */
         uint32_t  CFC89:1;           /* CF 89 configuration */
         uint32_t  CFC88:1;           /* CF 88 configuration */
         uint32_t  CFC87:1;           /* CF 87 configuration */
         uint32_t  CFC86:1;           /* CF 86 configuration */
         uint32_t  CFC85:1;           /* CF 85 configuration */
         uint32_t  CFC84:1;           /* CF 84 configuration */
         uint32_t  CFC83:1;           /* CF 83 configuration */
         uint32_t  CFC82:1;           /* CF 82 configuration */
         uint32_t  CFC81:1;           /* CF 81 configuration */
         uint32_t  CFC80:1;           /* CF 80 configuration */
         uint32_t  CFC79:1;           /* CF 79 configuration */
         uint32_t  CFC78:1;           /* CF 78 configuration */
         uint32_t  CFC77:1;           /* CF 77 configuration */
         uint32_t  CFC76:1;           /* CF 76 configuration */
         uint32_t  CFC75:1;           /* CF 75 configuration */
         uint32_t  CFC74:1;           /* CF 74 configuration */
         uint32_t  CFC73:1;           /* CF 73 configuration */
         uint32_t  CFC72:1;           /* CF 72 configuration */
         uint32_t  CFC71:1;           /* CF 71 configuration */
         uint32_t  CFC70:1;           /* CF 70 configuration */
         uint32_t  CFC69:1;           /* CF 69 configuration */
         uint32_t  CFC68:1;           /* CF 68 configuration */
         uint32_t  CFC67:1;           /* CF 67 configuration */
         uint32_t  CFC66:1;           /* CF 66 configuration */
         uint32_t  CFC65:1;           /* CF 65 configuration */
         uint32_t  CFC64:1;           /* CF 64 configuration */
      } B;
   } FCCU_CF_CFG2_32B_tag;

   typedef union {   /* FCCU CF Configuration Register 3 */
      uint32_t R;
      struct {
         uint32_t  CFC127:1;          /* CF 127 configuration */
         uint32_t  CFC126:1;          /* CF 126 configuration */
         uint32_t  CFC125:1;          /* CF 125 configuration */
         uint32_t  CFC124:1;          /* CF 124 configuration */
         uint32_t  CFC123:1;          /* CF 123 configuration */
         uint32_t  CFC122:1;          /* CF 122 configuration */
         uint32_t  CFC121:1;          /* CF 121 configuration */
         uint32_t  CFC120:1;          /* CF 120 configuration */
         uint32_t  CFC119:1;          /* CF 119 configuration */
         uint32_t  CFC118:1;          /* CF 118 configuration */
         uint32_t  CFC117:1;          /* CF 117 configuration */
         uint32_t  CFC116:1;          /* CF 116 configuration */
         uint32_t  CFC115:1;          /* CF 115 configuration */
         uint32_t  CFC114:1;          /* CF 114 configuration */
         uint32_t  CFC113:1;          /* CF 113 configuration */
         uint32_t  CFC112:1;          /* CF 112 configuration */
         uint32_t  CFC111:1;          /* CF 111 configuration */
         uint32_t  CFC110:1;          /* CF 110 configuration */
         uint32_t  CFC109:1;          /* CF 109 configuration */
         uint32_t  CFC108:1;          /* CF 108 configuration */
         uint32_t  CFC107:1;          /* CF 107 configuration */
         uint32_t  CFC106:1;          /* CF 106 configuration */
         uint32_t  CFC105:1;          /* CF 105 configuration */
         uint32_t  CFC104:1;          /* CF 104 configuration */
         uint32_t  CFC103:1;          /* CF 103 configuration */
         uint32_t  CFC102:1;          /* CF 102 configuration */
         uint32_t  CFC101:1;          /* CF 101 configuration */
         uint32_t  CFC100:1;          /* CF 100 configuration */
         uint32_t  CFC99:1;           /* CF 99 configuration */
         uint32_t  CFC98:1;           /* CF 98 configuration */
         uint32_t  CFC97:1;           /* CF 97 configuration */
         uint32_t  CFC96:1;           /* CF 96 configuration */
      } B;
   } FCCU_CF_CFG3_32B_tag;

