RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU NCF Configuration Register 0 */
      uint32_t R;
      struct {
         uint32_t  NCFC31:1;          /* NCF 31 configuration */
         uint32_t  NCFC30:1;          /* NCF 30 configuration */
         uint32_t  NCFC29:1;          /* NCF 29 configuration */
         uint32_t  NCFC28:1;          /* NCF 28 configuration */
         uint32_t  NCFC27:1;          /* NCF 27 configuration */
         uint32_t  NCFC26:1;          /* NCF 26 configuration */
         uint32_t  NCFC25:1;          /* NCF 25 configuration */
         uint32_t  NCFC24:1;          /* NCF 24 configuration */
         uint32_t  NCFC23:1;          /* NCF 23 configuration */
         uint32_t  NCFC22:1;          /* NCF 22 configuration */
         uint32_t  NCFC21:1;          /* NCF 21 configuration */
         uint32_t  NCFC20:1;          /* NCF 20 configuration */
         uint32_t  NCFC19:1;          /* NCF 19 configuration */
         uint32_t  NCFC18:1;          /* NCF 18 configuration */
         uint32_t  NCFC17:1;          /* NCF 17 configuration */
         uint32_t  NCFC16:1;          /* NCF 16 configuration */
         uint32_t  NCFC15:1;          /* NCF 15 configuration */
         uint32_t  NCFC14:1;          /* NCF 14 configuration */
         uint32_t  NCFC13:1;          /* NCF 13 configuration */
         uint32_t  NCFC12:1;          /* NCF 12 configuration */
         uint32_t  NCFC11:1;          /* NCF 11 configuration */
         uint32_t  NCFC10:1;          /* NCF 10 configuration */
         uint32_t  NCFC9:1;           /* NCF 9 configuration */
         uint32_t  NCFC8:1;           /* NCF 8 configuration */
         uint32_t  NCFC7:1;           /* NCF 7 configuration */
         uint32_t  NCFC6:1;           /* NCF 6 configuration */
         uint32_t  NCFC5:1;           /* NCF 5 configuration */
         uint32_t  NCFC4:1;           /* NCF 4 configuration */
         uint32_t  NCFC3:1;           /* NCF 3 configuration */
         uint32_t  NCFC2:1;           /* NCF 2 configuration */
         uint32_t  NCFC1:1;           /* NCF 1 configuration */
         uint32_t  NCFC0:1;           /* NCF 0 configuration */
      } B;
   } FCCU_NCF_CFG0_32B_tag;

   typedef union {   /* FCCU NCF Configuration Register 1 */
      uint32_t R;
      struct {
         uint32_t  NCFC63:1;          /* NCF 63 configuration */
         uint32_t  NCFC62:1;          /* NCF 62 configuration */
         uint32_t  NCFC61:1;          /* NCF 61 configuration */
         uint32_t  NCFC60:1;          /* NCF 60 configuration */
         uint32_t  NCFC59:1;          /* NCF 59 configuration */
         uint32_t  NCFC58:1;          /* NCF 58 configuration */
         uint32_t  NCFC57:1;          /* NCF 57 configuration */
         uint32_t  NCFC56:1;          /* NCF 56 configuration */
         uint32_t  NCFC55:1;          /* NCF 55 configuration */
         uint32_t  NCFC54:1;          /* NCF 54 configuration */
         uint32_t  NCFC53:1;          /* NCF 53 configuration */
         uint32_t  NCFC52:1;          /* NCF 52 configuration */
         uint32_t  NCFC51:1;          /* NCF 51 configuration */
         uint32_t  NCFC50:1;          /* NCF 50 configuration */
         uint32_t  NCFC49:1;          /* NCF 49 configuration */
         uint32_t  NCFC48:1;          /* NCF 48 configuration */
         uint32_t  NCFC47:1;          /* NCF 47 configuration */
         uint32_t  NCFC46:1;          /* NCF 46 configuration */
         uint32_t  NCFC45:1;          /* NCF 45 configuration */
         uint32_t  NCFC44:1;          /* NCF 44 configuration */
         uint32_t  NCFC43:1;          /* NCF 43 configuration */
         uint32_t  NCFC42:1;          /* NCF 42 configuration */
         uint32_t  NCFC41:1;          /* NCF 41 configuration */
         uint32_t  NCFC40:1;          /* NCF 40 configuration */
         uint32_t  NCFC39:1;          /* NCF 39 configuration */
         uint32_t  NCFC38:1;          /* NCF 38 configuration */
         uint32_t  NCFC37:1;          /* NCF 37 configuration */
         uint32_t  NCFC36:1;          /* NCF 36 configuration */
         uint32_t  NCFC35:1;          /* NCF 35 configuration */
         uint32_t  NCFC34:1;          /* NCF 34 configuration */
         uint32_t  NCFC33:1;          /* NCF 33 configuration */
         uint32_t  NCFC32:1;          /* NCF 32 configuration */
      } B;
   } FCCU_NCF_CFG1_32B_tag;

   typedef union {   /* FCCU NCF Configuration Register 2 */
      uint32_t R;
      struct {
         uint32_t  NCFC95:1;          /* NCF 95 configuration */
         uint32_t  NCFC94:1;          /* NCF 94 configuration */
         uint32_t  NCFC93:1;          /* NCF 93 configuration */
         uint32_t  NCFC92:1;          /* NCF 92 configuration */
         uint32_t  NCFC91:1;          /* NCF 91 configuration */
         uint32_t  NCFC90:1;          /* NCF 90 configuration */
         uint32_t  NCFC89:1;          /* NCF 89 configuration */
         uint32_t  NCFC88:1;          /* NCF 88 configuration */
         uint32_t  NCFC87:1;          /* NCF 87 configuration */
         uint32_t  NCFC86:1;          /* NCF 86 configuration */
         uint32_t  NCFC85:1;          /* NCF 85 configuration */
         uint32_t  NCFC84:1;          /* NCF 84 configuration */
         uint32_t  NCFC83:1;          /* NCF 83 configuration */
         uint32_t  NCFC82:1;          /* NCF 82 configuration */
         uint32_t  NCFC81:1;          /* NCF 81 configuration */
         uint32_t  NCFC80:1;          /* NCF 80 configuration */
         uint32_t  NCFC79:1;          /* NCF 79 configuration */
         uint32_t  NCFC78:1;          /* NCF 78 configuration */
         uint32_t  NCFC77:1;          /* NCF 77 configuration */
         uint32_t  NCFC76:1;          /* NCF 76 configuration */
         uint32_t  NCFC75:1;          /* NCF 75 configuration */
         uint32_t  NCFC74:1;          /* NCF 74 configuration */
         uint32_t  NCFC73:1;          /* NCF 73 configuration */
         uint32_t  NCFC72:1;          /* NCF 72 configuration */
         uint32_t  NCFC71:1;          /* NCF 71 configuration */
         uint32_t  NCFC70:1;          /* NCF 70 configuration */
         uint32_t  NCFC69:1;          /* NCF 69 configuration */
         uint32_t  NCFC68:1;          /* NCF 68 configuration */
         uint32_t  NCFC67:1;          /* NCF 67 configuration */
         uint32_t  NCFC66:1;          /* NCF 66 configuration */
         uint32_t  NCFC65:1;          /* NCF 65 configuration */
         uint32_t  NCFC64:1;          /* NCF 64 configuration */
      } B;
   } FCCU_NCF_CFG2_32B_tag;

   typedef union {   /* FCCU NCF Configuration Register 3 */
      uint32_t R;
      struct {
         uint32_t  NCFC127:1;         /* NCF 127 configuration */
         uint32_t  NCFC126:1;         /* NCF 126 configuration */
         uint32_t  NCFC125:1;         /* NCF 125 configuration */
         uint32_t  NCFC124:1;         /* NCF 124 configuration */
         uint32_t  NCFC123:1;         /* NCF 123 configuration */
         uint32_t  NCFC122:1;         /* NCF 122 configuration */
         uint32_t  NCFC121:1;         /* NCF 121 configuration */
         uint32_t  NCFC120:1;         /* NCF 120 configuration */
         uint32_t  NCFC119:1;         /* NCF 119 configuration */
         uint32_t  NCFC118:1;         /* NCF 118 configuration */
         uint32_t  NCFC117:1;         /* NCF 117 configuration */
         uint32_t  NCFC116:1;         /* NCF 116 configuration */
         uint32_t  NCFC115:1;         /* NCF 115 configuration */
         uint32_t  NCFC114:1;         /* NCF 114 configuration */
         uint32_t  NCFC113:1;         /* NCF 113 configuration */
         uint32_t  NCFC112:1;         /* NCF 112 configuration */
         uint32_t  NCFC111:1;         /* NCF 111 configuration */
         uint32_t  NCFC110:1;         /* NCF 110 configuration */
         uint32_t  NCFC109:1;         /* NCF 109 configuration */
         uint32_t  NCFC108:1;         /* NCF 108 configuration */
         uint32_t  NCFC107:1;         /* NCF 107 configuration */
         uint32_t  NCFC106:1;         /* NCF 106 configuration */
         uint32_t  NCFC105:1;         /* NCF 105 configuration */
         uint32_t  NCFC104:1;         /* NCF 104 configuration */
         uint32_t  NCFC103:1;         /* NCF 103 configuration */
         uint32_t  NCFC102:1;         /* NCF 102 configuration */
         uint32_t  NCFC101:1;         /* NCF 101 configuration */
         uint32_t  NCFC100:1;         /* NCF 100 configuration */
         uint32_t  NCFC99:1;          /* NCF 99 configuration */
         uint32_t  NCFC98:1;          /* NCF 98 configuration */
         uint32_t  NCFC97:1;          /* NCF 97 configuration */
         uint32_t  NCFC96:1;          /* NCF 96 configuration */
      } B;
   } FCCU_NCF_CFG3_32B_tag;

   typedef union {   /* FCCU CFS Configuration Register 0 */
      uint32_t R;
      struct {
         uint32_t  CFSC15:2;          /* CF 15 state configuration */
         uint32_t  CFSC14:2;          /* CF 14 state configuration */
         uint32_t  CFSC13:2;          /* CF 13 state configuration */
         uint32_t  CFSC12:2;          /* CF 12 state configuration */
         uint32_t  CFSC11:2;          /* CF 11 state configuration */
         uint32_t  CFSC10:2;          /* CF 10 state configuration */
         uint32_t  CFSC9:2;           /* CF 9 state configuration */
         uint32_t  CFSC8:2;           /* CF 8 state configuration */
         uint32_t  CFSC7:2;           /* CF 7 state configuration */
         uint32_t  CFSC6:2;           /* CF 6 state configuration */
         uint32_t  CFSC5:2;           /* CF 5 state configuration */
         uint32_t  CFSC4:2;           /* CF 4 state configuration */
         uint32_t  CFSC3:2;           /* CF 3 state configuration */
         uint32_t  CFSC2:2;           /* CF 2 state configuration */
         uint32_t  CFSC1:2;           /* CF 1 state configuration */
         uint32_t  CFSC0:2;           /* CF 0 state configuration */
      } B;
   } FCCU_CFS_CFG0_32B_tag;

