RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU CFS Configuration Register 1 */
      uint32_t R;
      struct {
         uint32_t  CFSC31:2;          /* CF 31 state configuration */
         uint32_t  CFSC30:2;          /* CF 30 state configuration */
         uint32_t  CFSC29:2;          /* CF 29 state configuration */
         uint32_t  CFSC28:2;          /* CF 28 state configuration */
         uint32_t  CFSC27:2;          /* CF 27 state configuration */
         uint32_t  CFSC26:2;          /* CF 26 state configuration */
         uint32_t  CFSC25:2;          /* CF 25 state configuration */
         uint32_t  CFSC24:2;          /* CF 24 state configuration */
         uint32_t  CFSC23:2;          /* CF 23 state configuration */
         uint32_t  CFSC22:2;          /* CF 22 state configuration */
         uint32_t  CFSC21:2;          /* CF 21 state configuration */
         uint32_t  CFSC20:2;          /* CF 20 state configuration */
         uint32_t  CFSC19:2;          /* CF 19 state configuration */
         uint32_t  CFSC18:2;          /* CF 18 state configuration */
         uint32_t  CFSC17:2;          /* CF 17 state configuration */
         uint32_t  CFSC16:2;          /* CF 16 state configuration */
      } B;
   } FCCU_CFS_CFG1_32B_tag;

   typedef union {   /* FCCU CFS Configuration Register 2 */
      uint32_t R;
      struct {
         uint32_t  CFSC47:2;          /* CF 47 state configuration */
         uint32_t  CFSC46:2;          /* CF 46 state configuration */
         uint32_t  CFSC45:2;          /* CF 45 state configuration */
         uint32_t  CFSC44:2;          /* CF 44 state configuration */
         uint32_t  CFSC43:2;          /* CF 43 state configuration */
         uint32_t  CFSC42:2;          /* CF 42 state configuration */
         uint32_t  CFSC41:2;          /* CF 41 state configuration */
         uint32_t  CFSC40:2;          /* CF 40 state configuration */
         uint32_t  CFSC39:2;          /* CF 39 state configuration */
         uint32_t  CFSC38:2;          /* CF 38 state configuration */
         uint32_t  CFSC37:2;          /* CF 37 state configuration */
         uint32_t  CFSC36:2;          /* CF 36 state configuration */
         uint32_t  CFSC35:2;          /* CF 35 state configuration */
         uint32_t  CFSC34:2;          /* CF 34 state configuration */
         uint32_t  CFSC33:2;          /* CF 33 state configuration */
         uint32_t  CFSC32:2;          /* CF 32 state configuration */
      } B;
   } FCCU_CFS_CFG2_32B_tag;

   typedef union {   /* FCCU CFS Configuration Register 3 */
      uint32_t R;
      struct {
         uint32_t  CFSC63:2;          /* CF 63 state configuration */
         uint32_t  CFSC62:2;          /* CF 62 state configuration */
         uint32_t  CFSC61:2;          /* CF 61 state configuration */
         uint32_t  CFSC60:2;          /* CF 60 state configuration */
         uint32_t  CFSC59:2;          /* CF 59 state configuration */
         uint32_t  CFSC58:2;          /* CF 58 state configuration */
         uint32_t  CFSC57:2;          /* CF 57 state configuration */
         uint32_t  CFSC56:2;          /* CF 56 state configuration */
         uint32_t  CFSC55:2;          /* CF 55 state configuration */
         uint32_t  CFSC54:2;          /* CF 54 state configuration */
         uint32_t  CFSC53:2;          /* CF 53 state configuration */
         uint32_t  CFSC52:2;          /* CF 52 state configuration */
         uint32_t  CFSC51:2;          /* CF 51 state configuration */
         uint32_t  CFSC50:2;          /* CF 50 state configuration */
         uint32_t  CFSC49:2;          /* CF 49 state configuration */
         uint32_t  CFSC48:2;          /* CF 48 state configuration */
      } B;
   } FCCU_CFS_CFG3_32B_tag;

   typedef union {   /* FCCU CFS Configuration Register 4 */
      uint32_t R;
      struct {
         uint32_t  CFSC79:2;          /* CF 79 state configuration */
         uint32_t  CFSC78:2;          /* CF 78 state configuration */
         uint32_t  CFSC77:2;          /* CF 77 state configuration */
         uint32_t  CFSC76:2;          /* CF 76 state configuration */
         uint32_t  CFSC75:2;          /* CF 75 state configuration */
         uint32_t  CFSC74:2;          /* CF 74 state configuration */
         uint32_t  CFSC73:2;          /* CF 73 state configuration */
         uint32_t  CFSC72:2;          /* CF 72 state configuration */
         uint32_t  CFSC71:2;          /* CF 71 state configuration */
         uint32_t  CFSC70:2;          /* CF 70 state configuration */
         uint32_t  CFSC69:2;          /* CF 69 state configuration */
         uint32_t  CFSC68:2;          /* CF 68 state configuration */
         uint32_t  CFSC67:2;          /* CF 67 state configuration */
         uint32_t  CFSC66:2;          /* CF 66 state configuration */
         uint32_t  CFSC65:2;          /* CF 65 state configuration */
         uint32_t  CFSC64:2;          /* CF 64 state configuration */
      } B;
   } FCCU_CFS_CFG4_32B_tag;

   typedef union {   /* FCCU CFS Configuration Register 5 */
      uint32_t R;
      struct {
         uint32_t  CFSC95:2;          /* CF 95 state configuration */
         uint32_t  CFSC94:2;          /* CF 94 state configuration */
         uint32_t  CFSC93:2;          /* CF 93 state configuration */
         uint32_t  CFSC92:2;          /* CF 92 state configuration */
         uint32_t  CFSC91:2;          /* CF 91 state configuration */
         uint32_t  CFSC90:2;          /* CF 90 state configuration */
         uint32_t  CFSC89:2;          /* CF 89 state configuration */
         uint32_t  CFSC88:2;          /* CF 88 state configuration */
         uint32_t  CFSC87:2;          /* CF 87 state configuration */
         uint32_t  CFSC86:2;          /* CF 86 state configuration */
         uint32_t  CFSC85:2;          /* CF 85 state configuration */
         uint32_t  CFSC84:2;          /* CF 84 state configuration */
         uint32_t  CFSC83:2;          /* CF 83 state configuration */
         uint32_t  CFSC82:2;          /* CF 82 state configuration */
         uint32_t  CFSC81:2;          /* CF 81 state configuration */
         uint32_t  CFSC80:2;          /* CF 80 state configuration */
      } B;
   } FCCU_CFS_CFG5_32B_tag;

   typedef union {   /* FCCU CFS Configuration Register 6 */
      uint32_t R;
      struct {
         uint32_t  CFSC111:2;         /* CF 111 state configuration */
         uint32_t  CFSC110:2;         /* CF 110 state configuration */
         uint32_t  CFSC109:2;         /* CF 109 state configuration */
         uint32_t  CFSC108:2;         /* CF 108 state configuration */
         uint32_t  CFSC107:2;         /* CF 107 state configuration */
         uint32_t  CFSC106:2;         /* CF 106 state configuration */
         uint32_t  CFSC105:2;         /* CF 105 state configuration */
         uint32_t  CFSC104:2;         /* CF 104 state configuration */
         uint32_t  CFSC103:2;         /* CF 103 state configuration */
         uint32_t  CFSC102:2;         /* CF 102 state configuration */
         uint32_t  CFSC101:2;         /* CF 101 state configuration */
         uint32_t  CFSC100:2;         /* CF 100 state configuration */
         uint32_t  CFSC99:2;          /* CF 99 state configuration */
         uint32_t  CFSC98:2;          /* CF 98 state configuration */
         uint32_t  CFSC97:2;          /* CF 97 state configuration */
         uint32_t  CFSC96:2;          /* CF 96 state configuration */
      } B;
   } FCCU_CFS_CFG6_32B_tag;

