RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU CFS Configuration Register 7 */
      uint32_t R;
      struct {
         uint32_t  CFSC127:2;         /* CF 127 state configuration */
         uint32_t  CFSC126:2;         /* CF 126 state configuration */
         uint32_t  CFSC125:2;         /* CF 125 state configuration */
         uint32_t  CFSC124:2;         /* CF 124 state configuration */
         uint32_t  CFSC123:2;         /* CF 123 state configuration */
         uint32_t  CFSC122:2;         /* CF 122 state configuration */
         uint32_t  CFSC121:2;         /* CF 121 state configuration */
         uint32_t  CFSC120:2;         /* CF 120 state configuration */
         uint32_t  CFSC119:2;         /* CF 119 state configuration */
         uint32_t  CFSC118:2;         /* CF 118 state configuration */
         uint32_t  CFSC117:2;         /* CF 117 state configuration */
         uint32_t  CFSC116:2;         /* CF 116 state configuration */
         uint32_t  CFSC115:2;         /* CF 115 state configuration */
         uint32_t  CFSC114:2;         /* CF 114 state configuration */
         uint32_t  CFSC113:2;         /* CF 113 state configuration */
         uint32_t  CFSC112:2;         /* CF 112 state configuration */
      } B;
   } FCCU_CFS_CFG7_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 0 */
      uint32_t R;
      struct {
         uint32_t  NCFSC15:2;         /* NCF 15 state configuration */
         uint32_t  NCFSC14:2;         /* NCF 14 state configuration */
         uint32_t  NCFSC13:2;         /* NCF 13 state configuration */
         uint32_t  NCFSC12:2;         /* NCF 12 state configuration */
         uint32_t  NCFSC11:2;         /* NCF 11 state configuration */
         uint32_t  NCFSC10:2;         /* NCF 10 state configuration */
         uint32_t  NCFSC9:2;          /* NCF 9 state configuration */
         uint32_t  NCFSC8:2;          /* NCF 8 state configuration */
         uint32_t  NCFSC7:2;          /* NCF 7 state configuration */
         uint32_t  NCFSC6:2;          /* NCF 6 state configuration */
         uint32_t  NCFSC5:2;          /* NCF 5 state configuration */
         uint32_t  NCFSC4:2;          /* NCF 4 state configuration */
         uint32_t  NCFSC3:2;          /* NCF 3 state configuration */
         uint32_t  NCFSC2:2;          /* NCF 2 state configuration */
         uint32_t  NCFSC1:2;          /* NCF 1 state configuration */
         uint32_t  NCFSC0:2;          /* NCF 0 state configuration */
      } B;
   } FCCU_NCFS_CFG0_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 1 */
      uint32_t R;
      struct {
         uint32_t  NCFSC31:2;         /* NCF 31 state configuration */
         uint32_t  NCFSC30:2;         /* NCF 30 state configuration */
         uint32_t  NCFSC29:2;         /* NCF 29 state configuration */
         uint32_t  NCFSC28:2;         /* NCF 28 state configuration */
         uint32_t  NCFSC27:2;         /* NCF 27 state configuration */
         uint32_t  NCFSC26:2;         /* NCF 26 state configuration */
         uint32_t  NCFSC25:2;         /* NCF 25 state configuration */
         uint32_t  NCFSC24:2;         /* NCF 24 state configuration */
         uint32_t  NCFSC23:2;         /* NCF 23 state configuration */
         uint32_t  NCFSC22:2;         /* NCF 22 state configuration */
         uint32_t  NCFSC21:2;         /* NCF 21 state configuration */
         uint32_t  NCFSC20:2;         /* NCF 20 state configuration */
         uint32_t  NCFSC19:2;         /* NCF 19 state configuration */
         uint32_t  NCFSC18:2;         /* NCF 18 state configuration */
         uint32_t  NCFSC17:2;         /* NCF 17 state configuration */
         uint32_t  NCFSC16:2;         /* NCF 16 state configuration */
      } B;
   } FCCU_NCFS_CFG1_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 2 */
      uint32_t R;
      struct {
         uint32_t  NCFSC47:2;         /* NCF 47 state configuration */
         uint32_t  NCFSC46:2;         /* NCF 46 state configuration */
         uint32_t  NCFSC45:2;         /* NCF 45 state configuration */
         uint32_t  NCFSC44:2;         /* NCF 44 state configuration */
         uint32_t  NCFSC43:2;         /* NCF 43 state configuration */
         uint32_t  NCFSC42:2;         /* NCF 42 state configuration */
         uint32_t  NCFSC41:2;         /* NCF 41 state configuration */
         uint32_t  NCFSC40:2;         /* NCF 40 state configuration */
         uint32_t  NCFSC39:2;         /* NCF 39 state configuration */
         uint32_t  NCFSC38:2;         /* NCF 38 state configuration */
         uint32_t  NCFSC37:2;         /* NCF 37 state configuration */
         uint32_t  NCFSC36:2;         /* NCF 36 state configuration */
         uint32_t  NCFSC35:2;         /* NCF 35 state configuration */
         uint32_t  NCFSC34:2;         /* NCF 34 state configuration */
         uint32_t  NCFSC33:2;         /* NCF 33 state configuration */
         uint32_t  NCFSC32:2;         /* NCF 32 state configuration */
      } B;
   } FCCU_NCFS_CFG2_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 3 */
      uint32_t R;
      struct {
         uint32_t  NCFSC63:2;         /* NCF 63 state configuration */
         uint32_t  NCFSC62:2;         /* NCF 62 state configuration */
         uint32_t  NCFSC61:2;         /* NCF 61 state configuration */
         uint32_t  NCFSC60:2;         /* NCF 60 state configuration */
         uint32_t  NCFSC59:2;         /* NCF 59 state configuration */
         uint32_t  NCFSC58:2;         /* NCF 58 state configuration */
         uint32_t  NCFSC57:2;         /* NCF 57 state configuration */
         uint32_t  NCFSC56:2;         /* NCF 56 state configuration */
         uint32_t  NCFSC55:2;         /* NCF 55 state configuration */
         uint32_t  NCFSC54:2;         /* NCF 54 state configuration */
         uint32_t  NCFSC53:2;         /* NCF 53 state configuration */
         uint32_t  NCFSC52:2;         /* NCF 52 state configuration */
         uint32_t  NCFSC51:2;         /* NCF 51 state configuration */
         uint32_t  NCFSC50:2;         /* NCF 50 state configuration */
         uint32_t  NCFSC49:2;         /* NCF 49 state configuration */
         uint32_t  NCFSC48:2;         /* NCF 48 state configuration */
      } B;
   } FCCU_NCFS_CFG3_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 4 */
      uint32_t R;
      struct {
         uint32_t  NCFSC79:2;         /* NCF 79 state configuration */
         uint32_t  NCFSC78:2;         /* NCF 78 state configuration */
         uint32_t  NCFSC77:2;         /* NCF 77 state configuration */
         uint32_t  NCFSC76:2;         /* NCF 76 state configuration */
         uint32_t  NCFSC75:2;         /* NCF 75 state configuration */
         uint32_t  NCFSC74:2;         /* NCF 74 state configuration */
         uint32_t  NCFSC73:2;         /* NCF 73 state configuration */
         uint32_t  NCFSC72:2;         /* NCF 72 state configuration */
         uint32_t  NCFSC71:2;         /* NCF 71 state configuration */
         uint32_t  NCFSC70:2;         /* NCF 70 state configuration */
         uint32_t  NCFSC69:2;         /* NCF 69 state configuration */
         uint32_t  NCFSC68:2;         /* NCF 68 state configuration */
         uint32_t  NCFSC67:2;         /* NCF 67 state configuration */
         uint32_t  NCFSC66:2;         /* NCF 66 state configuration */
         uint32_t  NCFSC65:2;         /* NCF 65 state configuration */
         uint32_t  NCFSC64:2;         /* NCF 64 state configuration */
      } B;
   } FCCU_NCFS_CFG4_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 5 */
      uint32_t R;
      struct {
         uint32_t  NCFSC95:2;         /* NCF 95 state configuration */
         uint32_t  NCFSC94:2;         /* NCF 94 state configuration */
         uint32_t  NCFSC93:2;         /* NCF 93 state configuration */
         uint32_t  NCFSC92:2;         /* NCF 92 state configuration */
         uint32_t  NCFSC91:2;         /* NCF 91 state configuration */
         uint32_t  NCFSC90:2;         /* NCF 90 state configuration */
         uint32_t  NCFSC89:2;         /* NCF 89 state configuration */
         uint32_t  NCFSC88:2;         /* NCF 88 state configuration */
         uint32_t  NCFSC87:2;         /* NCF 87 state configuration */
         uint32_t  NCFSC86:2;         /* NCF 86 state configuration */
         uint32_t  NCFSC85:2;         /* NCF 85 state configuration */
         uint32_t  NCFSC84:2;         /* NCF 84 state configuration */
         uint32_t  NCFSC83:2;         /* NCF 83 state configuration */
         uint32_t  NCFSC82:2;         /* NCF 82 state configuration */
         uint32_t  NCFSC81:2;         /* NCF 81 state configuration */
         uint32_t  NCFSC80:2;         /* NCF 80 state configuration */
      } B;
   } FCCU_NCFS_CFG5_32B_tag;

