RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU NCFS Configuration Register 6 */
      uint32_t R;
      struct {
         uint32_t  NCFSC111:2;        /* NCF 111 state configuration */
         uint32_t  NCFSC110:2;        /* NCF 110 state configuration */
         uint32_t  NCFSC109:2;        /* NCF 109 state configuration */
         uint32_t  NCFSC108:2;        /* NCF 108 state configuration */
         uint32_t  NCFSC107:2;        /* NCF 107 state configuration */
         uint32_t  NCFSC106:2;        /* NCF 106 state configuration */
         uint32_t  NCFSC105:2;        /* NCF 105 state configuration */
         uint32_t  NCFSC104:2;        /* NCF 104 state configuration */
         uint32_t  NCFSC103:2;        /* NCF 103 state configuration */
         uint32_t  NCFSC102:2;        /* NCF 102 state configuration */
         uint32_t  NCFSC101:2;        /* NCF 101 state configuration */
         uint32_t  NCFSC100:2;        /* NCF 100 state configuration */
         uint32_t  NCFSC99:2;         /* NCF 99 state configuration */
         uint32_t  NCFSC98:2;         /* NCF 98 state configuration */
         uint32_t  NCFSC97:2;         /* NCF 97 state configuration */
         uint32_t  NCFSC96:2;         /* NCF 96 state configuration */
      } B;
   } FCCU_NCFS_CFG6_32B_tag;

   typedef union {   /* FCCU NCFS Configuration Register 7 */
      uint32_t R;
      struct {
         uint32_t  NCFSC127:2;        /* NCF 127 state configuration */
         uint32_t  NCFSC126:2;        /* NCF 126 state configuration */
         uint32_t  NCFSC125:2;        /* NCF 125 state configuration */
         uint32_t  NCFSC124:2;        /* NCF 124 state configuration */
         uint32_t  NCFSC123:2;        /* NCF 123 state configuration */
         uint32_t  NCFSC122:2;        /* NCF 122 state configuration */
         uint32_t  NCFSC121:2;        /* NCF 121 state configuration */
         uint32_t  NCFSC120:2;        /* NCF 120 state configuration */
         uint32_t  NCFSC119:2;        /* NCF 119 state configuration */
         uint32_t  NCFSC118:2;        /* NCF 118 state configuration */
         uint32_t  NCFSC117:2;        /* NCF 117 state configuration */
         uint32_t  NCFSC116:2;        /* NCF 116 state configuration */
         uint32_t  NCFSC115:2;        /* NCF 115 state configuration */
         uint32_t  NCFSC114:2;        /* NCF 114 state configuration */
         uint32_t  NCFSC113:2;        /* NCF 113 state configuration */
         uint32_t  NCFSC112:2;        /* NCF 112 state configuration */
      } B;
   } FCCU_NCFS_CFG7_32B_tag;

   typedef union {   /* FCCU CF Status Register 0 */
      uint32_t R;
      struct {
         uint32_t  CFS31:1;           /* CF 31 status */
         uint32_t  CFS30:1;           /* CF 30 status */
         uint32_t  CFS29:1;           /* CF 29 status */
         uint32_t  CFS28:1;           /* CF 28 status */
         uint32_t  CFS27:1;           /* CF 27 status */
         uint32_t  CFS26:1;           /* CF 26 status */
         uint32_t  CFS25:1;           /* CF 25 status */
         uint32_t  CFS24:1;           /* CF 24 status */
         uint32_t  CFS23:1;           /* CF 23 status */
         uint32_t  CFS22:1;           /* CF 22 status */
         uint32_t  CFS21:1;           /* CF 21 status */
         uint32_t  CFS20:1;           /* CF 20 status */
         uint32_t  CFS19:1;           /* CF 19 status */
         uint32_t  CFS18:1;           /* CF 18 status */
         uint32_t  CFS17:1;           /* CF 17 status */
         uint32_t  CFS16:1;           /* CF 16 status */
         uint32_t  CFS15:1;           /* CF 15 status */
         uint32_t  CFS14:1;           /* CF 14 status */
         uint32_t  CFS13:1;           /* CF 13 status */
         uint32_t  CFS12:1;           /* CF 12 status */
         uint32_t  CFS11:1;           /* CF 11 status */
         uint32_t  CFS10:1;           /* CF 10 status */
         uint32_t  CFS9:1;            /* CF 9 status */
         uint32_t  CFS8:1;            /* CF 8 status */
         uint32_t  CFS7:1;            /* CF 7 status */
         uint32_t  CFS6:1;            /* CF 6 status */
         uint32_t  CFS5:1;            /* CF 5 status */
         uint32_t  CFS4:1;            /* CF 4 status */
         uint32_t  CFS3:1;            /* CF 3 status */
         uint32_t  CFS2:1;            /* CF 2 status */
         uint32_t  CFS1:1;            /* CF 1 status */
         uint32_t  CFS0:1;            /* CF 0 status */
      } B;
   } FCCU_CFS0_32B_tag;

   typedef union {   /* FCCU CF Status Register 1 */
      uint32_t R;
      struct {
         uint32_t  CFS63:1;           /* CF 63 status */
         uint32_t  CFS62:1;           /* CF 62 status */
         uint32_t  CFS61:1;           /* CF 61 status */
         uint32_t  CFS60:1;           /* CF 60 status */
         uint32_t  CFS59:1;           /* CF 59 status */
         uint32_t  CFS58:1;           /* CF 58 status */
         uint32_t  CFS57:1;           /* CF 57 status */
         uint32_t  CFS56:1;           /* CF 56 status */
         uint32_t  CFS55:1;           /* CF 55 status */
         uint32_t  CFS54:1;           /* CF 54 status */
         uint32_t  CFS53:1;           /* CF 53 status */
         uint32_t  CFS52:1;           /* CF 52 status */
         uint32_t  CFS51:1;           /* CF 51 status */
         uint32_t  CFS50:1;           /* CF 50 status */
         uint32_t  CFS49:1;           /* CF 49 status */
         uint32_t  CFS48:1;           /* CF 48 status */
         uint32_t  CFS47:1;           /* CF 47 status */
         uint32_t  CFS46:1;           /* CF 46 status */
         uint32_t  CFS45:1;           /* CF 45 status */
         uint32_t  CFS44:1;           /* CF 44 status */
         uint32_t  CFS43:1;           /* CF 43 status */
         uint32_t  CFS42:1;           /* CF 42 status */
         uint32_t  CFS41:1;           /* CF 41 status */
         uint32_t  CFS40:1;           /* CF 40 status */
         uint32_t  CFS39:1;           /* CF 39 status */
         uint32_t  CFS38:1;           /* CF 38 status */
         uint32_t  CFS37:1;           /* CF 37 status */
         uint32_t  CFS36:1;           /* CF 36 status */
         uint32_t  CFS35:1;           /* CF 35 status */
         uint32_t  CFS34:1;           /* CF 34 status */
         uint32_t  CFS33:1;           /* CF 33 status */
         uint32_t  CFS32:1;           /* CF 32 status */
      } B;
   } FCCU_CFS1_32B_tag;

   typedef union {   /* FCCU CF Status Register 2 */
      uint32_t R;
      struct {
         uint32_t  CFS95:1;           /* CF 95 status */
         uint32_t  CFS94:1;           /* CF 94 status */
         uint32_t  CFS93:1;           /* CF 93 status */
         uint32_t  CFS92:1;           /* CF 92 status */
         uint32_t  CFS91:1;           /* CF 91 status */
         uint32_t  CFS90:1;           /* CF 90 status */
         uint32_t  CFS89:1;           /* CF 89 status */
         uint32_t  CFS88:1;           /* CF 88 status */
         uint32_t  CFS87:1;           /* CF 87 status */
         uint32_t  CFS86:1;           /* CF 86 status */
         uint32_t  CFS85:1;           /* CF 85 status */
         uint32_t  CFS84:1;           /* CF 84 status */
         uint32_t  CFS83:1;           /* CF 83 status */
         uint32_t  CFS82:1;           /* CF 82 status */
         uint32_t  CFS81:1;           /* CF 81 status */
         uint32_t  CFS80:1;           /* CF 80 status */
         uint32_t  CFS79:1;           /* CF 79 status */
         uint32_t  CFS78:1;           /* CF 78 status */
         uint32_t  CFS77:1;           /* CF 77 status */
         uint32_t  CFS76:1;           /* CF 76 status */
         uint32_t  CFS75:1;           /* CF 75 status */
         uint32_t  CFS74:1;           /* CF 74 status */
         uint32_t  CFS73:1;           /* CF 73 status */
         uint32_t  CFS72:1;           /* CF 72 status */
         uint32_t  CFS71:1;           /* CF 71 status */
         uint32_t  CFS70:1;           /* CF 70 status */
         uint32_t  CFS69:1;           /* CF 69 status */
         uint32_t  CFS68:1;           /* CF 68 status */
         uint32_t  CFS67:1;           /* CF 67 status */
         uint32_t  CFS66:1;           /* CF 66 status */
         uint32_t  CFS65:1;           /* CF 65 status */
         uint32_t  CFS64:1;           /* CF 64 status */
      } B;
   } FCCU_CFS2_32B_tag;

