RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU CF Status Register 3 */
      uint32_t R;
      struct {
         uint32_t  CFS127:1;          /* CF 127 status */
         uint32_t  CFS126:1;          /* CF 126 status */
         uint32_t  CFS125:1;          /* CF 125 status */
         uint32_t  CFS124:1;          /* CF 124 status */
         uint32_t  CFS123:1;          /* CF 123 status */
         uint32_t  CFS122:1;          /* CF 122 status */
         uint32_t  CFS121:1;          /* CF 121 status */
         uint32_t  CFS120:1;          /* CF 120 status */
         uint32_t  CFS119:1;          /* CF 119 status */
         uint32_t  CFS118:1;          /* CF 118 status */
         uint32_t  CFS117:1;          /* CF 117 status */
         uint32_t  CFS116:1;          /* CF 116 status */
         uint32_t  CFS115:1;          /* CF 115 status */
         uint32_t  CFS114:1;          /* CF 114 status */
         uint32_t  CFS113:1;          /* CF 113 status */
         uint32_t  CFS112:1;          /* CF 112 status */
         uint32_t  CFS111:1;          /* CF 111 status */
         uint32_t  CFS110:1;          /* CF 110 status */
         uint32_t  CFS109:1;          /* CF 109 status */
         uint32_t  CFS108:1;          /* CF 108 status */
         uint32_t  CFS107:1;          /* CF 107 status */
         uint32_t  CFS106:1;          /* CF 106 status */
         uint32_t  CFS105:1;          /* CF 105 status */
         uint32_t  CFS104:1;          /* CF 104 status */
         uint32_t  CFS103:1;          /* CF 103 status */
         uint32_t  CFS102:1;          /* CF 102 status */
         uint32_t  CFS101:1;          /* CF 101 status */
         uint32_t  CFS100:1;          /* CF 100 status */
         uint32_t  CFS99:1;           /* CF 99 status */
         uint32_t  CFS98:1;           /* CF 98 status */
         uint32_t  CFS97:1;           /* CF 97 status */
         uint32_t  CFS96:1;           /* CF 96 status */
      } B;
   } FCCU_CFS3_32B_tag;

   typedef union {   /* FCCU_CFK - FCCU CF Key Register */
      uint32_t R;
   } FCCU_CFK_32B_tag;

   typedef union {   /* FCCU NCF Status Register 0 */
      uint32_t R;
      struct {
         uint32_t  NCFS31:1;          /* NCF 31 status */
         uint32_t  NCFS30:1;          /* NCF 30 status */
         uint32_t  NCFS29:1;          /* NCF 29 status */
         uint32_t  NCFS28:1;          /* NCF 28 status */
         uint32_t  NCFS27:1;          /* NCF 27 status */
         uint32_t  NCFS26:1;          /* NCF 26 status */
         uint32_t  NCFS25:1;          /* NCF 25 status */
         uint32_t  NCFS24:1;          /* NCF 24 status */
         uint32_t  NCFS23:1;          /* NCF 23 status */
         uint32_t  NCFS22:1;          /* NCF 22 status */
         uint32_t  NCFS21:1;          /* NCF 21 status */
         uint32_t  NCFS20:1;          /* NCF 20 status */
         uint32_t  NCFS19:1;          /* NCF 19 status */
         uint32_t  NCFS18:1;          /* NCF 18 status */
         uint32_t  NCFS17:1;          /* NCF 17 status */
         uint32_t  NCFS16:1;          /* NCF 16 status */
         uint32_t  NCFS15:1;          /* NCF 15 status */
         uint32_t  NCFS14:1;          /* NCF 14 status */
         uint32_t  NCFS13:1;          /* NCF 13 status */
         uint32_t  NCFS12:1;          /* NCF 12 status */
         uint32_t  NCFS11:1;          /* NCF 11 status */
         uint32_t  NCFS10:1;          /* NCF 10 status */
         uint32_t  NCFS9:1;           /* NCF 9 status */
         uint32_t  NCFS8:1;           /* NCF 8 status */
         uint32_t  NCFS7:1;           /* NCF 7 status */
         uint32_t  NCFS6:1;           /* NCF 6 status */
         uint32_t  NCFS5:1;           /* NCF 5 status */
         uint32_t  NCFS4:1;           /* NCF 4 status */
         uint32_t  NCFS3:1;           /* NCF 3 status */
         uint32_t  NCFS2:1;           /* NCF 2 status */
         uint32_t  NCFS1:1;           /* NCF 1 status */
         uint32_t  NCFS0:1;           /* NCF 0 status */
      } B;
   } FCCU_NCFS0_32B_tag;

   typedef union {   /* FCCU NCF Status Register 1 */
      uint32_t R;
      struct {
         uint32_t  NCFS63:1;          /* NCF 63 status */
         uint32_t  NCFS62:1;          /* NCF 62 status */
         uint32_t  NCFS61:1;          /* NCF 61 status */
         uint32_t  NCFS60:1;          /* NCF 60 status */
         uint32_t  NCFS59:1;          /* NCF 59 status */
         uint32_t  NCFS58:1;          /* NCF 58 status */
         uint32_t  NCFS57:1;          /* NCF 57 status */
         uint32_t  NCFS56:1;          /* NCF 56 status */
         uint32_t  NCFS55:1;          /* NCF 55 status */
         uint32_t  NCFS54:1;          /* NCF 54 status */
         uint32_t  NCFS53:1;          /* NCF 53 status */
         uint32_t  NCFS52:1;          /* NCF 52 status */
         uint32_t  NCFS51:1;          /* NCF 51 status */
         uint32_t  NCFS50:1;          /* NCF 50 status */
         uint32_t  NCFS49:1;          /* NCF 49 status */
         uint32_t  NCFS48:1;          /* NCF 48 status */
         uint32_t  NCFS47:1;          /* NCF 47 status */
         uint32_t  NCFS46:1;          /* NCF 46 status */
         uint32_t  NCFS45:1;          /* NCF 45 status */
         uint32_t  NCFS44:1;          /* NCF 44 status */
         uint32_t  NCFS43:1;          /* NCF 43 status */
         uint32_t  NCFS42:1;          /* NCF 42 status */
         uint32_t  NCFS41:1;          /* NCF 41 status */
         uint32_t  NCFS40:1;          /* NCF 40 status */
         uint32_t  NCFS39:1;          /* NCF 39 status */
         uint32_t  NCFS38:1;          /* NCF 38 status */
         uint32_t  NCFS37:1;          /* NCF 37 status */
         uint32_t  NCFS36:1;          /* NCF 36 status */
         uint32_t  NCFS35:1;          /* NCF 35 status */
         uint32_t  NCFS34:1;          /* NCF 34 status */
         uint32_t  NCFS33:1;          /* NCF 33 status */
         uint32_t  NCFS32:1;          /* NCF 32 status */
      } B;
   } FCCU_NCFS1_32B_tag;

   typedef union {   /* FCCU NCF Status Register 2 */
      uint32_t R;
      struct {
         uint32_t  NCFS95:1;          /* NCF 95 status */
         uint32_t  NCFS94:1;          /* NCF 94 status */
         uint32_t  NCFS93:1;          /* NCF 93 status */
         uint32_t  NCFS92:1;          /* NCF 92 status */
         uint32_t  NCFS91:1;          /* NCF 91 status */
         uint32_t  NCFS90:1;          /* NCF 90 status */
         uint32_t  NCFS89:1;          /* NCF 89 status */
         uint32_t  NCFS88:1;          /* NCF 88 status */
         uint32_t  NCFS87:1;          /* NCF 87 status */
         uint32_t  NCFS86:1;          /* NCF 86 status */
         uint32_t  NCFS85:1;          /* NCF 85 status */
         uint32_t  NCFS84:1;          /* NCF 84 status */
         uint32_t  NCFS83:1;          /* NCF 83 status */
         uint32_t  NCFS82:1;          /* NCF 82 status */
         uint32_t  NCFS81:1;          /* NCF 81 status */
         uint32_t  NCFS80:1;          /* NCF 80 status */
         uint32_t  NCFS79:1;          /* NCF 79 status */
         uint32_t  NCFS78:1;          /* NCF 78 status */
         uint32_t  NCFS77:1;          /* NCF 77 status */
         uint32_t  NCFS76:1;          /* NCF 76 status */
         uint32_t  NCFS75:1;          /* NCF 75 status */
         uint32_t  NCFS74:1;          /* NCF 74 status */
         uint32_t  NCFS73:1;          /* NCF 73 status */
         uint32_t  NCFS72:1;          /* NCF 72 status */
         uint32_t  NCFS71:1;          /* NCF 71 status */
         uint32_t  NCFS70:1;          /* NCF 70 status */
         uint32_t  NCFS69:1;          /* NCF 69 status */
         uint32_t  NCFS68:1;          /* NCF 68 status */
         uint32_t  NCFS67:1;          /* NCF 67 status */
         uint32_t  NCFS66:1;          /* NCF 66 status */
         uint32_t  NCFS65:1;          /* NCF 65 status */
         uint32_t  NCFS64:1;          /* NCF 64 status */
      } B;
   } FCCU_NCFS2_32B_tag;

   typedef union {   /* FCCU NCF Status Register 3 */
      uint32_t R;
      struct {
         uint32_t  NCFS127:1;         /* NCF 127 status */
         uint32_t  NCFS126:1;         /* NCF 126 status */
         uint32_t  NCFS125:1;         /* NCF 125 status */
         uint32_t  NCFS124:1;         /* NCF 124 status */
         uint32_t  NCFS123:1;         /* NCF 123 status */
         uint32_t  NCFS122:1;         /* NCF 122 status */
         uint32_t  NCFS121:1;         /* NCF 121 status */
         uint32_t  NCFS120:1;         /* NCF 120 status */
         uint32_t  NCFS119:1;         /* NCF 119 status */
         uint32_t  NCFS118:1;         /* NCF 118 status */
         uint32_t  NCFS117:1;         /* NCF 117 status */
         uint32_t  NCFS116:1;         /* NCF 116 status */
         uint32_t  NCFS115:1;         /* NCF 115 status */
         uint32_t  NCFS114:1;         /* NCF 114 status */
         uint32_t  NCFS113:1;         /* NCF 113 status */
         uint32_t  NCFS112:1;         /* NCF 112 status */
         uint32_t  NCFS111:1;         /* NCF 111 status */
         uint32_t  NCFS110:1;         /* NCF 110 status */
         uint32_t  NCFS109:1;         /* NCF 109 status */
         uint32_t  NCFS108:1;         /* NCF 108 status */
         uint32_t  NCFS107:1;         /* NCF 107 status */
         uint32_t  NCFS106:1;         /* NCF 106 status */
         uint32_t  NCFS105:1;         /* NCF 105 status */
         uint32_t  NCFS104:1;         /* NCF 104 status */
         uint32_t  NCFS103:1;         /* NCF 103 status */
         uint32_t  NCFS102:1;         /* NCF 102 status */
         uint32_t  NCFS101:1;         /* NCF 101 status */
         uint32_t  NCFS100:1;         /* NCF 100 status */
         uint32_t  NCFS99:1;          /* NCF 99 status */
         uint32_t  NCFS98:1;          /* NCF 98 status */
         uint32_t  NCFS97:1;          /* NCF 97 status */
         uint32_t  NCFS96:1;          /* NCF 96 status */
      } B;
   } FCCU_NCFS3_32B_tag;

   typedef union {   /* FCCU_NCFK - FCCU NCF Key Register */
      uint32_t R;
   } FCCU_NCFK_32B_tag;

   typedef union {   /* FCCU NCF Enable Register 0 */
      uint32_t R;
      struct {
         uint32_t  NCFE31:1;          /* NCF 31 enable */
         uint32_t  NCFE30:1;          /* NCF 30 enable */
         uint32_t  NCFE29:1;          /* NCF 29 enable */
         uint32_t  NCFE28:1;          /* NCF 28 enable */
         uint32_t  NCFE27:1;          /* NCF 27 enable */
         uint32_t  NCFE26:1;          /* NCF 26 enable */
         uint32_t  NCFE25:1;          /* NCF 25 enable */
         uint32_t  NCFE24:1;          /* NCF 24 enable */
         uint32_t  NCFE23:1;          /* NCF 23 enable */
         uint32_t  NCFE22:1;          /* NCF 22 enable */
         uint32_t  NCFE21:1;          /* NCF 21 enable */
         uint32_t  NCFE20:1;          /* NCF 20 enable */
         uint32_t  NCFE19:1;          /* NCF 19 enable */
         uint32_t  NCFE18:1;          /* NCF 18 enable */
         uint32_t  NCFE17:1;          /* NCF 17 enable */
         uint32_t  NCFE16:1;          /* NCF 16 enable */
         uint32_t  NCFE15:1;          /* NCF 15 enable */
         uint32_t  NCFE14:1;          /* NCF 14 enable */
         uint32_t  NCFE13:1;          /* NCF 13 enable */
         uint32_t  NCFE12:1;          /* NCF 12 enable */
         uint32_t  NCFE11:1;          /* NCF 11 enable */
         uint32_t  NCFE10:1;          /* NCF 10 enable */
         uint32_t  NCFE9:1;           /* NCF 9 enable */
         uint32_t  NCFE8:1;           /* NCF 8 enable */
         uint32_t  NCFE7:1;           /* NCF 7 enable */
         uint32_t  NCFE6:1;           /* NCF 6 enable */
         uint32_t  NCFE5:1;           /* NCF 5 enable */
         uint32_t  NCFE4:1;           /* NCF 4 enable */
         uint32_t  NCFE3:1;           /* NCF 3 enable */
         uint32_t  NCFE2:1;           /* NCF 2 enable */
         uint32_t  NCFE1:1;           /* NCF 1 enable */
         uint32_t  NCFE0:1;           /* NCF 0 enable */
      } B;
   } FCCU_NCFE0_32B_tag;

   typedef union {   /* FCCU NCF Enable Register 1 */
      uint32_t R;
      struct {
         uint32_t  NCFE63:1;          /* NCF 63 enable */
         uint32_t  NCFE62:1;          /* NCF 62 enable */
         uint32_t  NCFE61:1;          /* NCF 61 enable */
         uint32_t  NCFE60:1;          /* NCF 60 enable */
         uint32_t  NCFE59:1;          /* NCF 59 enable */
         uint32_t  NCFE58:1;          /* NCF 58 enable */
         uint32_t  NCFE57:1;          /* NCF 57 enable */
         uint32_t  NCFE56:1;          /* NCF 56 enable */
         uint32_t  NCFE55:1;          /* NCF 55 enable */
         uint32_t  NCFE54:1;          /* NCF 54 enable */
         uint32_t  NCFE53:1;          /* NCF 53 enable */
         uint32_t  NCFE52:1;          /* NCF 52 enable */
         uint32_t  NCFE51:1;          /* NCF 51 enable */
         uint32_t  NCFE50:1;          /* NCF 50 enable */
         uint32_t  NCFE49:1;          /* NCF 49 enable */
         uint32_t  NCFE48:1;          /* NCF 48 enable */
         uint32_t  NCFE47:1;          /* NCF 47 enable */
         uint32_t  NCFE46:1;          /* NCF 46 enable */
         uint32_t  NCFE45:1;          /* NCF 45 enable */
         uint32_t  NCFE44:1;          /* NCF 44 enable */
         uint32_t  NCFE43:1;          /* NCF 43 enable */
         uint32_t  NCFE42:1;          /* NCF 42 enable */
         uint32_t  NCFE41:1;          /* NCF 41 enable */
         uint32_t  NCFE40:1;          /* NCF 40 enable */
         uint32_t  NCFE39:1;          /* NCF 39 enable */
         uint32_t  NCFE38:1;          /* NCF 38 enable */
         uint32_t  NCFE37:1;          /* NCF 37 enable */
         uint32_t  NCFE36:1;          /* NCF 36 enable */
         uint32_t  NCFE35:1;          /* NCF 35 enable */
         uint32_t  NCFE34:1;          /* NCF 34 enable */
         uint32_t  NCFE33:1;          /* NCF 33 enable */
         uint32_t  NCFE32:1;          /* NCF 32 enable */
      } B;
   } FCCU_NCFE1_32B_tag;

