RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU NCF Enable Register 2 */
      uint32_t R;
      struct {
         uint32_t  NCFE95:1;          /* NCF 95 enable */
         uint32_t  NCFE94:1;          /* NCF 94 enable */
         uint32_t  NCFE93:1;          /* NCF 93 enable */
         uint32_t  NCFE92:1;          /* NCF 92 enable */
         uint32_t  NCFE91:1;          /* NCF 91 enable */
         uint32_t  NCFE90:1;          /* NCF 90 enable */
         uint32_t  NCFE89:1;          /* NCF 89 enable */
         uint32_t  NCFE88:1;          /* NCF 88 enable */
         uint32_t  NCFE87:1;          /* NCF 87 enable */
         uint32_t  NCFE86:1;          /* NCF 86 enable */
         uint32_t  NCFE85:1;          /* NCF 85 enable */
         uint32_t  NCFE84:1;          /* NCF 84 enable */
         uint32_t  NCFE83:1;          /* NCF 83 enable */
         uint32_t  NCFE82:1;          /* NCF 82 enable */
         uint32_t  NCFE81:1;          /* NCF 81 enable */
         uint32_t  NCFE80:1;          /* NCF 80 enable */
         uint32_t  NCFE79:1;          /* NCF 79 enable */
         uint32_t  NCFE78:1;          /* NCF 78 enable */
         uint32_t  NCFE77:1;          /* NCF 77 enable */
         uint32_t  NCFE76:1;          /* NCF 76 enable */
         uint32_t  NCFE75:1;          /* NCF 75 enable */
         uint32_t  NCFE74:1;          /* NCF 74 enable */
         uint32_t  NCFE73:1;          /* NCF 73 enable */
         uint32_t  NCFE72:1;          /* NCF 72 enable */
         uint32_t  NCFE71:1;          /* NCF 71 enable */
         uint32_t  NCFE70:1;          /* NCF 70 enable */
         uint32_t  NCFE69:1;          /* NCF 69 enable */
         uint32_t  NCFE68:1;          /* NCF 68 enable */
         uint32_t  NCFE67:1;          /* NCF 67 enable */
         uint32_t  NCFE66:1;          /* NCF 66 enable */
         uint32_t  NCFE65:1;          /* NCF 65 enable */
         uint32_t  NCFE64:1;          /* NCF 64 enable */
      } B;
   } FCCU_NCFE2_32B_tag;

   typedef union {   /* FCCU NCF Enable Register 3 */
      uint32_t R;
      struct {
         uint32_t  NCFE127:1;         /* NCF 127 enable */
         uint32_t  NCFE126:1;         /* NCF 126 enable */
         uint32_t  NCFE125:1;         /* NCF 125 enable */
         uint32_t  NCFE124:1;         /* NCF 124 enable */
         uint32_t  NCFE123:1;         /* NCF 123 enable */
         uint32_t  NCFE122:1;         /* NCF 122 enable */
         uint32_t  NCFE121:1;         /* NCF 121 enable */
         uint32_t  NCFE120:1;         /* NCF 120 enable */
         uint32_t  NCFE119:1;         /* NCF 119 enable */
         uint32_t  NCFE118:1;         /* NCF 118 enable */
         uint32_t  NCFE117:1;         /* NCF 117 enable */
         uint32_t  NCFE116:1;         /* NCF 116 enable */
         uint32_t  NCFE115:1;         /* NCF 115 enable */
         uint32_t  NCFE114:1;         /* NCF 114 enable */
         uint32_t  NCFE113:1;         /* NCF 113 enable */
         uint32_t  NCFE112:1;         /* NCF 112 enable */
         uint32_t  NCFE111:1;         /* NCF 111 enable */
         uint32_t  NCFE110:1;         /* NCF 110 enable */
         uint32_t  NCFE109:1;         /* NCF 109 enable */
         uint32_t  NCFE108:1;         /* NCF 108 enable */
         uint32_t  NCFE107:1;         /* NCF 107 enable */
         uint32_t  NCFE106:1;         /* NCF 106 enable */
         uint32_t  NCFE105:1;         /* NCF 105 enable */
         uint32_t  NCFE104:1;         /* NCF 104 enable */
         uint32_t  NCFE103:1;         /* NCF 103 enable */
         uint32_t  NCFE102:1;         /* NCF 102 enable */
         uint32_t  NCFE101:1;         /* NCF 101 enable */
         uint32_t  NCFE100:1;         /* NCF 100 enable */
         uint32_t  NCFE99:1;          /* NCF 99 enable */
         uint32_t  NCFE98:1;          /* NCF 98 enable */
         uint32_t  NCFE97:1;          /* NCF 97 enable */
         uint32_t  NCFE96:1;          /* NCF 96 enable */
      } B;
   } FCCU_NCFE3_32B_tag;

   typedef union {   /* FCCU NCF Time-out Enable Register 0 */
      uint32_t R;
      struct {
         uint32_t  NCFTOE31:1;        /* NCF 31 time-out enable */
         uint32_t  NCFTOE30:1;        /* NCF 30 time-out enable */
         uint32_t  NCFTOE29:1;        /* NCF 29 time-out enable */
         uint32_t  NCFTOE28:1;        /* NCF 28 time-out enable */
         uint32_t  NCFTOE27:1;        /* NCF 27 time-out enable */
         uint32_t  NCFTOE26:1;        /* NCF 26 time-out enable */
         uint32_t  NCFTOE25:1;        /* NCF 25 time-out enable */
         uint32_t  NCFTOE24:1;        /* NCF 24 time-out enable */
         uint32_t  NCFTOE23:1;        /* NCF 23 time-out enable */
         uint32_t  NCFTOE22:1;        /* NCF 22 time-out enable */
         uint32_t  NCFTOE21:1;        /* NCF 21 time-out enable */
         uint32_t  NCFTOE20:1;        /* NCF 20 time-out enable */
         uint32_t  NCFTOE19:1;        /* NCF 19 time-out enable */
         uint32_t  NCFTOE18:1;        /* NCF 18 time-out enable */
         uint32_t  NCFTOE17:1;        /* NCF 17 time-out enable */
         uint32_t  NCFTOE16:1;        /* NCF 16 time-out enable */
         uint32_t  NCFTOE15:1;        /* NCF 15 time-out enable */
         uint32_t  NCFTOE14:1;        /* NCF 14 time-out enable */
         uint32_t  NCFTOE13:1;        /* NCF 13 time-out enable */
         uint32_t  NCFTOE12:1;        /* NCF 12 time-out enable */
         uint32_t  NCFTOE11:1;        /* NCF 11 time-out enable */
         uint32_t  NCFTOE10:1;        /* NCF 10 time-out enable */
         uint32_t  NCFTOE9:1;         /* NCF 9 time-out enable */
         uint32_t  NCFTOE8:1;         /* NCF 8 time-out enable */
         uint32_t  NCFTOE7:1;         /* NCF 7 time-out enable */
         uint32_t  NCFTOE6:1;         /* NCF 6 time-out enable */
         uint32_t  NCFTOE5:1;         /* NCF 5 time-out enable */
         uint32_t  NCFTOE4:1;         /* NCF 4 time-out enable */
         uint32_t  NCFTOE3:1;         /* NCF 3 time-out enable */
         uint32_t  NCFTOE2:1;         /* NCF 2 time-out enable */
         uint32_t  NCFTOE1:1;         /* NCF 1 time-out enable */
         uint32_t  NCFTOE0:1;         /* NCF 0 time-out enable */
      } B;
   } FCCU_NCF_TOE0_32B_tag;

   typedef union {   /* FCCU NCF Time-out Enable Register 1 */
      uint32_t R;
      struct {
         uint32_t  NCFTOE63:1;        /* NCF 63 time-out enable */
         uint32_t  NCFTOE62:1;        /* NCF 62 time-out enable */
         uint32_t  NCFTOE61:1;        /* NCF 61 time-out enable */
         uint32_t  NCFTOE60:1;        /* NCF 60 time-out enable */
         uint32_t  NCFTOE59:1;        /* NCF 59 time-out enable */
         uint32_t  NCFTOE58:1;        /* NCF 58 time-out enable */
         uint32_t  NCFTOE57:1;        /* NCF 57 time-out enable */
         uint32_t  NCFTOE56:1;        /* NCF 56 time-out enable */
         uint32_t  NCFTOE55:1;        /* NCF 55 time-out enable */
         uint32_t  NCFTOE54:1;        /* NCF 54 time-out enable */
         uint32_t  NCFTOE53:1;        /* NCF 53 time-out enable */
         uint32_t  NCFTOE52:1;        /* NCF 52 time-out enable */
         uint32_t  NCFTOE51:1;        /* NCF 51 time-out enable */
         uint32_t  NCFTOE50:1;        /* NCF 50 time-out enable */
         uint32_t  NCFTOE49:1;        /* NCF 49 time-out enable */
         uint32_t  NCFTOE48:1;        /* NCF 48 time-out enable */
         uint32_t  NCFTOE47:1;        /* NCF 47 time-out enable */
         uint32_t  NCFTOE46:1;        /* NCF 46 time-out enable */
         uint32_t  NCFTOE45:1;        /* NCF 45 time-out enable */
         uint32_t  NCFTOE44:1;        /* NCF 44 time-out enable */
         uint32_t  NCFTOE43:1;        /* NCF 43 time-out enable */
         uint32_t  NCFTOE42:1;        /* NCF 42 time-out enable */
         uint32_t  NCFTOE41:1;        /* NCF 41 time-out enable */
         uint32_t  NCFTOE40:1;        /* NCF 40 time-out enable */
         uint32_t  NCFTOE39:1;        /* NCF 39 time-out enable */
         uint32_t  NCFTOE38:1;        /* NCF 38 time-out enable */
         uint32_t  NCFTOE37:1;        /* NCF 37 time-out enable */
         uint32_t  NCFTOE36:1;        /* NCF 36 time-out enable */
         uint32_t  NCFTOE35:1;        /* NCF 35 time-out enable */
         uint32_t  NCFTOE34:1;        /* NCF 34 time-out enable */
         uint32_t  NCFTOE33:1;        /* NCF 33 time-out enable */
         uint32_t  NCFTOE32:1;        /* NCF 32 time-out enable */
      } B;
   } FCCU_NCF_TOE1_32B_tag;

