RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU NCF Time-out Enable Register 2 */
      uint32_t R;
      struct {
         uint32_t  NCFTOE95:1;        /* NCF 95 time-out enable */
         uint32_t  NCFTOE94:1;        /* NCF 94 time-out enable */
         uint32_t  NCFTOE93:1;        /* NCF 93 time-out enable */
         uint32_t  NCFTOE92:1;        /* NCF 92 time-out enable */
         uint32_t  NCFTOE91:1;        /* NCF 91 time-out enable */
         uint32_t  NCFTOE90:1;        /* NCF 90 time-out enable */
         uint32_t  NCFTOE89:1;        /* NCF 89 time-out enable */
         uint32_t  NCFTOE88:1;        /* NCF 88 time-out enable */
         uint32_t  NCFTOE87:1;        /* NCF 87 time-out enable */
         uint32_t  NCFTOE86:1;        /* NCF 86 time-out enable */
         uint32_t  NCFTOE85:1;        /* NCF 85 time-out enable */
         uint32_t  NCFTOE84:1;        /* NCF 84 time-out enable */
         uint32_t  NCFTOE83:1;        /* NCF 83 time-out enable */
         uint32_t  NCFTOE82:1;        /* NCF 82 time-out enable */
         uint32_t  NCFTOE81:1;        /* NCF 81 time-out enable */
         uint32_t  NCFTOE80:1;        /* NCF 80 time-out enable */
         uint32_t  NCFTOE79:1;        /* NCF 79 time-out enable */
         uint32_t  NCFTOE78:1;        /* NCF 78 time-out enable */
         uint32_t  NCFTOE77:1;        /* NCF 77 time-out enable */
         uint32_t  NCFTOE76:1;        /* NCF 76 time-out enable */
         uint32_t  NCFTOE75:1;        /* NCF 75 time-out enable */
         uint32_t  NCFTOE74:1;        /* NCF 74 time-out enable */
         uint32_t  NCFTOE73:1;        /* NCF 73 time-out enable */
         uint32_t  NCFTOE72:1;        /* NCF 72 time-out enable */
         uint32_t  NCFTOE71:1;        /* NCF 71 time-out enable */
         uint32_t  NCFTOE70:1;        /* NCF 70 time-out enable */
         uint32_t  NCFTOE69:1;        /* NCF 69 time-out enable */
         uint32_t  NCFTOE68:1;        /* NCF 68 time-out enable */
         uint32_t  NCFTOE67:1;        /* NCF 67 time-out enable */
         uint32_t  NCFTOE66:1;        /* NCF 66 time-out enable */
         uint32_t  NCFTOE65:1;        /* NCF 65 time-out enable */
         uint32_t  NCFTOE64:1;        /* NCF 64 time-out enable */
      } B;
   } FCCU_NCF_TOE2_32B_tag;

   typedef union {   /* FCCU NCF Time-out Enable Register 3 */
      uint32_t R;
      struct {
         uint32_t  NCFTOE127:1;       /* NCF 127 time-out enable */
         uint32_t  NCFTOE126:1;       /* NCF 126 time-out enable */
         uint32_t  NCFTOE125:1;       /* NCF 125 time-out enable */
         uint32_t  NCFTOE124:1;       /* NCF 124 time-out enable */
         uint32_t  NCFTOE123:1;       /* NCF 123 time-out enable */
         uint32_t  NCFTOE122:1;       /* NCF 122 time-out enable */
         uint32_t  NCFTOE121:1;       /* NCF 121 time-out enable */
         uint32_t  NCFTOE120:1;       /* NCF 120 time-out enable */
         uint32_t  NCFTOE119:1;       /* NCF 119 time-out enable */
         uint32_t  NCFTOE118:1;       /* NCF 118 time-out enable */
         uint32_t  NCFTOE117:1;       /* NCF 117 time-out enable */
         uint32_t  NCFTOE116:1;       /* NCF 116 time-out enable */
         uint32_t  NCFTOE115:1;       /* NCF 115 time-out enable */
         uint32_t  NCFTOE114:1;       /* NCF 114 time-out enable */
         uint32_t  NCFTOE113:1;       /* NCF 113 time-out enable */
         uint32_t  NCFTOE112:1;       /* NCF 112 time-out enable */
         uint32_t  NCFTOE111:1;       /* NCF 111 time-out enable */
         uint32_t  NCFTOE110:1;       /* NCF 110 time-out enable */
         uint32_t  NCFTOE109:1;       /* NCF 109 time-out enable */
         uint32_t  NCFTOE108:1;       /* NCF 108 time-out enable */
         uint32_t  NCFTOE107:1;       /* NCF 107 time-out enable */
         uint32_t  NCFTOE106:1;       /* NCF 106 time-out enable */
         uint32_t  NCFTOE105:1;       /* NCF 105 time-out enable */
         uint32_t  NCFTOE104:1;       /* NCF 104 time-out enable */
         uint32_t  NCFTOE103:1;       /* NCF 103 time-out enable */
         uint32_t  NCFTOE102:1;       /* NCF 102 time-out enable */
         uint32_t  NCFTOE101:1;       /* NCF 101 time-out enable */
         uint32_t  NCFTOE100:1;       /* NCF 100 time-out enable */
         uint32_t  NCFTOE99:1;        /* NCF 99 time-out enable */
         uint32_t  NCFTOE98:1;        /* NCF 98 time-out enable */
         uint32_t  NCFTOE97:1;        /* NCF 97 time-out enable */
         uint32_t  NCFTOE96:1;        /* NCF 96 time-out enable */
      } B;
   } FCCU_NCF_TOE3_32B_tag;

   typedef union {   /* FCCU_NCF_TO - FCCU NCF Time-out Register */
      uint32_t R;
   } FCCU_NCF_TO_32B_tag;

   typedef union {   /* FCCU_CFG_TO - FCCU CFG Timeout Register */
      uint32_t R;
      struct {
         uint32_t:29;
         uint32_t  TO:3;              /* Configuration time-out */
      } B;
   } FCCU_CFG_TO_32B_tag;

   typedef union {   /* FCCU_EINOUT - FCCU IO Control Register */
      uint32_t R;
      struct {
         uint32_t:26;
         uint32_t  EIN1:1;            /* Error input 1 */
         uint32_t  EIN0:1;            /* Error input 0 */
         uint32_t:2;
         uint32_t  EOUT1:1;           /* Error out 1 */
         uint32_t  EOUT0:1;           /* Error out 0 */
      } B;
   } FCCU_EINOUT_32B_tag;

   typedef union {   /* FCCU_STAT - FCCU Status Register */
      uint32_t R;
      struct {
         uint32_t:29;
         uint32_t  STATUS:3;          /* FCCU status */
      } B;
   } FCCU_STAT_32B_tag;

   typedef union {   /* FCCU_NAFS - FCCU NA Freeze Status Register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  N2AFSTATUS:8;      /* Normal to Alarm Frozen Status */
      } B;
   } FCCU_NAFS_32B_tag;

   typedef union {   /* FCCU_AFFS - FCCU AF Freeze Status Register */
      uint32_t R;
      struct {
         uint32_t:22;
         uint32_t  AFFS_SRC:2;        /* Fault source */
         uint32_t  A2AFSTATUS:8;      /* Alarm to Fault Frozen Status */
      } B;
   } FCCU_AFFS_32B_tag;

