RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* FCCU_NFFS - FCCU NF Freeze Status Register */
      uint32_t R;
      struct {
         uint32_t:22;
         uint32_t  NFFS_SRC:2;        /* Fault source */
         uint32_t  NFFS_NFFS:8;       /* Normal to Fault Frozen Status */
      } B;
   } FCCU_NFFS_32B_tag;

   typedef union {   /* FCCU_FAFS - FCCU FA Freeze Status Register */
      uint32_t R;
      struct {
         uint32_t:24;
         uint32_t  FAFS_FAFS:8;       /* Fault to Normal Frozen Status */
      } B;
   } FCCU_FAFS_32B_tag;

   typedef union {   /* FCCU_SCFS - FCCU SC Freeze Status Register */
      uint32_t R;
      struct {
         uint32_t:30;
         uint32_t  RCCS1:1;           /* RCC1 Status */
         uint32_t  RCCS0:1;           /* RCC0 Status */
      } B;
   } FCCU_SCFS_32B_tag;

   typedef union {   /* FCCU_CFF - FCCU CF Fake Register */
      uint32_t R;
      struct {
         uint32_t:25;
         uint32_t  FCFC:7;            /* Fake critical fault code */
      } B;
   } FCCU_CFF_32B_tag;

   typedef union {   /* FCCU_NCFF - FCCU NCF Fake Register */
      uint32_t R;
      struct {
         uint32_t:25;
         uint32_t  FNCFC:7;           /* Fake non-critical fault code */
      } B;
   } FCCU_NCFF_32B_tag;

   typedef union {   /* FCCU_IRQ_STAT - FCCU IRQ Status Register */
      uint32_t R;
      struct {
         uint32_t:29;
         uint32_t  NMI_STAT:1;        /* NMI Interrupt Status */
         uint32_t  ALRM_STAT:1;       /* Alarm Interrupt Status */
         uint32_t  CFG_TO_STAT:1;     /* Configuration Time-out Status */
      } B;
   } FCCU_IRQ_STAT_32B_tag;

   typedef union {   /* FCCU_IRQ_EN - FCCU IRQ Enable Register */
      uint32_t R;
      struct {
         uint32_t:31;
         uint32_t  CFG_TO_IEN:1;      /* Configuration Time-out Interrupt Enable */
      } B;
   } FCCU_IRQ_EN_32B_tag;

   typedef union {   /* FCCU_XTMR - FCCU XTMR Register */
      uint32_t R;
      struct {
         uint32_t  XTMR_XTMR:32;      /* Alarm/Watchdog/safe request timer */
      } B;
   } FCCU_XTMR_32B_tag;

   typedef union {   /* FCCU_MCS - FCCU MCS Register */
      uint32_t R;
      struct {
         uint32_t  VL3:1;             /* Valid */
         uint32_t  FS3:1;             /* Fault Status */
         uint32_t:2;
         uint32_t  MCS3:4;            /* Magic Carpet oldest state */
         uint32_t  VL2:1;             /* Valid */
         uint32_t  FS2:1;             /* Fault Status */
         uint32_t:2;
         uint32_t  MCS2:4;            /* Magic Carpet previous-previous state */
         uint32_t  VL1:1;             /* Valid */
         uint32_t  FS1:1;             /* Fault Status */
         uint32_t:2;
         uint32_t  MCS1:4;            /* Magic Carpet previous state */
         uint32_t  VL0:1;             /* Valid */
         uint32_t  FS0:1;             /* Fault Status */
         uint32_t:2;
         uint32_t  MCS0:4;            /* Magic Carpet latest state */
      } B;
   } FCCU_MCS_32B_tag;


   /* Register layout for generated register(s) CF_CFG... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_CF_CFG_32B_tag;


   /* Register layout for generated register(s) NCF_CFG... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_NCF_CFG_32B_tag;


   /* Register layout for generated register(s) CFS_CFG... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_CFS_CFG_32B_tag;


   /* Register layout for generated register(s) NCFS_CFG... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_NCFS_CFG_32B_tag;


   /* Register layout for generated register(s) CFS... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_CFS_32B_tag;


   /* Register layout for generated register(s) NCFS... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_NCFS_32B_tag;


   /* Register layout for generated register(s) NCFE... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_NCFE_32B_tag;


   /* Register layout for generated register(s) NCF_TOE... */

   typedef union {   /*  */
      uint32_t R;
   } FCCU_NCF_TOE_32B_tag;



   typedef struct FCCU_struct_tag { /* start of FCCU_tag */
                                                /* FCCU Control Register */
      FCCU_CTRL_32B_tag CTRL;              /* offset: 0x0000 size: 32 bit */
                                               /* FCCU CTRL Key Register */
      FCCU_CTRLK_32B_tag CTRLK;            /* offset: 0x0004 size: 32 bit */
                                          /* FCCU Configuration Register */
      FCCU_CFG_32B_tag CFG;                /* offset: 0x0008 size: 32 bit */
      union {
         FCCU_CF_CFG_32B_tag CF_CFG[4];    /* offset: 0x000C  (0x0004 x 4) */

         struct {
                                     /* FCCU CF Configuration Register 0 */
            FCCU_CF_CFG0_32B_tag CF_CFG0;  /* offset: 0x000C size: 32 bit */
                                     /* FCCU CF Configuration Register 1 */
            FCCU_CF_CFG1_32B_tag CF_CFG1;  /* offset: 0x0010 size: 32 bit */
                                     /* FCCU CF Configuration Register 2 */
            FCCU_CF_CFG2_32B_tag CF_CFG2;  /* offset: 0x0014 size: 32 bit */
                                     /* FCCU CF Configuration Register 3 */
            FCCU_CF_CFG3_32B_tag CF_CFG3;  /* offset: 0x0018 size: 32 bit */
         };

      };
      union {
         FCCU_NCF_CFG_32B_tag NCF_CFG[4];  /* offset: 0x001C  (0x0004 x 4) */

         struct {
                                    /* FCCU NCF Configuration Register 0 */
            FCCU_NCF_CFG0_32B_tag NCF_CFG0;  /* offset: 0x001C size: 32 bit */
                                    /* FCCU NCF Configuration Register 1 */
            FCCU_NCF_CFG1_32B_tag NCF_CFG1;  /* offset: 0x0020 size: 32 bit */
                                    /* FCCU NCF Configuration Register 2 */
            FCCU_NCF_CFG2_32B_tag NCF_CFG2;  /* offset: 0x0024 size: 32 bit */
                                    /* FCCU NCF Configuration Register 3 */
            FCCU_NCF_CFG3_32B_tag NCF_CFG3;  /* offset: 0x0028 size: 32 bit */
         };

