RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
         FCCU_CFS_CFG_32B_tag CFS_CFG[8];  /* offset: 0x002C  (0x0004 x 8) */

         struct {
                                    /* FCCU CFS Configuration Register 0 */
            FCCU_CFS_CFG0_32B_tag CFS_CFG0;  /* offset: 0x002C size: 32 bit */
                                    /* FCCU CFS Configuration Register 1 */
            FCCU_CFS_CFG1_32B_tag CFS_CFG1;  /* offset: 0x0030 size: 32 bit */
                                    /* FCCU CFS Configuration Register 2 */
            FCCU_CFS_CFG2_32B_tag CFS_CFG2;  /* offset: 0x0034 size: 32 bit */
                                    /* FCCU CFS Configuration Register 3 */
            FCCU_CFS_CFG3_32B_tag CFS_CFG3;  /* offset: 0x0038 size: 32 bit */
                                    /* FCCU CFS Configuration Register 4 */
            FCCU_CFS_CFG4_32B_tag CFS_CFG4;  /* offset: 0x003C size: 32 bit */
                                    /* FCCU CFS Configuration Register 5 */
            FCCU_CFS_CFG5_32B_tag CFS_CFG5;  /* offset: 0x0040 size: 32 bit */
                                    /* FCCU CFS Configuration Register 6 */
            FCCU_CFS_CFG6_32B_tag CFS_CFG6;  /* offset: 0x0044 size: 32 bit */
                                    /* FCCU CFS Configuration Register 7 */
            FCCU_CFS_CFG7_32B_tag CFS_CFG7;  /* offset: 0x0048 size: 32 bit */
         };

      };
      union {
         FCCU_NCFS_CFG_32B_tag NCFS_CFG[8];  /* offset: 0x004C  (0x0004 x 8) */

         struct {
                                   /* FCCU NCFS Configuration Register 0 */
            FCCU_NCFS_CFG0_32B_tag NCFS_CFG0;  /* offset: 0x004C size: 32 bit */
                                   /* FCCU NCFS Configuration Register 1 */
            FCCU_NCFS_CFG1_32B_tag NCFS_CFG1;  /* offset: 0x0050 size: 32 bit */
                                   /* FCCU NCFS Configuration Register 2 */
            FCCU_NCFS_CFG2_32B_tag NCFS_CFG2;  /* offset: 0x0054 size: 32 bit */
                                   /* FCCU NCFS Configuration Register 3 */
            FCCU_NCFS_CFG3_32B_tag NCFS_CFG3;  /* offset: 0x0058 size: 32 bit */
                                   /* FCCU NCFS Configuration Register 4 */
            FCCU_NCFS_CFG4_32B_tag NCFS_CFG4;  /* offset: 0x005C size: 32 bit */
                                   /* FCCU NCFS Configuration Register 5 */
            FCCU_NCFS_CFG5_32B_tag NCFS_CFG5;  /* offset: 0x0060 size: 32 bit */
                                   /* FCCU NCFS Configuration Register 6 */
            FCCU_NCFS_CFG6_32B_tag NCFS_CFG6;  /* offset: 0x0064 size: 32 bit */
                                   /* FCCU NCFS Configuration Register 7 */
            FCCU_NCFS_CFG7_32B_tag NCFS_CFG7;  /* offset: 0x0068 size: 32 bit */
         };

      };
      union {
         FCCU_CFS_32B_tag CFS[4];          /* offset: 0x006C  (0x0004 x 4) */

         struct {
                                            /* FCCU CF Status Register 0 */
            FCCU_CFS0_32B_tag CFS0;        /* offset: 0x006C size: 32 bit */
                                            /* FCCU CF Status Register 1 */
            FCCU_CFS1_32B_tag CFS1;        /* offset: 0x0070 size: 32 bit */
                                            /* FCCU CF Status Register 2 */
            FCCU_CFS2_32B_tag CFS2;        /* offset: 0x0074 size: 32 bit */
                                            /* FCCU CF Status Register 3 */
            FCCU_CFS3_32B_tag CFS3;        /* offset: 0x0078 size: 32 bit */
         };

      };
                                      /* FCCU_CFK - FCCU CF Key Register */
      FCCU_CFK_32B_tag CFK;                /* offset: 0x007C size: 32 bit */
      union {
         FCCU_NCFS_32B_tag NCFS[4];        /* offset: 0x0080  (0x0004 x 4) */

         struct {
                                           /* FCCU NCF Status Register 0 */
            FCCU_NCFS0_32B_tag NCFS0;      /* offset: 0x0080 size: 32 bit */
                                           /* FCCU NCF Status Register 1 */
            FCCU_NCFS1_32B_tag NCFS1;      /* offset: 0x0084 size: 32 bit */
                                           /* FCCU NCF Status Register 2 */
            FCCU_NCFS2_32B_tag NCFS2;      /* offset: 0x0088 size: 32 bit */
                                           /* FCCU NCF Status Register 3 */
            FCCU_NCFS3_32B_tag NCFS3;      /* offset: 0x008C size: 32 bit */
         };

      };
                                    /* FCCU_NCFK - FCCU NCF Key Register */
      FCCU_NCFK_32B_tag NCFK;              /* offset: 0x0090 size: 32 bit */
      union {
         FCCU_NCFE_32B_tag NCFE[4];        /* offset: 0x0094  (0x0004 x 4) */

         struct {
                                           /* FCCU NCF Enable Register 0 */
            FCCU_NCFE0_32B_tag NCFE0;      /* offset: 0x0094 size: 32 bit */
                                           /* FCCU NCF Enable Register 1 */
            FCCU_NCFE1_32B_tag NCFE1;      /* offset: 0x0098 size: 32 bit */
                                           /* FCCU NCF Enable Register 2 */
            FCCU_NCFE2_32B_tag NCFE2;      /* offset: 0x009C size: 32 bit */
                                           /* FCCU NCF Enable Register 3 */
            FCCU_NCFE3_32B_tag NCFE3;      /* offset: 0x00A0 size: 32 bit */
         };

      };
      union {
         FCCU_NCF_TOE_32B_tag NCF_TOE[4];  /* offset: 0x00A4  (0x0004 x 4) */

         struct {
                                  /* FCCU NCF Time-out Enable Register 0 */
            FCCU_NCF_TOE0_32B_tag NCF_TOE0;  /* offset: 0x00A4 size: 32 bit */
                                  /* FCCU NCF Time-out Enable Register 1 */
            FCCU_NCF_TOE1_32B_tag NCF_TOE1;  /* offset: 0x00A8 size: 32 bit */
                                  /* FCCU NCF Time-out Enable Register 2 */
            FCCU_NCF_TOE2_32B_tag NCF_TOE2;  /* offset: 0x00AC size: 32 bit */
                                  /* FCCU NCF Time-out Enable Register 3 */
            FCCU_NCF_TOE3_32B_tag NCF_TOE3;  /* offset: 0x00B0 size: 32 bit */
         };

