RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
                             /* FCCU_NCF_TO - FCCU NCF Time-out Register */
      FCCU_NCF_TO_32B_tag NCF_TO;          /* offset: 0x00B4 size: 32 bit */
                              /* FCCU_CFG_TO - FCCU CFG Timeout Register */
      FCCU_CFG_TO_32B_tag CFG_TO;          /* offset: 0x00B8 size: 32 bit */
                               /* FCCU_EINOUT - FCCU IO Control Register */
      FCCU_EINOUT_32B_tag EINOUT;          /* offset: 0x00BC size: 32 bit */
                                     /* FCCU_STAT - FCCU Status Register */
      FCCU_STAT_32B_tag STAT;              /* offset: 0x00C0 size: 32 bit */
                           /* FCCU_NAFS - FCCU NA Freeze Status Register */
      FCCU_NAFS_32B_tag NAFS;              /* offset: 0x00C4 size: 32 bit */
                           /* FCCU_AFFS - FCCU AF Freeze Status Register */
      FCCU_AFFS_32B_tag AFFS;              /* offset: 0x00C8 size: 32 bit */
                           /* FCCU_NFFS - FCCU NF Freeze Status Register */
      FCCU_NFFS_32B_tag NFFS;              /* offset: 0x00CC size: 32 bit */
                           /* FCCU_FAFS - FCCU FA Freeze Status Register */
      FCCU_FAFS_32B_tag FAFS;              /* offset: 0x00D0 size: 32 bit */
                           /* FCCU_SCFS - FCCU SC Freeze Status Register */
      FCCU_SCFS_32B_tag SCFS;              /* offset: 0x00D4 size: 32 bit */
                                     /* FCCU_CFF - FCCU CF Fake Register */
      FCCU_CFF_32B_tag CFF;                /* offset: 0x00D8 size: 32 bit */
                                   /* FCCU_NCFF - FCCU NCF Fake Register */
      FCCU_NCFF_32B_tag NCFF;              /* offset: 0x00DC size: 32 bit */
                             /* FCCU_IRQ_STAT - FCCU IRQ Status Register */
      FCCU_IRQ_STAT_32B_tag IRQ_STAT;      /* offset: 0x00E0 size: 32 bit */
                               /* FCCU_IRQ_EN - FCCU IRQ Enable Register */
      FCCU_IRQ_EN_32B_tag IRQ_EN;          /* offset: 0x00E4 size: 32 bit */
                                       /* FCCU_XTMR - FCCU XTMR Register */
      FCCU_XTMR_32B_tag XTMR;              /* offset: 0x00E8 size: 32 bit */
                                         /* FCCU_MCS - FCCU MCS Register */
      FCCU_MCS_32B_tag MCS;                /* offset: 0x00EC size: 32 bit */
   } FCCU_tag;


#define FCCU  (*(volatile FCCU_tag *) 0xFFE6C000UL)



/****************************************************************/
/*                                                              */
/* Module: SGENDIG  */
/*                                                              */
/****************************************************************/

   typedef union {   /* SGENDIG_CTRL - SGENDIG Control Register */
      uint32_t R;
      struct {
         uint32_t  LDOS:1;            /* Operation Status */
         uint32_t  IOAMPL:5;          /* Define the AMPLitude value on I/O pad */
         uint32_t:2;
         uint32_t  SEMASK:1;          /* Sine wave generator Error MASK interrupt register */
         uint32_t:5;
         uint32_t  S0H1:1;            /* Operation Status */
         uint32_t  PDS:1;             /* Operation Status */
         uint32_t  IOFREQ:16;         /* Define the FREQuency value on I/O pad */
      } B;
   } SGENDIG_CTRL_32B_tag;

   typedef union {   /* SGENDIG_IRQE - SGENDIG Interrupt Request Enable  Register */
      uint32_t R;
      struct {
         uint32_t:8;
         uint32_t  SERR:1;            /* Sine wave generator Error bit */
         uint32_t:3;
         uint32_t  FERR:1;            /* Sine wave generator Force Error bit */
         uint32_t:19;
      } B;
   } SGENDIG_IRQE_32B_tag;



   typedef struct SGENDIG_struct_tag { /* start of SGENDIG_tag */
                              /* SGENDIG_CTRL - SGENDIG Control Register */
      SGENDIG_CTRL_32B_tag CTRL;           /* offset: 0x0000 size: 32 bit */
            /* SGENDIG_IRQE - SGENDIG Interrupt Request Enable  Register */
      SGENDIG_IRQE_32B_tag IRQE;           /* offset: 0x0004 size: 32 bit */
   } SGENDIG_tag;


#define SGENDIG (*(volatile SGENDIG_tag *) 0xFFE78000UL)



/****************************************************************/
/*                                                              */
/* Module: PBRIDGE  */
/*                                                              */
/****************************************************************/

   typedef union {   /* MPROT - Master Privilege Registers */
      uint32_t R;
      struct {
         uint32_t  MPROT0_MBW:1;      /* Master 0 Buffer Writes */
         uint32_t  MPROT0_MTR:1;      /* Master 0 Trusted for Reads */
         uint32_t  MPROT0_MTW:1;      /* Master 0 Trusted for Writes */
         uint32_t  MPROT0_MPL:1;      /* Master 0 Priviledge Level */
         uint32_t  MPROT1_MBW:1;      /* Master 1 Buffer Writes */
         uint32_t  MPROT1_MTR:1;      /* Master 1 Trusted for Reads */
         uint32_t  MPROT1_MTW:1;      /* Master 1 Trusted for Writes */
         uint32_t  MPROT1_MPL:1;      /* Master 1 Priviledge Level */
         uint32_t  MPROT2_MBW:1;      /* Master 2 Buffer Writes */
         uint32_t  MPROT2_MTR:1;      /* Master 2 Trusted for Reads */
         uint32_t  MPROT2_MTW:1;      /* Master 2 Trusted for Writes */
         uint32_t  MPROT2_MPL:1;      /* Master 2 Priviledge Level */
         uint32_t  MPROT3_MBW:1;      /* Master 3 Buffer Writes */
         uint32_t  MPROT3_MTR:1;      /* Master 3 Trusted for Reads */
         uint32_t  MPROT3_MTW:1;      /* Master 3 Trusted for Writes */
         uint32_t  MPROT3_MPL:1;      /* Master 3 Priviledge Level */
         uint32_t  MPROT4_MBW:1;      /* Master 4 Buffer Writes */
         uint32_t  MPROT4_MTR:1;      /* Master 4 Trusted for Reads */
         uint32_t  MPROT4_MTW:1;      /* Master 4 Trusted for Writes */
         uint32_t  MPROT4_MPL:1;      /* Master 4 Priviledge Level */
         uint32_t  MPROT5_MBW:1;      /* Master 5 Buffer Writes */
         uint32_t  MPROT5_MTR:1;      /* Master 5 Trusted for Reads */
         uint32_t  MPROT5_MTW:1;      /* Master 5 Trusted for Writes */
         uint32_t  MPROT5_MPL:1;      /* Master 5 Priviledge Level */
         uint32_t  MPROT6_MBW:1;      /* Master 6 Buffer Writes */
         uint32_t  MPROT6_MTR:1;      /* Master 6 Trusted for Reads */
         uint32_t  MPROT6_MTW:1;      /* Master 6 Trusted for Writes */
         uint32_t  MPROT6_MPL:1;      /* Master 6 Priviledge Level */
         uint32_t  MPROT7_MBW:1;      /* Master 7 Buffer Writes */
         uint32_t  MPROT7_MTR:1;      /* Master 7 Trusted for Reads */
         uint32_t  MPROT7_MTW:1;      /* Master 7 Trusted for Writes */
         uint32_t  MPROT7_MPL:1;      /* Master 7 Priviledge Level */
      } B;
   } PBRIDGE_MPROT_32B_tag;

   typedef union {   /* PACR0_7 - Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  PACR0_BW:1;        /* Buffer Writes */
         uint32_t  PACR0_SP:1;        /* Supervisor Protect */
         uint32_t  PACR0_WP:1;        /* Write Protect */
         uint32_t  PACR0_TP:1;        /* Trusted Protect */
         uint32_t  PACR1_BW:1;        /* Buffer Writes */
         uint32_t  PACR1_SP:1;        /* Supervisor Protect */
         uint32_t  PACR1_WP:1;        /* Write Protect */
         uint32_t  PACR1_TP:1;        /* Trusted Protect */
         uint32_t  PACR2_BW:1;        /* Buffer Writes */
         uint32_t  PACR2_SP:1;        /* Supervisor Protect */
         uint32_t  PACR2_WP:1;        /* Write Protect */
         uint32_t  PACR2_TP:1;        /* Trusted Protect */
         uint32_t  PACR3_BW:1;        /* Buffer Writes */
         uint32_t  PACR3_SP:1;        /* Supervisor Protect */
         uint32_t  PACR3_WP:1;        /* Write Protect */
         uint32_t  PACR3_TP:1;        /* Trusted Protect */
         uint32_t  PACR4_BW:1;        /* Buffer Writes */
         uint32_t  PACR4_SP:1;        /* Supervisor Protect */
         uint32_t  PACR4_WP:1;        /* Write Protect */
         uint32_t  PACR4_TP:1;        /* Trusted Protect */
         uint32_t  PACR5_BW:1;        /* Buffer Writes */
         uint32_t  PACR5_SP:1;        /* Supervisor Protect */
         uint32_t  PACR5_WP:1;        /* Write Protect */
         uint32_t  PACR5_TP:1;        /* Trusted Protect */
         uint32_t  PACR6_BW:1;        /* Buffer Writes */
         uint32_t  PACR6_SP:1;        /* Supervisor Protect */
         uint32_t  PACR6_WP:1;        /* Write Protect */
         uint32_t  PACR6_TP:1;        /* Trusted Protect */
         uint32_t  PACR7_BW:1;        /* Buffer Writes */
         uint32_t  PACR7_SP:1;        /* Supervisor Protect */
         uint32_t  PACR7_WP:1;        /* Write Protect */
         uint32_t  PACR7_TP:1;        /* Trusted Protect */
      } B;
   } PBRIDGE_PACR0_7_32B_tag;

