RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* PACR8_15 - Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  PACR8_BW:1;        /* Buffer Writes */
         uint32_t  PACR8_SP:1;        /* Supervisor Protect */
         uint32_t  PACR8_WP:1;        /* Write Protect */
         uint32_t  PACR8_TP:1;        /* Trusted Protect */
         uint32_t  PACR9_BW:1;        /* Buffer Writes */
         uint32_t  PACR9_SP:1;        /* Supervisor Protect */
         uint32_t  PACR9_WP:1;        /* Write Protect */
         uint32_t  PACR9_TP:1;        /* Trusted Protect */
         uint32_t  PACR10_BW:1;       /* Buffer Writes */
         uint32_t  PACR10_SP:1;       /* Supervisor Protect */
         uint32_t  PACR10_WP:1;       /* Write Protect */
         uint32_t  PACR10_TP:1;       /* Trusted Protect */
         uint32_t  PACR11_BW:1;       /* Buffer Writes */
         uint32_t  PACR11_SP:1;       /* Supervisor Protect */
         uint32_t  PACR11_WP:1;       /* Write Protect */
         uint32_t  PACR11_TP:1;       /* Trusted Protect */
         uint32_t  PACR12_BW:1;       /* Buffer Writes */
         uint32_t  PACR12_SP:1;       /* Supervisor Protect */
         uint32_t  PACR12_WP:1;       /* Write Protect */
         uint32_t  PACR12_TP:1;       /* Trusted Protect */
         uint32_t  PACR13_BW:1;       /* Buffer Writes */
         uint32_t  PACR13_SP:1;       /* Supervisor Protect */
         uint32_t  PACR13_WP:1;       /* Write Protect */
         uint32_t  PACR13_TP:1;       /* Trusted Protect */
         uint32_t  PACR14_BW:1;       /* Buffer Writes */
         uint32_t  PACR14_SP:1;       /* Supervisor Protect */
         uint32_t  PACR14_WP:1;       /* Write Protect */
         uint32_t  PACR14_TP:1;       /* Trusted Protect */
         uint32_t  PACR15_BW:1;       /* Buffer Writes */
         uint32_t  PACR15_SP:1;       /* Supervisor Protect */
         uint32_t  PACR15_WP:1;       /* Write Protect */
         uint32_t  PACR15_TP:1;       /* Trusted Protect */
      } B;
   } PBRIDGE_PACR8_15_32B_tag;

   typedef union {   /* PACR16_23 - Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  PACR16_BW:1;       /* Buffer Writes */
         uint32_t  PACR16_SP:1;       /* Supervisor Protect */
         uint32_t  PACR16_WP:1;       /* Write Protect */
         uint32_t  PACR16_TP:1;       /* Trusted Protect */
         uint32_t  PACR17_BW:1;       /* Buffer Writes */
         uint32_t  PACR17_SP:1;       /* Supervisor Protect */
         uint32_t  PACR17_WP:1;       /* Write Protect */
         uint32_t  PACR17_TP:1;       /* Trusted Protect */
         uint32_t  PACR18_BW:1;       /* Buffer Writes */
         uint32_t  PACR18_SP:1;       /* Supervisor Protect */
         uint32_t  PACR18_WP:1;       /* Write Protect */
         uint32_t  PACR18_TP:1;       /* Trusted Protect */
         uint32_t  PACR19_BW:1;       /* Buffer Writes */
         uint32_t  PACR19_SP:1;       /* Supervisor Protect */
         uint32_t  PACR19_WP:1;       /* Write Protect */
         uint32_t  PACR19_TP:1;       /* Trusted Protect */
         uint32_t  PACR20_BW:1;       /* Buffer Writes */
         uint32_t  PACR20_SP:1;       /* Supervisor Protect */
         uint32_t  PACR20_WP:1;       /* Write Protect */
         uint32_t  PACR20_TP:1;       /* Trusted Protect */
         uint32_t  PACR21_BW:1;       /* Buffer Writes */
         uint32_t  PACR21_SP:1;       /* Supervisor Protect */
         uint32_t  PACR21_WP:1;       /* Write Protect */
         uint32_t  PACR21_TP:1;       /* Trusted Protect */
         uint32_t  PACR22_BW:1;       /* Buffer Writes */
         uint32_t  PACR22_SP:1;       /* Supervisor Protect */
         uint32_t  PACR22_WP:1;       /* Write Protect */
         uint32_t  PACR22_TP:1;       /* Trusted Protect */
         uint32_t  PACR23_BW:1;       /* Buffer Writes */
         uint32_t  PACR23_SP:1;       /* Supervisor Protect */
         uint32_t  PACR23_WP:1;       /* Write Protect */
         uint32_t  PACR23_TP:1;       /* Trusted Protect */
      } B;
   } PBRIDGE_PACR16_23_32B_tag;

   typedef union {   /* PACR24_31 - Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  PACR24_BW:1;       /* Buffer Writes */
         uint32_t  PACR24_SP:1;       /* Supervisor Protect */
         uint32_t  PACR24_WP:1;       /* Write Protect */
         uint32_t  PACR24_TP:1;       /* Trusted Protect */
         uint32_t  PACR25_BW:1;       /* Buffer Writes */
         uint32_t  PACR25_SP:1;       /* Supervisor Protect */
         uint32_t  PACR25_WP:1;       /* Write Protect */
         uint32_t  PACR25_TP:1;       /* Trusted Protect */
         uint32_t  PACR26_BW:1;       /* Buffer Writes */
         uint32_t  PACR26_SP:1;       /* Supervisor Protect */
         uint32_t  PACR26_WP:1;       /* Write Protect */
         uint32_t  PACR26_TP:1;       /* Trusted Protect */
         uint32_t  PACR27_BW:1;       /* Buffer Writes */
         uint32_t  PACR27_SP:1;       /* Supervisor Protect */
         uint32_t  PACR27_WP:1;       /* Write Protect */
         uint32_t  PACR27_TP:1;       /* Trusted Protect */
         uint32_t  PACR28_BW:1;       /* Buffer Writes */
         uint32_t  PACR28_SP:1;       /* Supervisor Protect */
         uint32_t  PACR28_WP:1;       /* Write Protect */
         uint32_t  PACR28_TP:1;       /* Trusted Protect */
         uint32_t  PACR29_BW:1;       /* Buffer Writes */
         uint32_t  PACR29_SP:1;       /* Supervisor Protect */
         uint32_t  PACR29_WP:1;       /* Write Protect */
         uint32_t  PACR29_TP:1;       /* Trusted Protect */
         uint32_t  PACR30_BW:1;       /* Buffer Writes */
         uint32_t  PACR30_SP:1;       /* Supervisor Protect */
         uint32_t  PACR30_WP:1;       /* Write Protect */
         uint32_t  PACR30_TP:1;       /* Trusted Protect */
         uint32_t  PACR31_BW:1;       /* Buffer Writes */
         uint32_t  PACR31_SP:1;       /* Supervisor Protect */
         uint32_t  PACR31_WP:1;       /* Write Protect */
         uint32_t  PACR31_TP:1;       /* Trusted Protect */
      } B;
   } PBRIDGE_PACR24_31_32B_tag;

   typedef union {   /* OPACR0_7 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR0_BW:1;       /* Buffer Writes */
         uint32_t  OPACR0_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR0_WP:1;       /* Write Protect */
         uint32_t  OPACR0_TP:1;       /* Trusted Protect */
         uint32_t  OPACR1_BW:1;       /* Buffer Writes */
         uint32_t  OPACR1_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR1_WP:1;       /* Write Protect */
         uint32_t  OPACR1_TP:1;       /* Trusted Protect */
         uint32_t  OPACR2_BW:1;       /* Buffer Writes */
         uint32_t  OPACR2_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR2_WP:1;       /* Write Protect */
         uint32_t  OPACR2_TP:1;       /* Trusted Protect */
         uint32_t  OPACR3_BW:1;       /* Buffer Writes */
         uint32_t  OPACR3_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR3_WP:1;       /* Write Protect */
         uint32_t  OPACR3_TP:1;       /* Trusted Protect */
         uint32_t  OPACR4_BW:1;       /* Buffer Writes */
         uint32_t  OPACR4_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR4_WP:1;       /* Write Protect */
         uint32_t  OPACR4_TP:1;       /* Trusted Protect */
         uint32_t  OPACR5_BW:1;       /* Buffer Writes */
         uint32_t  OPACR5_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR5_WP:1;       /* Write Protect */
         uint32_t  OPACR5_TP:1;       /* Trusted Protect */
         uint32_t  OPACR6_BW:1;       /* Buffer Writes */
         uint32_t  OPACR6_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR6_WP:1;       /* Write Protect */
         uint32_t  OPACR6_TP:1;       /* Trusted Protect */
         uint32_t  OPACR7_BW:1;       /* Buffer Writes */
         uint32_t  OPACR7_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR7_WP:1;       /* Write Protect */
         uint32_t  OPACR7_TP:1;       /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR0_7_32B_tag;

