RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* OPACR8_15 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR8_BW:1;       /* Buffer Writes */
         uint32_t  OPACR8_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR8_WP:1;       /* Write Protect */
         uint32_t  OPACR8_TP:1;       /* Trusted Protect */
         uint32_t  OPACR9_BW:1;       /* Buffer Writes */
         uint32_t  OPACR9_SP:1;       /* Supervisor Protect */
         uint32_t  OPACR9_WP:1;       /* Write Protect */
         uint32_t  OPACR9_TP:1;       /* Trusted Protect */
         uint32_t  OPACR10_BW:1;      /* Buffer Writes */
         uint32_t  OPACR10_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR10_WP:1;      /* Write Protect */
         uint32_t  OPACR10_TP:1;      /* Trusted Protect */
         uint32_t  OPACR11_BW:1;      /* Buffer Writes */
         uint32_t  OPACR11_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR11_WP:1;      /* Write Protect */
         uint32_t  OPACR11_TP:1;      /* Trusted Protect */
         uint32_t  OPACR12_BW:1;      /* Buffer Writes */
         uint32_t  OPACR12_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR12_WP:1;      /* Write Protect */
         uint32_t  OPACR12_TP:1;      /* Trusted Protect */
         uint32_t  OPACR13_BW:1;      /* Buffer Writes */
         uint32_t  OPACR13_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR13_WP:1;      /* Write Protect */
         uint32_t  OPACR13_TP:1;      /* Trusted Protect */
         uint32_t  OPACR14_BW:1;      /* Buffer Writes */
         uint32_t  OPACR14_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR14_WP:1;      /* Write Protect */
         uint32_t  OPACR14_TP:1;      /* Trusted Protect */
         uint32_t  OPACR15_BW:1;      /* Buffer Writes */
         uint32_t  OPACR15_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR15_WP:1;      /* Write Protect */
         uint32_t  OPACR15_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR8_15_32B_tag;

   typedef union {   /* OPACR16_23 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR16_BW:1;      /* Buffer Writes */
         uint32_t  OPACR16_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR16_WP:1;      /* Write Protect */
         uint32_t  OPACR16_TP:1;      /* Trusted Protect */
         uint32_t  OPACR17_BW:1;      /* Buffer Writes */
         uint32_t  OPACR17_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR17_WP:1;      /* Write Protect */
         uint32_t  OPACR17_TP:1;      /* Trusted Protect */
         uint32_t  OPACR18_BW:1;      /* Buffer Writes */
         uint32_t  OPACR18_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR18_WP:1;      /* Write Protect */
         uint32_t  OPACR18_TP:1;      /* Trusted Protect */
         uint32_t  OPACR19_BW:1;      /* Buffer Writes */
         uint32_t  OPACR19_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR19_WP:1;      /* Write Protect */
         uint32_t  OPACR19_TP:1;      /* Trusted Protect */
         uint32_t  OPACR20_BW:1;      /* Buffer Writes */
         uint32_t  OPACR20_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR20_WP:1;      /* Write Protect */
         uint32_t  OPACR20_TP:1;      /* Trusted Protect */
         uint32_t  OPACR21_BW:1;      /* Buffer Writes */
         uint32_t  OPACR21_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR21_WP:1;      /* Write Protect */
         uint32_t  OPACR21_TP:1;      /* Trusted Protect */
         uint32_t  OPACR22_BW:1;      /* Buffer Writes */
         uint32_t  OPACR22_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR22_WP:1;      /* Write Protect */
         uint32_t  OPACR22_TP:1;      /* Trusted Protect */
         uint32_t  OPACR23_BW:1;      /* Buffer Writes */
         uint32_t  OPACR23_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR23_WP:1;      /* Write Protect */
         uint32_t  OPACR23_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR16_23_32B_tag;

   typedef union {   /* OPACR24_31 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR24_BW:1;      /* Buffer Writes */
         uint32_t  OPACR24_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR24_WP:1;      /* Write Protect */
         uint32_t  OPACR24_TP:1;      /* Trusted Protect */
         uint32_t  OPACR25_BW:1;      /* Buffer Writes */
         uint32_t  OPACR25_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR25_WP:1;      /* Write Protect */
         uint32_t  OPACR25_TP:1;      /* Trusted Protect */
         uint32_t  OPACR26_BW:1;      /* Buffer Writes */
         uint32_t  OPACR26_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR26_WP:1;      /* Write Protect */
         uint32_t  OPACR26_TP:1;      /* Trusted Protect */
         uint32_t  OPACR27_BW:1;      /* Buffer Writes */
         uint32_t  OPACR27_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR27_WP:1;      /* Write Protect */
         uint32_t  OPACR27_TP:1;      /* Trusted Protect */
         uint32_t  OPACR28_BW:1;      /* Buffer Writes */
         uint32_t  OPACR28_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR28_WP:1;      /* Write Protect */
         uint32_t  OPACR28_TP:1;      /* Trusted Protect */
         uint32_t  OPACR29_BW:1;      /* Buffer Writes */
         uint32_t  OPACR29_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR29_WP:1;      /* Write Protect */
         uint32_t  OPACR29_TP:1;      /* Trusted Protect */
         uint32_t  OPACR30_BW:1;      /* Buffer Writes */
         uint32_t  OPACR30_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR30_WP:1;      /* Write Protect */
         uint32_t  OPACR30_TP:1;      /* Trusted Protect */
         uint32_t  OPACR31_BW:1;      /* Buffer Writes */
         uint32_t  OPACR31_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR31_WP:1;      /* Write Protect */
         uint32_t  OPACR31_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR24_31_32B_tag;

   typedef union {   /* OPACR32_39 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR32_BW:1;      /* Buffer Writes */
         uint32_t  OPACR32_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR32_WP:1;      /* Write Protect */
         uint32_t  OPACR32_TP:1;      /* Trusted Protect */
         uint32_t  OPACR33_BW:1;      /* Buffer Writes */
         uint32_t  OPACR33_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR33_WP:1;      /* Write Protect */
         uint32_t  OPACR33_TP:1;      /* Trusted Protect */
         uint32_t  OPACR34_BW:1;      /* Buffer Writes */
         uint32_t  OPACR34_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR34_WP:1;      /* Write Protect */
         uint32_t  OPACR34_TP:1;      /* Trusted Protect */
         uint32_t  OPACR35_BW:1;      /* Buffer Writes */
         uint32_t  OPACR35_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR35_WP:1;      /* Write Protect */
         uint32_t  OPACR35_TP:1;      /* Trusted Protect */
         uint32_t  OPACR36_BW:1;      /* Buffer Writes */
         uint32_t  OPACR36_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR36_WP:1;      /* Write Protect */
         uint32_t  OPACR36_TP:1;      /* Trusted Protect */
         uint32_t  OPACR37_BW:1;      /* Buffer Writes */
         uint32_t  OPACR37_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR37_WP:1;      /* Write Protect */
         uint32_t  OPACR37_TP:1;      /* Trusted Protect */
         uint32_t  OPACR38_BW:1;      /* Buffer Writes */
         uint32_t  OPACR38_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR38_WP:1;      /* Write Protect */
         uint32_t  OPACR38_TP:1;      /* Trusted Protect */
         uint32_t  OPACR39_BW:1;      /* Buffer Writes */
         uint32_t  OPACR39_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR39_WP:1;      /* Write Protect */
         uint32_t  OPACR39_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR32_39_32B_tag;

   typedef union {   /* OPACR40_47 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR40_BW:1;      /* Buffer Writes */
         uint32_t  OPACR40_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR40_WP:1;      /* Write Protect */
         uint32_t  OPACR40_TP:1;      /* Trusted Protect */
         uint32_t  OPACR41_BW:1;      /* Buffer Writes */
         uint32_t  OPACR41_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR41_WP:1;      /* Write Protect */
         uint32_t  OPACR41_TP:1;      /* Trusted Protect */
         uint32_t  OPACR42_BW:1;      /* Buffer Writes */
         uint32_t  OPACR42_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR42_WP:1;      /* Write Protect */
         uint32_t  OPACR42_TP:1;      /* Trusted Protect */
         uint32_t  OPACR43_BW:1;      /* Buffer Writes */
         uint32_t  OPACR43_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR43_WP:1;      /* Write Protect */
         uint32_t  OPACR43_TP:1;      /* Trusted Protect */
         uint32_t  OPACR44_BW:1;      /* Buffer Writes */
         uint32_t  OPACR44_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR44_WP:1;      /* Write Protect */
         uint32_t  OPACR44_TP:1;      /* Trusted Protect */
         uint32_t  OPACR45_BW:1;      /* Buffer Writes */
         uint32_t  OPACR45_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR45_WP:1;      /* Write Protect */
         uint32_t  OPACR45_TP:1;      /* Trusted Protect */
         uint32_t  OPACR46_BW:1;      /* Buffer Writes */
         uint32_t  OPACR46_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR46_WP:1;      /* Write Protect */
         uint32_t  OPACR46_TP:1;      /* Trusted Protect */
         uint32_t  OPACR47_BW:1;      /* Buffer Writes */
         uint32_t  OPACR47_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR47_WP:1;      /* Write Protect */
         uint32_t  OPACR47_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR40_47_32B_tag;

   typedef union {   /* OPACR48_55 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR48_BW:1;      /* Buffer Writes */
         uint32_t  OPACR48_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR48_WP:1;      /* Write Protect */
         uint32_t  OPACR48_TP:1;      /* Trusted Protect */
         uint32_t  OPACR49_BW:1;      /* Buffer Writes */
         uint32_t  OPACR49_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR49_WP:1;      /* Write Protect */
         uint32_t  OPACR49_TP:1;      /* Trusted Protect */
         uint32_t  OPACR50_BW:1;      /* Buffer Writes */
         uint32_t  OPACR50_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR50_WP:1;      /* Write Protect */
         uint32_t  OPACR50_TP:1;      /* Trusted Protect */
         uint32_t  OPACR51_BW:1;      /* Buffer Writes */
         uint32_t  OPACR51_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR51_WP:1;      /* Write Protect */
         uint32_t  OPACR51_TP:1;      /* Trusted Protect */
         uint32_t  OPACR52_BW:1;      /* Buffer Writes */
         uint32_t  OPACR52_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR52_WP:1;      /* Write Protect */
         uint32_t  OPACR52_TP:1;      /* Trusted Protect */
         uint32_t  OPACR53_BW:1;      /* Buffer Writes */
         uint32_t  OPACR53_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR53_WP:1;      /* Write Protect */
         uint32_t  OPACR53_TP:1;      /* Trusted Protect */
         uint32_t  OPACR54_BW:1;      /* Buffer Writes */
         uint32_t  OPACR54_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR54_WP:1;      /* Write Protect */
         uint32_t  OPACR54_TP:1;      /* Trusted Protect */
         uint32_t  OPACR55_BW:1;      /* Buffer Writes */
         uint32_t  OPACR55_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR55_WP:1;      /* Write Protect */
         uint32_t  OPACR55_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR48_55_32B_tag;

   typedef union {   /* OPACR56_63 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR56_BW:1;      /* Buffer Writes */
         uint32_t  OPACR56_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR56_WP:1;      /* Write Protect */
         uint32_t  OPACR56_TP:1;      /* Trusted Protect */
         uint32_t  OPACR57_BW:1;      /* Buffer Writes */
         uint32_t  OPACR57_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR57_WP:1;      /* Write Protect */
         uint32_t  OPACR57_TP:1;      /* Trusted Protect */
         uint32_t  OPACR58_BW:1;      /* Buffer Writes */
         uint32_t  OPACR58_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR58_WP:1;      /* Write Protect */
         uint32_t  OPACR58_TP:1;      /* Trusted Protect */
         uint32_t  OPACR59_BW:1;      /* Buffer Writes */
         uint32_t  OPACR59_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR59_WP:1;      /* Write Protect */
         uint32_t  OPACR59_TP:1;      /* Trusted Protect */
         uint32_t  OPACR60_BW:1;      /* Buffer Writes */
         uint32_t  OPACR60_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR60_WP:1;      /* Write Protect */
         uint32_t  OPACR60_TP:1;      /* Trusted Protect */
         uint32_t  OPACR61_BW:1;      /* Buffer Writes */
         uint32_t  OPACR61_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR61_WP:1;      /* Write Protect */
         uint32_t  OPACR61_TP:1;      /* Trusted Protect */
         uint32_t  OPACR62_BW:1;      /* Buffer Writes */
         uint32_t  OPACR62_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR62_WP:1;      /* Write Protect */
         uint32_t  OPACR62_TP:1;      /* Trusted Protect */
         uint32_t  OPACR63_BW:1;      /* Buffer Writes */
         uint32_t  OPACR63_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR63_WP:1;      /* Write Protect */
         uint32_t  OPACR63_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR56_63_32B_tag;

