RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* OPACR64_71 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR64_BW:1;      /* Buffer Writes */
         uint32_t  OPACR64_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR64_WP:1;      /* Write Protect */
         uint32_t  OPACR64_TP:1;      /* Trusted Protect */
         uint32_t  OPACR65_BW:1;      /* Buffer Writes */
         uint32_t  OPACR65_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR65_WP:1;      /* Write Protect */
         uint32_t  OPACR65_TP:1;      /* Trusted Protect */
         uint32_t  OPACR66_BW:1;      /* Buffer Writes */
         uint32_t  OPACR66_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR66_WP:1;      /* Write Protect */
         uint32_t  OPACR66_TP:1;      /* Trusted Protect */
         uint32_t  OPACR67_BW:1;      /* Buffer Writes */
         uint32_t  OPACR67_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR67_WP:1;      /* Write Protect */
         uint32_t  OPACR67_TP:1;      /* Trusted Protect */
         uint32_t  OPACR68_BW:1;      /* Buffer Writes */
         uint32_t  OPACR68_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR68_WP:1;      /* Write Protect */
         uint32_t  OPACR68_TP:1;      /* Trusted Protect */
         uint32_t  OPACR69_BW:1;      /* Buffer Writes */
         uint32_t  OPACR69_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR69_WP:1;      /* Write Protect */
         uint32_t  OPACR69_TP:1;      /* Trusted Protect */
         uint32_t  OPACR70_BW:1;      /* Buffer Writes */
         uint32_t  OPACR70_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR70_WP:1;      /* Write Protect */
         uint32_t  OPACR70_TP:1;      /* Trusted Protect */
         uint32_t  OPACR71_BW:1;      /* Buffer Writes */
         uint32_t  OPACR71_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR71_WP:1;      /* Write Protect */
         uint32_t  OPACR71_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR64_71_32B_tag;

   typedef union {   /* OPACR72_79 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR72_BW:1;      /* Buffer Writes */
         uint32_t  OPACR72_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR72_WP:1;      /* Write Protect */
         uint32_t  OPACR72_TP:1;      /* Trusted Protect */
         uint32_t  OPACR73_BW:1;      /* Buffer Writes */
         uint32_t  OPACR73_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR73_WP:1;      /* Write Protect */
         uint32_t  OPACR73_TP:1;      /* Trusted Protect */
         uint32_t  OPACR74_BW:1;      /* Buffer Writes */
         uint32_t  OPACR74_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR74_WP:1;      /* Write Protect */
         uint32_t  OPACR74_TP:1;      /* Trusted Protect */
         uint32_t  OPACR75_BW:1;      /* Buffer Writes */
         uint32_t  OPACR75_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR75_WP:1;      /* Write Protect */
         uint32_t  OPACR75_TP:1;      /* Trusted Protect */
         uint32_t  OPACR76_BW:1;      /* Buffer Writes */
         uint32_t  OPACR76_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR76_WP:1;      /* Write Protect */
         uint32_t  OPACR76_TP:1;      /* Trusted Protect */
         uint32_t  OPACR77_BW:1;      /* Buffer Writes */
         uint32_t  OPACR77_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR77_WP:1;      /* Write Protect */
         uint32_t  OPACR77_TP:1;      /* Trusted Protect */
         uint32_t  OPACR78_BW:1;      /* Buffer Writes */
         uint32_t  OPACR78_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR78_WP:1;      /* Write Protect */
         uint32_t  OPACR78_TP:1;      /* Trusted Protect */
         uint32_t  OPACR79_BW:1;      /* Buffer Writes */
         uint32_t  OPACR79_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR79_WP:1;      /* Write Protect */
         uint32_t  OPACR79_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR72_79_32B_tag;

   typedef union {   /* OPACR80_87 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR80_BW:1;      /* Buffer Writes */
         uint32_t  OPACR80_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR80_WP:1;      /* Write Protect */
         uint32_t  OPACR80_TP:1;      /* Trusted Protect */
         uint32_t  OPACR81_BW:1;      /* Buffer Writes */
         uint32_t  OPACR81_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR81_WP:1;      /* Write Protect */
         uint32_t  OPACR81_TP:1;      /* Trusted Protect */
         uint32_t  OPACR82_BW:1;      /* Buffer Writes */
         uint32_t  OPACR82_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR82_WP:1;      /* Write Protect */
         uint32_t  OPACR82_TP:1;      /* Trusted Protect */
         uint32_t  OPACR83_BW:1;      /* Buffer Writes */
         uint32_t  OPACR83_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR83_WP:1;      /* Write Protect */
         uint32_t  OPACR83_TP:1;      /* Trusted Protect */
         uint32_t  OPACR84_BW:1;      /* Buffer Writes */
         uint32_t  OPACR84_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR84_WP:1;      /* Write Protect */
         uint32_t  OPACR84_TP:1;      /* Trusted Protect */
         uint32_t  OPACR85_BW:1;      /* Buffer Writes */
         uint32_t  OPACR85_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR85_WP:1;      /* Write Protect */
         uint32_t  OPACR85_TP:1;      /* Trusted Protect */
         uint32_t  OPACR86_BW:1;      /* Buffer Writes */
         uint32_t  OPACR86_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR86_WP:1;      /* Write Protect */
         uint32_t  OPACR86_TP:1;      /* Trusted Protect */
         uint32_t  OPACR87_BW:1;      /* Buffer Writes */
         uint32_t  OPACR87_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR87_WP:1;      /* Write Protect */
         uint32_t  OPACR87_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR80_87_32B_tag;

   typedef union {   /* OPACR88_95 - Off-Platform Peripheral Access Control Registers */
      uint32_t R;
      struct {
         uint32_t  OPACR88_BW:1;      /* Buffer Writes */
         uint32_t  OPACR88_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR88_WP:1;      /* Write Protect */
         uint32_t  OPACR88_TP:1;      /* Trusted Protect */
         uint32_t  OPACR89_BW:1;      /* Buffer Writes */
         uint32_t  OPACR89_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR89_WP:1;      /* Write Protect */
         uint32_t  OPACR89_TP:1;      /* Trusted Protect */
         uint32_t  OPACR90_BW:1;      /* Buffer Writes */
         uint32_t  OPACR90_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR90_WP:1;      /* Write Protect */
         uint32_t  OPACR90_TP:1;      /* Trusted Protect */
         uint32_t  OPACR91_BW:1;      /* Buffer Writes */
         uint32_t  OPACR91_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR91_WP:1;      /* Write Protect */
         uint32_t  OPACR91_TP:1;      /* Trusted Protect */
         uint32_t  OPACR92_BW:1;      /* Buffer Writes */
         uint32_t  OPACR92_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR92_WP:1;      /* Write Protect */
         uint32_t  OPACR92_TP:1;      /* Trusted Protect */
         uint32_t  OPACR93_BW:1;      /* Buffer Writes */
         uint32_t  OPACR93_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR93_WP:1;      /* Write Protect */
         uint32_t  OPACR93_TP:1;      /* Trusted Protect */
         uint32_t  OPACR94_BW:1;      /* Buffer Writes */
         uint32_t  OPACR94_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR94_WP:1;      /* Write Protect */
         uint32_t  OPACR94_TP:1;      /* Trusted Protect */
         uint32_t  OPACR95_BW:1;      /* Buffer Writes */
         uint32_t  OPACR95_SP:1;      /* Supervisor Protect */
         uint32_t  OPACR95_WP:1;      /* Write Protect */
         uint32_t  OPACR95_TP:1;      /* Trusted Protect */
      } B;
   } PBRIDGE_OPACR88_95_32B_tag;



