RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef struct PBRIDGE_struct_tag { /* start of PBRIDGE_tag */
                                   /* MPROT - Master Privilege Registers */
      PBRIDGE_MPROT_32B_tag MPROT;            /* offset: 0x0000 size: 32 bit */
      int8_t PBRIDGE_reserved_0004[28];
                        /* PACR0_7 - Peripheral Access Control Registers */
      PBRIDGE_PACR0_7_32B_tag PACR0_7;        /* offset: 0x0020 size: 32 bit */
                       /* PACR8_15 - Peripheral Access Control Registers */
      PBRIDGE_PACR8_15_32B_tag PACR8_15;      /* offset: 0x0024 size: 32 bit */
                      /* PACR16_23 - Peripheral Access Control Registers */
      PBRIDGE_PACR16_23_32B_tag PACR16_23;    /* offset: 0x0028 size: 32 bit */
                      /* PACR24_31 - Peripheral Access Control Registers */
      PBRIDGE_PACR24_31_32B_tag PACR24_31;    /* offset: 0x002C size: 32 bit */
      int8_t PBRIDGE_reserved_0030[16];
          /* OPACR0_7 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR0_7_32B_tag OPACR0_7;      /* offset: 0x0040 size: 32 bit */
         /* OPACR8_15 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR8_15_32B_tag OPACR8_15;    /* offset: 0x0044 size: 32 bit */
        /* OPACR16_23 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR16_23_32B_tag OPACR16_23;  /* offset: 0x0048 size: 32 bit */
        /* OPACR24_31 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR24_31_32B_tag OPACR24_31;  /* offset: 0x004C size: 32 bit */
        /* OPACR32_39 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR32_39_32B_tag OPACR32_39;  /* offset: 0x0050 size: 32 bit */
        /* OPACR40_47 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR40_47_32B_tag OPACR40_47;  /* offset: 0x0054 size: 32 bit */
        /* OPACR48_55 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR48_55_32B_tag OPACR48_55;  /* offset: 0x0058 size: 32 bit */
        /* OPACR56_63 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR56_63_32B_tag OPACR56_63;  /* offset: 0x005C size: 32 bit */
        /* OPACR64_71 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR64_71_32B_tag OPACR64_71;  /* offset: 0x0060 size: 32 bit */
        /* OPACR72_79 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR72_79_32B_tag OPACR72_79;  /* offset: 0x0064 size: 32 bit */
        /* OPACR80_87 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR80_87_32B_tag OPACR80_87;  /* offset: 0x0068 size: 32 bit */
        /* OPACR88_95 - Off-Platform Peripheral Access Control Registers */
      PBRIDGE_OPACR88_95_32B_tag OPACR88_95;  /* offset: 0x006C size: 32 bit */
   } PBRIDGE_tag;


#define PBRIDGE  (*(volatile PBRIDGE_tag *) 0xFFF00000UL)



/****************************************************************/
/*                                                              */
/* Module: MAX  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers MPR... */

   typedef union {   /* Master Priority Register for slave port n */
      uint32_t R;
      struct {
         uint32_t:1;
         uint32_t  MSTR_7:3;          /* Master 7 Priority */
         uint32_t:1;
         uint32_t  MSTR_6:3;          /* Master 6 Priority */
         uint32_t:1;
         uint32_t  MSTR_5:3;          /* Master 5 Priority */
         uint32_t:1;
         uint32_t  MSTR_4:3;          /* Master 4 Priority */
         uint32_t:1;
         uint32_t  MSTR_3:3;          /* Master 3 Priority */
         uint32_t:1;
         uint32_t  MSTR_2:3;          /* Master 2 Priority */
         uint32_t:1;
         uint32_t  MSTR_1:3;          /* Master 1 Priority */
         uint32_t:1;
         uint32_t  MSTR_0:3;          /* Master 0 Priority */
      } B;
   } MAX_MPR_32B_tag;


   /* Register layout for all registers AMPR matches xxx */


   /* Register layout for all registers SGPCR... */

   typedef union {   /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
      uint32_t R;
      struct {
         uint32_t  RO:1;              /* Read Only */
         uint32_t  HLP:1;             /* Halt Low Priority */
         uint32_t:6;
         uint32_t  HPE7:1;            /* High Priority Enable */
         uint32_t  HPE6:1;            /* High Priority Enable */
         uint32_t  HPE5:1;            /* High Priority Enable */
         uint32_t  HPE4:1;            /* High Priority Enable */
         uint32_t  HPE3:1;            /* High Priority Enable */
         uint32_t  HPE2:1;            /* High Priority Enable */
         uint32_t  HPE1:1;            /* High Priority Enable */
         uint32_t  HPE0:1;            /* High Priority Enable */
         uint32_t:6;
         uint32_t  ARB:2;             /* Arbitration Mode */
         uint32_t:2;
         uint32_t  PCTL:2;            /* Parking Control */
         uint32_t:1;
         uint32_t  PARK:3;            /* Park */
      } B;
   } MAX_SGPCR_32B_tag;


   /* Register layout for all registers ASGPCR... */

   typedef union {   /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
      uint32_t R;
      struct {
         uint32_t:1;
         uint32_t  HLP:1;             /* Halt Low Priority */
         uint32_t:6;
         uint32_t  HPE7:1;            /* High Priority Enable */
         uint32_t  HPE6:1;            /* High Priority Enable */
         uint32_t  HPE5:1;            /* High Priority Enable */
         uint32_t  HPE4:1;            /* High Priority Enable */
         uint32_t  HPE3:1;            /* High Priority Enable */
         uint32_t  HPE2:1;            /* High Priority Enable */
         uint32_t  HPE1:1;            /* High Priority Enable */
         uint32_t  HPE0:1;            /* High Priority Enable */
         uint32_t:6;
         uint32_t  ARB:2;             /* Arbitration Mode */
         uint32_t:2;
         uint32_t  PCTL:2;            /* Parking Control */
         uint32_t:1;
         uint32_t  PARK:3;            /* Park */
      } B;
   } MAX_ASGPCR_32B_tag;


