RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   /* Register layout for all registers MGPCR... */

   typedef union {   /* MAX_MGPCRn - Master General Purpose Control Register n */
      uint32_t R;
      struct {
         uint32_t:29;
         uint32_t  AULB:3;            /* Arbitrate on Undefined Length Bursts */
      } B;
   } MAX_MGPCR_32B_tag;


   typedef struct MAX_SLAVE_PORT_struct_tag {

                            /* Master Priority Register for slave port n */
      MAX_MPR_32B_tag MPR;                /* relative offset: 0x0000 */
                  /* Alternate Master Priority Register for slave port n */
      MAX_MPR_32B_tag AMPR;               /* relative offset: 0x0004 */
      int8_t MAX_SLAVE_PORT_reserved_0008[8];
    /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
      MAX_SGPCR_32B_tag SGPCR;            /* relative offset: 0x0010 */
       /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
      MAX_ASGPCR_32B_tag ASGPCR;          /* relative offset: 0x0014 */
      int8_t MAX_SLAVE_PORT_reserved_0018[232];

   } MAX_SLAVE_PORT_tag;

   typedef struct MAX_MASTER_PORT_struct_tag {

               /* MAX_MGPCRn - Master General Purpose Control Register n */
      MAX_MGPCR_32B_tag MGPCR;            /* relative offset: 0x0000 */
      int8_t MAX_MASTER_PORT_reserved_0004[252];

   } MAX_MASTER_PORT_tag;


   typedef struct MAX_struct_tag { /* start of MAX_tag */
      union {
                                             /*  Register set SLAVE_PORT */
         MAX_SLAVE_PORT_tag SLAVE_PORT[8];  /* offset: 0x0000  (0x0100 x 8) */

         struct {
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR0;          /* offset: 0x0000 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR0;         /* offset: 0x0004 size: 32 bit */
            int8_t MAX_reserved_0008_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR0;      /* offset: 0x0010 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR0;    /* offset: 0x0014 size: 32 bit */
            int8_t MAX_reserved_0018_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR1;          /* offset: 0x0100 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR1;         /* offset: 0x0104 size: 32 bit */
            int8_t MAX_reserved_0108_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR1;      /* offset: 0x0110 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR1;    /* offset: 0x0114 size: 32 bit */
            int8_t MAX_reserved_0118_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR2;          /* offset: 0x0200 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR2;         /* offset: 0x0204 size: 32 bit */
            int8_t MAX_reserved_0208_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR2;      /* offset: 0x0210 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR2;    /* offset: 0x0214 size: 32 bit */
            int8_t MAX_reserved_0218_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR3;          /* offset: 0x0300 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR3;         /* offset: 0x0304 size: 32 bit */
            int8_t MAX_reserved_0308_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR3;      /* offset: 0x0310 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR3;    /* offset: 0x0314 size: 32 bit */
            int8_t MAX_reserved_0318_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR4;          /* offset: 0x0400 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR4;         /* offset: 0x0404 size: 32 bit */
            int8_t MAX_reserved_0408_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR4;      /* offset: 0x0410 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR4;    /* offset: 0x0414 size: 32 bit */
            int8_t MAX_reserved_0418_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR5;          /* offset: 0x0500 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR5;         /* offset: 0x0504 size: 32 bit */
            int8_t MAX_reserved_0508_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR5;      /* offset: 0x0510 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR5;    /* offset: 0x0514 size: 32 bit */
            int8_t MAX_reserved_0518_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR6;          /* offset: 0x0600 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR6;         /* offset: 0x0604 size: 32 bit */
            int8_t MAX_reserved_0608_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR6;      /* offset: 0x0610 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR6;    /* offset: 0x0614 size: 32 bit */
            int8_t MAX_reserved_0618_I1[232];
                            /* Master Priority Register for slave port n */
            MAX_MPR_32B_tag MPR7;          /* offset: 0x0700 size: 32 bit */
                  /* Alternate Master Priority Register for slave port n */
            MAX_MPR_32B_tag AMPR7;         /* offset: 0x0704 size: 32 bit */
            int8_t MAX_reserved_0708_I1[8];
          /* MAX_SGPCRn - MAX General Purpose Control Register for Slave Port n */
            MAX_SGPCR_32B_tag SGPCR7;      /* offset: 0x0710 size: 32 bit */
          /* MAX_ASGPCRn - MAX Alternate General Purpose Control Register n */
            MAX_ASGPCR_32B_tag ASGPCR7;    /* offset: 0x0714 size: 32 bit */
            int8_t MAX_reserved_0718_E1[232];
         };

