RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
                                            /*  Register set MASTER_PORT */
         MAX_MASTER_PORT_tag MASTER_PORT[8];  /* offset: 0x0800  (0x0100 x 8) */

         struct {
               /* MAX_MGPCRn - Master General Purpose Control Register n */
            MAX_MGPCR_32B_tag MGPCR0;      /* offset: 0x0800 size: 32 bit */
            int8_t MAX_reserved_0804_I1[252];
            MAX_MGPCR_32B_tag MGPCR1;      /* offset: 0x0900 size: 32 bit */
            int8_t MAX_reserved_0904_I1[252];
            MAX_MGPCR_32B_tag MGPCR2;      /* offset: 0x0A00 size: 32 bit */
            int8_t MAX_reserved_0A04_I1[252];
            MAX_MGPCR_32B_tag MGPCR3;      /* offset: 0x0B00 size: 32 bit */
            int8_t MAX_reserved_0B04_I1[252];
            MAX_MGPCR_32B_tag MGPCR4;      /* offset: 0x0C00 size: 32 bit */
            int8_t MAX_reserved_0C04_I1[252];
            MAX_MGPCR_32B_tag MGPCR5;      /* offset: 0x0D00 size: 32 bit */
            int8_t MAX_reserved_0D04_I1[252];
            MAX_MGPCR_32B_tag MGPCR6;      /* offset: 0x0E00 size: 32 bit */
            int8_t MAX_reserved_0E04_I1[252];
            MAX_MGPCR_32B_tag MGPCR7;      /* offset: 0x0F00 size: 32 bit */
            int8_t MAX_reserved_0F04_E1[252];
         };

      };
   } MAX_tag;


#define MAX   (*(volatile MAX_tag *) 0xFFF04000UL)



/****************************************************************/
/*                                                              */
/* Module: MPU  */
/*                                                              */
/****************************************************************/

   typedef union {   /* MPU_CESR - MPU Control/Error Status Register */
      uint32_t R;
      struct {
         uint32_t  SPERR:8;           /* Slave Port n Error */
         uint32_t:4;
         uint32_t  HRL:4;             /* Hardware Revision Level */
         uint32_t  NSP:4;             /* Number of Slave Ports */
         uint32_t  NRGD:4;            /* Number of Region Descriptors */
         uint32_t:7;
         uint32_t  VLD:1;             /* Valid bit */
      } B;
   } MPU_CESR_32B_tag;


   /* Register layout for all registers EAR... */

   typedef union {   /* MPU_EARn - MPU Error Address Register, Slave Port n */
      uint32_t R;
      struct {
         uint32_t  EADDR:32;          /* Error Address */
      } B;
   } MPU_EAR_32B_tag;


   /* Register layout for all registers EDR... */

   typedef union {   /* MPU_EDRn - MPU Error Detail Register, Slave Port n */
      uint32_t R;
      struct {
         uint32_t  EACD:16;           /* Error Access Control Detail */
         uint32_t  EPID:8;            /* Error Process Identification */
         uint32_t  EMN:4;             /* Error Master Number */
         uint32_t  EATTR:3;           /* Error Attributes */
         uint32_t  ERW:1;             /* Error Read/Write */
      } B;
   } MPU_EDR_32B_tag;


   /* Register layout for all registers RGD_WORD0... */

   typedef union {   /* MPU_RGDn_Word0 - MPU Region Descriptor */
      uint32_t R;
      struct {
         uint32_t  SRTADDR:27;        /* Start Address */
         uint32_t:5;
      } B;
   } MPU_RGD_WORD0_32B_tag;


   /* Register layout for all registers RGD_WORD1... */

   typedef union {   /* MPU_RGDn_Word1 - MPU Region Descriptor */
      uint32_t R;
      struct {
         uint32_t  ENDADDR:27;        /* End Address */
         uint32_t:5;
      } B;
   } MPU_RGD_WORD1_32B_tag;


   /* Register layout for all registers RGD_WORD2... */

   typedef union {   /* MPU_RGDn_Word2 - MPU Region Descriptor */
      uint32_t R;
      struct {
         uint32_t  M7RE:1;            /* Bus Master 7 Read Enable */
         uint32_t  M7WE:1;            /* Bus Master 7 Write Enable */
         uint32_t  M6RE:1;            /* Bus Master 6 Read Enable */
         uint32_t  M6WE:1;            /* Bus Master 7 Write Enable */
         uint32_t  M5RE:1;            /* Bus Master 5 Read Enable */
         uint32_t  M5WE:1;            /* Bus Master 5 Write Enable */
         uint32_t  M4RE:1;            /* Bus Master 4 Read Enable */
         uint32_t  M4WE:1;            /* Bus Master 4 Write Enable */
         uint32_t  M3PE:1;            /* Bus Master 3 Process Identifier Enable */
         uint32_t  M3SM:2;            /* Bus Master 3 Supervisor Mode Access Control */
         uint32_t  M3UM:3;            /* Bus Master 3 User Mode Access Control */
         uint32_t  M2PE:1;            /* Bus Master 2 Process Identifier Enable */
         uint32_t  M2SM:2;            /* Bus Master 2 Supervisor Mode Access Control */
         uint32_t  M2UM:3;            /* Bus Master 2 User Mode Access Control */
         uint32_t  M1PE:1;            /* Bus Master 1 Process Identifier Enable */
         uint32_t  M1SM:2;            /* Bus Master 1 Supervisor Mode Access Control */
         uint32_t  M1UM:3;            /* Bus Master 1 User Mode Access Control */
         uint32_t  M0PE:1;            /* Bus Master 0 Process Identifier Enable */
         uint32_t  M0SM:2;            /* Bus Master 0 Supervisor Mode Access Control */
         uint32_t  M0UM:3;            /* Bus Master 0 User Mode Access Control */
      } B;
   } MPU_RGD_WORD2_32B_tag;


   /* Register layout for all registers RGD_WORD3... */

   typedef union {   /* MPU_RGDn_Word3 - MPU Region Descriptor */
      uint32_t R;
      struct {
         uint32_t  PID:8;             /* Process Identifier */
         uint32_t  PIDMASK:8;         /* Process Identifier Mask */
         uint32_t:15;
         uint32_t  VLD:1;             /* Valid */
      } B;
   } MPU_RGD_WORD3_32B_tag;


   /* Register layout for all registers RGDAAC... */

   typedef union {   /* MPU_RGDAACn -  MPU Region Descriptor Alternate Access Control */
      uint32_t R;
      struct {
         uint32_t  M7RE:1;            /* Bus Master 7 Read Enable */
         uint32_t  M7WE:1;            /* Bus Master 7 Write Enable */
         uint32_t  M6RE:1;            /* Bus Master 6 Read Enable */
         uint32_t  M6WE:1;            /* Bus Master 7 Write Enable */
         uint32_t  M5RE:1;            /* Bus Master 5 Read Enable */
         uint32_t  M5WE:1;            /* Bus Master 5 Write Enable */
         uint32_t  M4RE:1;            /* Bus Master 4 Read Enable */
         uint32_t  M4WE:1;            /* Bus Master 4 Write Enable */
         uint32_t  M3PE:1;            /* Bus Master 3 Process Identifier Enable */
         uint32_t  M3SM:2;            /* Bus Master 3 Supervisor Mode Access Control */
         uint32_t  M3UM:3;            /* Bus Master 3 User Mode Access Control */
         uint32_t  M2PE:1;            /* Bus Master 2 Process Identifier Enable */
         uint32_t  M2SM:2;            /* Bus Master 2 Supervisor Mode Access Control */
         uint32_t  M2UM:3;            /* Bus Master 2 User Mode Access Control */
         uint32_t  M1PE:1;            /* Bus Master 1 Process Identifier Enable */
         uint32_t  M1SM:2;            /* Bus Master 1 Supervisor Mode Access Control */
         uint32_t  M1UM:3;            /* Bus Master 1 User Mode Access Control */
         uint32_t  M0PE:1;            /* Bus Master 0 Process Identifier Enable */
         uint32_t  M0SM:2;            /* Bus Master 0 Supervisor Mode Access Control */
         uint32_t  M0UM:3;            /* Bus Master 0 User Mode Access Control */
      } B;
   } MPU_RGDAAC_32B_tag;


   typedef struct MPU_SLAVE_PORT_struct_tag {

                  /* MPU_EARn - MPU Error Address Register, Slave Port n */
      MPU_EAR_32B_tag EAR;                /* relative offset: 0x0000 */
                   /* MPU_EDRn - MPU Error Detail Register, Slave Port n */
      MPU_EDR_32B_tag EDR;                /* relative offset: 0x0004 */

   } MPU_SLAVE_PORT_tag;

