RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef struct MPU_REGION_struct_tag {

                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
      MPU_RGD_WORD0_32B_tag RGD_WORD0;    /* relative offset: 0x0000 */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
      MPU_RGD_WORD1_32B_tag RGD_WORD1;    /* relative offset: 0x0004 */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
      MPU_RGD_WORD2_32B_tag RGD_WORD2;    /* relative offset: 0x0008 */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
      MPU_RGD_WORD3_32B_tag RGD_WORD3;    /* relative offset: 0x000C */

   } MPU_REGION_tag;


   typedef struct MPU_struct_tag { /* start of MPU_tag */
                         /* MPU_CESR - MPU Control/Error Status Register */
      MPU_CESR_32B_tag CESR;               /* offset: 0x0000 size: 32 bit */
      int8_t MPU_reserved_0004_C[12];
      union {
                                             /*  Register set SLAVE_PORT */
         MPU_SLAVE_PORT_tag SLAVE_PORT[4];  /* offset: 0x0010  (0x0008 x 4) */

         struct {
                  /* MPU_EARn - MPU Error Address Register, Slave Port n */
            MPU_EAR_32B_tag EAR0;          /* offset: 0x0010 size: 32 bit */
                   /* MPU_EDRn - MPU Error Detail Register, Slave Port n */
            MPU_EDR_32B_tag EDR0;          /* offset: 0x0014 size: 32 bit */
                  /* MPU_EARn - MPU Error Address Register, Slave Port n */
            MPU_EAR_32B_tag EAR1;          /* offset: 0x0018 size: 32 bit */
                   /* MPU_EDRn - MPU Error Detail Register, Slave Port n */
            MPU_EDR_32B_tag EDR1;          /* offset: 0x001C size: 32 bit */
                  /* MPU_EARn - MPU Error Address Register, Slave Port n */
            MPU_EAR_32B_tag EAR2;          /* offset: 0x0020 size: 32 bit */
                   /* MPU_EDRn - MPU Error Detail Register, Slave Port n */
            MPU_EDR_32B_tag EDR2;          /* offset: 0x0024 size: 32 bit */
                  /* MPU_EARn - MPU Error Address Register, Slave Port n */
            MPU_EAR_32B_tag EAR3;          /* offset: 0x0028 size: 32 bit */
                   /* MPU_EDRn - MPU Error Detail Register, Slave Port n */
            MPU_EDR_32B_tag EDR3;          /* offset: 0x002C size: 32 bit */
         };

      };
      int8_t MPU_reserved_0030_C[976];
      union {
                                                 /*  Register set REGION */
         MPU_REGION_tag REGION[16];        /* offset: 0x0400  (0x0010 x 16) */

         struct {
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD0_WORD0;  /* offset: 0x0400 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD0_WORD1;  /* offset: 0x0404 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD0_WORD2;  /* offset: 0x0408 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD0_WORD3;  /* offset: 0x040C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD1_WORD0;  /* offset: 0x0410 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD1_WORD1;  /* offset: 0x0414 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD1_WORD2;  /* offset: 0x0418 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD1_WORD3;  /* offset: 0x041C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD2_WORD0;  /* offset: 0x0420 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD2_WORD1;  /* offset: 0x0424 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD2_WORD2;  /* offset: 0x0428 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD2_WORD3;  /* offset: 0x042C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD3_WORD0;  /* offset: 0x0430 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD3_WORD1;  /* offset: 0x0434 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD3_WORD2;  /* offset: 0x0438 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD3_WORD3;  /* offset: 0x043C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD4_WORD0;  /* offset: 0x0440 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD4_WORD1;  /* offset: 0x0444 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD4_WORD2;  /* offset: 0x0448 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD4_WORD3;  /* offset: 0x044C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD5_WORD0;  /* offset: 0x0450 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD5_WORD1;  /* offset: 0x0454 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD5_WORD2;  /* offset: 0x0458 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD5_WORD3;  /* offset: 0x045C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD6_WORD0;  /* offset: 0x0460 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD6_WORD1;  /* offset: 0x0464 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD6_WORD2;  /* offset: 0x0468 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD6_WORD3;  /* offset: 0x046C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD7_WORD0;  /* offset: 0x0470 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD7_WORD1;  /* offset: 0x0474 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD7_WORD2;  /* offset: 0x0478 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD7_WORD3;  /* offset: 0x047C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD8_WORD0;  /* offset: 0x0480 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD8_WORD1;  /* offset: 0x0484 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD8_WORD2;  /* offset: 0x0488 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD8_WORD3;  /* offset: 0x048C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD9_WORD0;  /* offset: 0x0490 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD9_WORD1;  /* offset: 0x0494 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD9_WORD2;  /* offset: 0x0498 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD9_WORD3;  /* offset: 0x049C size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD10_WORD0;  /* offset: 0x04A0 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD10_WORD1;  /* offset: 0x04A4 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD10_WORD2;  /* offset: 0x04A8 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD10_WORD3;  /* offset: 0x04AC size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD11_WORD0;  /* offset: 0x04B0 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD11_WORD1;  /* offset: 0x04B4 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD11_WORD2;  /* offset: 0x04B8 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD11_WORD3;  /* offset: 0x04BC size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD12_WORD0;  /* offset: 0x04C0 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD12_WORD1;  /* offset: 0x04C4 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD12_WORD2;  /* offset: 0x04C8 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD12_WORD3;  /* offset: 0x04CC size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD13_WORD0;  /* offset: 0x04D0 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD13_WORD1;  /* offset: 0x04D4 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD13_WORD2;  /* offset: 0x04D8 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD13_WORD3;  /* offset: 0x04DC size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD14_WORD0;  /* offset: 0x04E0 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD14_WORD1;  /* offset: 0x04E4 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD14_WORD2;  /* offset: 0x04E8 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD14_WORD3;  /* offset: 0x04EC size: 32 bit */
                               /* MPU_RGDn_Word0 - MPU Region Descriptor */
            MPU_RGD_WORD0_32B_tag RGD15_WORD0;  /* offset: 0x04F0 size: 32 bit */
                               /* MPU_RGDn_Word1 - MPU Region Descriptor */
            MPU_RGD_WORD1_32B_tag RGD15_WORD1;  /* offset: 0x04F4 size: 32 bit */
                               /* MPU_RGDn_Word2 - MPU Region Descriptor */
            MPU_RGD_WORD2_32B_tag RGD15_WORD2;  /* offset: 0x04F8 size: 32 bit */
                               /* MPU_RGDn_Word3 - MPU Region Descriptor */
            MPU_RGD_WORD3_32B_tag RGD15_WORD3;  /* offset: 0x04FC size: 32 bit */
         };

