RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      int8_t MPU_reserved_0500_C[768];
      union {
        /* MPU_RGDAACn -  MPU Region Descriptor Alternate Access Control */
         MPU_RGDAAC_32B_tag RGDAAC[16];    /* offset: 0x0800  (0x0004 x 16) */

         struct {
        /* MPU_RGDAACn -  MPU Region Descriptor Alternate Access Control */
            MPU_RGDAAC_32B_tag RGDAAC0;    /* offset: 0x0800 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC1;    /* offset: 0x0804 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC2;    /* offset: 0x0808 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC3;    /* offset: 0x080C size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC4;    /* offset: 0x0810 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC5;    /* offset: 0x0814 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC6;    /* offset: 0x0818 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC7;    /* offset: 0x081C size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC8;    /* offset: 0x0820 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC9;    /* offset: 0x0824 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC10;   /* offset: 0x0828 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC11;   /* offset: 0x082C size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC12;   /* offset: 0x0830 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC13;   /* offset: 0x0834 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC14;   /* offset: 0x0838 size: 32 bit */
            MPU_RGDAAC_32B_tag RGDAAC15;   /* offset: 0x083C size: 32 bit */
         };

      };
   } MPU_tag;


#define MPU   (*(volatile MPU_tag *) 0xFFF10000UL)



/****************************************************************/
/*                                                              */
/* Module: SEMA4  */
/*                                                              */
/****************************************************************/


   /* Register layout for all registers GATE... */

   typedef union {   /* SEMA4_GATEn - Semephores Gate Register */
      uint8_t R;
      struct {
         uint8_t:6;
         uint8_t   GTFSM:2;           /* Gate Finite State machine */
      } B;
   } SEMA4_GATE_8B_tag;

   typedef union {   /* SEMA4_CP0INE - Semaphores Processor IRQ Notification Enable */
      uint16_t R;
      struct {
         uint16_t  INE:16;            /* Interrupt Request Notification Enable */
      } B;
   } SEMA4_CP0INE_16B_tag;

   typedef union {   /* SEMA4_CP1INE - Semaphores Processor IRQ Notification Enable */
      uint16_t R;
      struct {
         uint16_t  INE:16;            /* Interrupt Request Notification Enable */
      } B;
   } SEMA4_CP1INE_16B_tag;

   typedef union {   /* SEMA4_CP0NTF - Semaphores Processor IRQ Notification */
      uint16_t R;
      struct {
         uint16_t  GN:16;             /* Gate 0 Notification */
      } B;
   } SEMA4_CP0NTF_16B_tag;

   typedef union {   /* SEMA4_CP1NTF - Semaphores Processor IRQ Notification */
      uint16_t R;
      struct {
         uint16_t  GN:16;             /* Gate 1 Notification */
      } B;
   } SEMA4_CP1NTF_16B_tag;

   typedef union {   /* SEMA4_RSTGT -  Semaphores Reset Gate */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  RSTGSM:2;          /* Reset Gate Finite State Machine */
         uint16_t  RSTGDP:7;          /* Reset Gate Data Pattern */
         uint16_t  RSTGMS:3;          /* Reset Gate Bus Master */
         uint16_t  RSTGTN:8;          /* Reset Gate Number */
      } B;
   } SEMA4_RSTGT_16B_tag;

   typedef union {   /* SEMA4_RSTNTF - Semaphores Reset Reset IRQ Notification */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  RSTNSM:2;          /* Reset Gate Finite State Machine */
         uint16_t  RSTNDP:7;          /* Reset Gate Data Pattern */
         uint16_t  RSTNMS:3;          /* Reset Gate Bus Master */
         uint16_t  RSTNTN:8;          /* Reset Gate Number */
      } B;
   } SEMA4_RSTNTF_16B_tag;



   typedef struct SEMA4_struct_tag { /* start of SEMA4_tag */
      union {
                               /* SEMA4_GATEn - Semephores Gate Register */
         SEMA4_GATE_8B_tag GATE[16];       /* offset: 0x0000  (0x0001 x 16) */

         struct {
                               /* SEMA4_GATEn - Semephores Gate Register */
            SEMA4_GATE_8B_tag GATE0;       /* offset: 0x0000 size: 8 bit */
            SEMA4_GATE_8B_tag GATE1;       /* offset: 0x0001 size: 8 bit */
            SEMA4_GATE_8B_tag GATE2;       /* offset: 0x0002 size: 8 bit */
            SEMA4_GATE_8B_tag GATE3;       /* offset: 0x0003 size: 8 bit */
            SEMA4_GATE_8B_tag GATE4;       /* offset: 0x0004 size: 8 bit */
            SEMA4_GATE_8B_tag GATE5;       /* offset: 0x0005 size: 8 bit */
            SEMA4_GATE_8B_tag GATE6;       /* offset: 0x0006 size: 8 bit */
            SEMA4_GATE_8B_tag GATE7;       /* offset: 0x0007 size: 8 bit */
            SEMA4_GATE_8B_tag GATE8;       /* offset: 0x0008 size: 8 bit */
            SEMA4_GATE_8B_tag GATE9;       /* offset: 0x0009 size: 8 bit */
            SEMA4_GATE_8B_tag GATE10;      /* offset: 0x000A size: 8 bit */
            SEMA4_GATE_8B_tag GATE11;      /* offset: 0x000B size: 8 bit */
            SEMA4_GATE_8B_tag GATE12;      /* offset: 0x000C size: 8 bit */
            SEMA4_GATE_8B_tag GATE13;      /* offset: 0x000D size: 8 bit */
            SEMA4_GATE_8B_tag GATE14;      /* offset: 0x000E size: 8 bit */
            SEMA4_GATE_8B_tag GATE15;      /* offset: 0x000F size: 8 bit */
         };

      };
      int8_t SEMA4_reserved_0010[48];
          /* SEMA4_CP0INE - Semaphores Processor IRQ Notification Enable */
      SEMA4_CP0INE_16B_tag CP0INE;         /* offset: 0x0040 size: 16 bit */
      int8_t SEMA4_reserved_0042[6];
          /* SEMA4_CP1INE - Semaphores Processor IRQ Notification Enable */
      SEMA4_CP1INE_16B_tag CP1INE;         /* offset: 0x0048 size: 16 bit */
      int8_t SEMA4_reserved_004A[54];
                 /* SEMA4_CP0NTF - Semaphores Processor IRQ Notification */
      SEMA4_CP0NTF_16B_tag CP0NTF;         /* offset: 0x0080 size: 16 bit */
      int8_t SEMA4_reserved_0082[6];
                 /* SEMA4_CP1NTF - Semaphores Processor IRQ Notification */
      SEMA4_CP1NTF_16B_tag CP1NTF;         /* offset: 0x0088 size: 16 bit */
      int8_t SEMA4_reserved_008A[118];
                                 /* SEMA4_RSTGT -  Semaphores Reset Gate */
      SEMA4_RSTGT_16B_tag RSTGT;           /* offset: 0x0100 size: 16 bit */
      int8_t SEMA4_reserved_0102[2];
               /* SEMA4_RSTNTF - Semaphores Reset Reset IRQ Notification */
      SEMA4_RSTNTF_16B_tag RSTNTF;         /* offset: 0x0104 size: 16 bit */
   } SEMA4_tag;


