RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
#define SEMA4 (*(volatile SEMA4_tag *) 0xFFF24000UL)



/****************************************************************/
/*                                                              */
/* Module: SWT  */
/*                                                              */
/****************************************************************/

   typedef union {   /* SWT_CR - Control Register */
      uint32_t R;
      struct {
         uint32_t  MAP0:1;            /* Master Acces Protection for Master 0 */
         uint32_t  MAP1:1;            /* Master Acces Protection for Master 1 */
         uint32_t  MAP2:1;            /* Master Acces Protection for Master 2 */
         uint32_t  MAP3:1;            /* Master Acces Protection for Master 3 */
         uint32_t  MAP4:1;            /* Master Acces Protection for Master 4 */
         uint32_t  MAP5:1;            /* Master Acces Protection for Master 5 */
         uint32_t  MAP6:1;            /* Master Acces Protection for Master 6 */
         uint32_t  MAP7:1;            /* Master Acces Protection for Master 7 */
         uint32_t:14;
         uint32_t  KEY:1;             /* Keyed Service Mode */
         uint32_t  RIA:1;             /* Reset on Invalid Access */
         uint32_t  WND:1;             /* Window Mode */
         uint32_t  ITR:1;             /* Interrupt Then Reset */
         uint32_t  HLK:1;             /* Hard Lock */
         uint32_t  SLK:1;             /* Soft Lock */
         uint32_t:1;             
         uint32_t  STP:1;             /* Stop Mode Control */
         uint32_t  FRZ:1;             /* Debug Mode Control */
         uint32_t  WEN:1;             /* Watchdog Enabled */
      } B;
   } SWT_CR_32B_tag;

   typedef union {   /* SWT_IR - SWT Interrupt Register */
      uint32_t R;
      struct {
         uint32_t:31;
         uint32_t  TIF:1;             /* Time Out Interrupt Flag */
      } B;
   } SWT_IR_32B_tag;

   typedef union {   /* SWT_TO - SWT Time-Out Register */
      uint32_t R;
      struct {
         uint32_t  WTO:32;            /* Watchdog Time Out Period */
      } B;
   } SWT_TO_32B_tag;

   typedef union {   /* SWT_WN - SWT Window Register */
      uint32_t R;
      struct {
         uint32_t  WST:32;            /* Watchdog Time Out Period */
      } B;
   } SWT_WN_32B_tag;

   typedef union {   /* SWT_SR - SWT Service Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  WSC:16;            /* Watchdog Service Code */
      } B;
   } SWT_SR_32B_tag;

   typedef union {   /* SWT_CO - SWT Counter Output Register */
      uint32_t R;
      struct {
         uint32_t  CNT:32;            /* Watchdog Count */
      } B;
   } SWT_CO_32B_tag;

   typedef union {   /* SWT_SK - SWT Service Key Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  SERVICEKEY:16;     /* Service Key */
      } B;
   } SWT_SK_32B_tag;



   typedef struct SWT_struct_tag { /* start of SWT_tag */
                                            /* SWT_CR - Control Register */
      SWT_CR_32B_tag CR;                   /* offset: 0x0000 size: 32 bit */
                                      /* SWT_IR - SWT Interrupt Register */
      SWT_IR_32B_tag IR;                   /* offset: 0x0004 size: 32 bit */
                                       /* SWT_TO - SWT Time-Out Register */
      SWT_TO_32B_tag TO;                   /* offset: 0x0008 size: 32 bit */
                                         /* SWT_WN - SWT Window Register */
      SWT_WN_32B_tag WN;                   /* offset: 0x000C size: 32 bit */
                                        /* SWT_SR - SWT Service Register */
      SWT_SR_32B_tag SR;                   /* offset: 0x0010 size: 32 bit */
                                 /* SWT_CO - SWT Counter Output Register */
      SWT_CO_32B_tag CO;                   /* offset: 0x0014 size: 32 bit */
                                    /* SWT_SK - SWT Service Key Register */
      SWT_SK_32B_tag SK;                   /* offset: 0x0018 size: 32 bit */
   } SWT_tag;


#define SWT   (*(volatile SWT_tag *) 0xFFF38000UL)



/****************************************************************/
/*                                                              */
/* Module: STM  */
/*                                                              */
/****************************************************************/

   typedef union {   /* STM_CR - Control Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  CPS:8;             /* Counter Prescaler */
         uint32_t:6;
         uint32_t  FRZ:1;             /* Freeze Control */
         uint32_t  TEN:1;             /* Timer Counter Enabled */
      } B;
   } STM_CR_32B_tag;

   typedef union {   /* STM_CNT - STM Count Register */
      uint32_t R;
   } STM_CNT_32B_tag;


   /* Register layout for all registers CCR... */

   typedef union {   /* STM_CCRn - STM Channel Control Register */
      uint32_t R;
      struct {
         uint32_t:31;
         uint32_t  CEN:1;             /* Channel Enable */
      } B;
   } STM_CCR_32B_tag;


   /* Register layout for all registers CIR... */

   typedef union {   /* STM_CIRn - STM Channel Interrupt Register */
      uint32_t R;
      struct {
         uint32_t:31;
         uint32_t  CIF:1;             /* Channel Interrupt Flag */
      } B;
   } STM_CIR_32B_tag;


   /* Register layout for all registers CMP... */

   typedef union {   /* STM_CMPn - STM Channel Compare Register */
      uint32_t R;
   } STM_CMP_32B_tag;


   typedef struct STM_CHANNEL_struct_tag {

                              /* STM_CCRn - STM Channel Control Register */
      STM_CCR_32B_tag CCR;                /* relative offset: 0x0000 */
                            /* STM_CIRn - STM Channel Interrupt Register */
      STM_CIR_32B_tag CIR;                /* relative offset: 0x0004 */
                              /* STM_CMPn - STM Channel Compare Register */
      STM_CMP_32B_tag CMP;                /* relative offset: 0x0008 */
      int8_t STM_CHANNEL_reserved_000C[4];

