RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   } STM_CHANNEL_tag;


   typedef struct STM_struct_tag { /* start of STM_tag */
      union {
         STM_CR_32B_tag CR0;               /* deprecated - please avoid */

                                            /* STM_CR - Control Register */
         STM_CR_32B_tag CR;                /* offset: 0x0000 size: 32 bit */

      };
      union {
         STM_CNT_32B_tag CNT0;             /* deprecated - please avoid */

                                         /* STM_CNT - STM Count Register */
         STM_CNT_32B_tag CNT;              /* offset: 0x0004 size: 32 bit */

      };
      int8_t STM_reserved_0008_C[8];
      union {
                                                /*  Register set CHANNEL */
         STM_CHANNEL_tag CHANNEL[4];       /* offset: 0x0010  (0x0010 x 4) */

         struct {
                              /* STM_CCRn - STM Channel Control Register */
            STM_CCR_32B_tag CCR0;          /* offset: 0x0010 size: 32 bit */
                            /* STM_CIRn - STM Channel Interrupt Register */
            STM_CIR_32B_tag CIR0;          /* offset: 0x0014 size: 32 bit */
                              /* STM_CMPn - STM Channel Compare Register */
            STM_CMP_32B_tag CMP0;          /* offset: 0x0018 size: 32 bit */
            int8_t STM_reserved_001C_I1[4];
                              /* STM_CCRn - STM Channel Control Register */
            STM_CCR_32B_tag CCR1;          /* offset: 0x0020 size: 32 bit */
                            /* STM_CIRn - STM Channel Interrupt Register */
            STM_CIR_32B_tag CIR1;          /* offset: 0x0024 size: 32 bit */
                              /* STM_CMPn - STM Channel Compare Register */
            STM_CMP_32B_tag CMP1;          /* offset: 0x0028 size: 32 bit */
            int8_t STM_reserved_002C_I1[4];
                              /* STM_CCRn - STM Channel Control Register */
            STM_CCR_32B_tag CCR2;          /* offset: 0x0030 size: 32 bit */
                            /* STM_CIRn - STM Channel Interrupt Register */
            STM_CIR_32B_tag CIR2;          /* offset: 0x0034 size: 32 bit */
                              /* STM_CMPn - STM Channel Compare Register */
            STM_CMP_32B_tag CMP2;          /* offset: 0x0038 size: 32 bit */
            int8_t STM_reserved_003C_I1[4];
                              /* STM_CCRn - STM Channel Control Register */
            STM_CCR_32B_tag CCR3;          /* offset: 0x0040 size: 32 bit */
                            /* STM_CIRn - STM Channel Interrupt Register */
            STM_CIR_32B_tag CIR3;          /* offset: 0x0044 size: 32 bit */
                              /* STM_CMPn - STM Channel Compare Register */
            STM_CMP_32B_tag CMP3;          /* offset: 0x0048 size: 32 bit */
            int8_t STM_reserved_004C_E1[4];
         };

      };
   } STM_tag;


#define STM   (*(volatile STM_tag *) 0xFFF3C000UL)



/****************************************************************/
/*                                                              */
/* Module: SPP_MCM  */
/*                                                              */
/****************************************************************/

   typedef union {   /* SPP_MCM_PCT - Processor Core Type */
      uint16_t R;
      struct {
         uint16_t  PCTYPE:16;         /* Processor Core Type */
      } B;
   } SPP_MCM_PCT_16B_tag;

   typedef union {   /* SPP_MCM_PLREV - SOC-Defined Platform Revision */
      uint16_t R;
      struct {
         uint16_t  PLREVISION:16;     /* Platform Revision */
      } B;
   } SPP_MCM_PLREV_16B_tag;

   typedef union {   /* SPP_MCM_IOPMC - IPS On-Platform Module Configuration */
      uint32_t R;
      struct {
         uint32_t  PMC:32;            /* IPS Module Configuration */
      } B;
   } SPP_MCM_IOPMC_32B_tag;

   typedef union {   /* SPP_MCM_MRSR - Miscellaneous Reset Status Register */
      uint8_t R;
      struct {
         uint8_t   POR:1;             /* Power on Reset */
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   OFPLR:1;           /* Off-Platform Reset */
#else
         uint8_t   DIR:1;               /* deprecated name - please avoid */
#endif
         uint8_t:6;
      } B;
   } SPP_MCM_MRSR_8B_tag;

   typedef union {   /* SPP_MCM_MWCR - Miscellaneous Wakeup Control Register */
      uint8_t R;
      struct {
         uint8_t   ENBWCR:1;          /* Enable WCR */
         uint8_t:3;
         uint8_t   PRILVL:4;          /* Interrupt Priority Level */
      } B;
   } SPP_MCM_MWCR_8B_tag;

   typedef union {   /* SPP_MCM_MIR - Miscellaneous Interrupt Register */
      uint8_t R;
      struct {
         uint8_t   FB0AI:1;           /* Flash Bank 0 Abort Interrupt */
         uint8_t   FB0SI:1;           /* Flash Bank 0 Stall Interrupt */
         uint8_t   FB1AI:1;           /* Flash Bank 1 Abort Interrupt */
         uint8_t   FB1SI:1;           /* Flash Bank 1 Stall Interrupt */
         uint8_t   FB2AI:1;           /* Flash Bank 2 Abort Interrupt */
         uint8_t   FB2SI:1;           /* Flash Bank 2 Stall Interrupt */
         uint8_t:2;
      } B;
   } SPP_MCM_MIR_8B_tag;

   typedef union {   /* SPP_MCM_MUDCR - Miscellaneous User Defined Control Register */
      uint32_t R;
      struct {
         uint32_t  MUSERDCR:32;       /* User Defined Control Register */
      } B;
   } SPP_MCM_MUDCR_32B_tag;

   typedef union {   /* SPP_MCM_ECR - ECC Configuration Register */
      uint8_t R;
      struct {
         uint8_t:2;
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   EPR1BR:1;          /* Enable Platform RAM 1-bit Reporting */
#else
         uint8_t   ER1BR:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   EPF1BR:1;          /* Enable Platform FLASH 1-bit Reporting */
#else
         uint8_t   EF1BR:1;             /* deprecated name - please avoid */
#endif
         uint8_t:2;
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   EPRNCR:1;          /* Enable Platform RAM Non-Correctable Reporting */
#else
         uint8_t   ERNCR:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   EPFNCR:1;          /* Enable Platform FLASH Non-Correctable Reporting */
#else
         uint8_t   EFNCR:1;             /* deprecated name - please avoid */
#endif
      } B;
   } SPP_MCM_ECR_8B_tag;

   typedef union {   /* SPP_MCM_ESR - ECC Status Register */
      uint8_t R;
      struct {
         uint8_t:2;
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   PR1BC:1;           /* Platform RAM 1-bit Correction */
#else
         uint8_t   R1BC:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   PF1BC:1;           /* Platform FLASH 1-bit Correction */
#else
         uint8_t   F1BC:1;              /* deprecated name - please avoid */
#endif
         uint8_t:2;
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   PRNCE:1;           /* Platform RAM Non-Correctable Error */
#else
         uint8_t   RNCE:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   PFNCE:1;           /* Platform FLASH Non-Correctable Error */
#else
         uint8_t   FNCE:1;              /* deprecated name - please avoid */
#endif
      } B;
   } SPP_MCM_ESR_8B_tag;

   typedef union {   /* SPP_MCM_EEGR - ECC Error Generation Register */
      uint16_t R;
      struct {
         uint16_t  FRCAP:1;           /* Force Platform RAM Error Injection Access Protection */
         uint16_t:1;
         uint16_t  FRC1BI:1;          /* Force Platform RAM Continuous 1-Bit Data Inversions */
         uint16_t  FR11BI:1;          /* Force Platform RAM One 1-Bit Data Inversion */
         uint16_t:2;
         uint16_t  FRCNCI:1;          /* Force Platform RAM Continuous Noncorrectable Data Inversions */
         uint16_t  FR1NCI:1;          /* Force Platform RAM One Noncorrectable Data Inversions */
         uint16_t:1;
         uint16_t  ERRBIT:7;          /* Error Bit Position */
      } B;
   } SPP_MCM_EEGR_16B_tag;

   typedef union {   /* SPP_MCM_PFEAR - Platform Flash ECC Error Address Register */
      uint32_t R;
   } SPP_MCM_PFEAR_32B_tag;

   typedef union {   /* SPP_MCM_PFEMR - Platform Flash ECC Master Number Register */
      uint8_t R;
   } SPP_MCM_PFEMR_8B_tag;

