RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* SPP_MCM_PFEAT - Platform Flash ECC Attributes Register */
      uint8_t R;
      struct {
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   F_WRITE:1;         /* AMBA-AHBH Write */
#else
         uint8_t   WRITE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   F_SIZE:3;          /* AMBA-AHBH Size */
#else
         uint8_t   SIZE:3;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   F_PROTECT:4;       /* AMBA-AHBH PROT */
#else
         uint8_t   PROTECTION:4;        /* deprecated name - please avoid */
#endif
      } B;
   } SPP_MCM_PFEAT_8B_tag;

   typedef union {   /* SPP_MCM_PFEDRH - Platform Flash ECC Data Register High Word */
      uint32_t R;
   } SPP_MCM_PFEDRH_32B_tag;

   typedef union {   /* SPP_MCM_PFEDR - Platform Flash ECC Data Register */
      uint32_t R;
   } SPP_MCM_PFEDR_32B_tag;

   typedef union {   /* SPP_MCM_PREAR - Platform RAM ECC Address Register */
      uint32_t R;
   } SPP_MCM_PREAR_32B_tag;

   typedef union {   /* SPP_MCM_PRESR - Platform RAM ECC Syndrome Register */
      uint8_t R;
   } SPP_MCM_PRESR_8B_tag;

   typedef union {   /* SPP_MCM_PREMR - Platform RAM ECC Master Number Register */
      uint8_t R;
      struct {
         uint8_t:4;
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   PR_EMR:4;          /* Platform RAM ECC Master Number */
#else
         uint8_t   REMR:4;              /* deprecated name - please avoid */
#endif
      } B;
   } SPP_MCM_PREMR_8B_tag;

   typedef union {   /* SPP_MCM_PREAT - Platform RAM ECC Attributes Register */
      uint8_t R;
      struct {
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   R_WRITE:1;         /* AMBA-AHBH Write */
#else
         uint8_t   WRITE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   R_SIZE:3;          /* AMBA-AHBH Size */
#else
         uint8_t   SIZE:3;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_SPP_MCM
         uint8_t   R_PROTECT:4;       /* AMBA-AHBH PROT */
#else
         uint8_t   PROTECTION:4;        /* deprecated name - please avoid */
#endif
      } B;
   } SPP_MCM_PREAT_8B_tag;

   typedef union {   /* SPP_MCM_PREDR - Platform RAM ECC Data Register High Word */
      uint32_t R;
   } SPP_MCM_PREDRH_32B_tag;

   typedef union {   /* SPP_MCM_PREDR - Platform RAM ECC Data Register */
      uint32_t R;
   } SPP_MCM_PREDR_32B_tag;



   typedef struct SPP_MCM_struct_tag { /* start of SPP_MCM_tag */
                                    /* SPP_MCM_PCT - Processor Core Type */
      SPP_MCM_PCT_16B_tag PCT;             /* offset: 0x0000 size: 16 bit */
      union {
         SPP_MCM_PLREV_16B_tag REV;        /* deprecated - please avoid */

                        /* SPP_MCM_PLREV - SOC-Defined Platform Revision */
         SPP_MCM_PLREV_16B_tag PLREV;      /* offset: 0x0002 size: 16 bit */

      };
      int8_t SPP_MCM_reserved_0004_C[4];
      union {
         SPP_MCM_IOPMC_32B_tag MC;         /* deprecated - please avoid */

                 /* SPP_MCM_IOPMC - IPS On-Platform Module Configuration */
         SPP_MCM_IOPMC_32B_tag IOPMC;      /* offset: 0x0008 size: 32 bit */

      };
      int8_t SPP_MCM_reserved_000C[3];
                   /* SPP_MCM_MRSR - Miscellaneous Reset Status Register */
      SPP_MCM_MRSR_8B_tag MRSR;            /* offset: 0x000F size: 8 bit */
      int8_t SPP_MCM_reserved_0010[3];
                 /* SPP_MCM_MWCR - Miscellaneous Wakeup Control Register */
      SPP_MCM_MWCR_8B_tag MWCR;            /* offset: 0x0013 size: 8 bit */
      int8_t SPP_MCM_reserved_0014[11];
                       /* SPP_MCM_MIR - Miscellaneous Interrupt Register */
      SPP_MCM_MIR_8B_tag MIR;              /* offset: 0x001F size: 8 bit */
      int8_t SPP_MCM_reserved_0020[4];
          /* SPP_MCM_MUDCR - Miscellaneous User Defined Control Register */
      SPP_MCM_MUDCR_32B_tag MUDCR;         /* offset: 0x0024 size: 32 bit */
      int8_t SPP_MCM_reserved_0028[27];
                             /* SPP_MCM_ECR - ECC Configuration Register */
      SPP_MCM_ECR_8B_tag ECR;              /* offset: 0x0043 size: 8 bit */
      int8_t SPP_MCM_reserved_0044[3];
                                    /* SPP_MCM_ESR - ECC Status Register */
      SPP_MCM_ESR_8B_tag ESR;              /* offset: 0x0047 size: 8 bit */
      int8_t SPP_MCM_reserved_0048[2];
                         /* SPP_MCM_EEGR - ECC Error Generation Register */
      SPP_MCM_EEGR_16B_tag EEGR;           /* offset: 0x004A size: 16 bit */
      int8_t SPP_MCM_reserved_004C_C[4];
      union {
            /* SPP_MCM_PFEAR - Platform Flash ECC Error Address Register */
         SPP_MCM_PFEAR_32B_tag PFEAR;      /* offset: 0x0050 size: 32 bit */

         SPP_MCM_PFEAR_32B_tag FEAR;       /* deprecated - please avoid */

      };
      int8_t SPP_MCM_reserved_0054_C[2];
      union {
            /* SPP_MCM_PFEMR - Platform Flash ECC Master Number Register */
         SPP_MCM_PFEMR_8B_tag PFEMR;       /* offset: 0x0056 size: 8 bit */

         SPP_MCM_PFEMR_8B_tag FEMR;        /* deprecated - please avoid */

      };
      union {
               /* SPP_MCM_PFEAT - Platform Flash ECC Attributes Register */
         SPP_MCM_PFEAT_8B_tag PFEAT;       /* offset: 0x0057 size: 8 bit */

         SPP_MCM_PFEAT_8B_tag FEAT;        /* deprecated - please avoid */

      };
          /* SPP_MCM_PFEDRH - Platform Flash ECC Data Register High Word */
      SPP_MCM_PFEDRH_32B_tag PFEDRH;       /* offset: 0x0058 size: 32 bit */
      union {
                     /* SPP_MCM_PFEDR - Platform Flash ECC Data Register */
         SPP_MCM_PFEDR_32B_tag PFEDR;      /* offset: 0x005C size: 32 bit */

         SPP_MCM_PFEDR_32B_tag FEDR;       /* deprecated - please avoid */

      };
      union {
         SPP_MCM_PREAR_32B_tag REAR;       /* deprecated - please avoid */

                    /* SPP_MCM_PREAR - Platform RAM ECC Address Register */
         SPP_MCM_PREAR_32B_tag PREAR;      /* offset: 0x0060 size: 32 bit */

