RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      int8_t SPP_MCM_reserved_0064_C;
      union {
         SPP_MCM_PRESR_8B_tag RESR;        /* deprecated - please avoid */

                   /* SPP_MCM_PRESR - Platform RAM ECC Syndrome Register */
         SPP_MCM_PRESR_8B_tag PRESR;       /* offset: 0x0065 size: 8 bit */

      };
      union {
         SPP_MCM_PREMR_8B_tag REMR;        /* deprecated - please avoid */

              /* SPP_MCM_PREMR - Platform RAM ECC Master Number Register */
         SPP_MCM_PREMR_8B_tag PREMR;       /* offset: 0x0066 size: 8 bit */

      };
      union {
         SPP_MCM_PREAT_8B_tag REAT;        /* deprecated - please avoid */

                 /* SPP_MCM_PREAT - Platform RAM ECC Attributes Register */
         SPP_MCM_PREAT_8B_tag PREAT;       /* offset: 0x0067 size: 8 bit */

      };
             /* SPP_MCM_PREDR - Platform RAM ECC Data Register High Word */
      SPP_MCM_PREDRH_32B_tag PREDRH;       /* offset: 0x0068 size: 32 bit */
      union {
         SPP_MCM_PREDR_32B_tag REDR;       /* deprecated - please avoid */

                       /* SPP_MCM_PREDR - Platform RAM ECC Data Register */
         SPP_MCM_PREDR_32B_tag PREDR;      /* offset: 0x006C size: 32 bit */

      };
   } SPP_MCM_tag;


#define SPP_MCM (*(volatile SPP_MCM_tag *) 0xFFF40000UL)



/****************************************************************/
/*                                                              */
/* Module: SPP_DMA2  */
/*                                                              */
/****************************************************************/

   typedef union {   /* SPP_DMA2_DMACR - DMA Control Register */
      uint32_t R;
      struct {
         uint32_t:14;
         uint32_t  CX:1;              /* Cancel Transfer */
         uint32_t  ECX:1;             /* Error Cancel Transfer */
         uint32_t  GRP3PRI:2;         /* Channel Group 3 Priority */
         uint32_t  GRP2PRI:2;         /* Channel Group 2 Priority */
         uint32_t  GRP1PRI:2;         /* Channel Group 1 Priority */
         uint32_t  GRP0PRI:2;         /* Channel Group 0 Priority */
         uint32_t  EMLM:1;            /* Enable Minor Loop Mapping */
         uint32_t  CLM:1;             /* Continuous Link Mode */
         uint32_t  HALT:1;            /* Halt DMA Operations */
         uint32_t  HOE:1;             /* Halt on Error */
         uint32_t  ERGA:1;            /* Enable Round Robin Group Arbitration */
         uint32_t  ERCA:1;            /* Enable Round Robin Channel Arbitration */
         uint32_t  EDBG:1;            /* Enable Debug */
         uint32_t  EBW:1;             /* Enable Buffered Writes */
      } B;
   } SPP_DMA2_DMACR_32B_tag;

   typedef union {   /* SPP_DMA2_DMAES - DMA Error Status Register */
      uint32_t R;
      struct {
         uint32_t  VLD:1;             /* Logical OR of DMAERRH and DMAERRL status bits */
         uint32_t:14;
         uint32_t  ECX:1;             /* Transfer Cancelled */
         uint32_t  GPE:1;             /* Group Priority Error */
         uint32_t  CPE:1;             /* Channel Priority Error */
         uint32_t  ERRCHN:6;          /* Error Channel Number or Cancelled Channel Number */
         uint32_t  SAE:1;             /* Source Address Error */
         uint32_t  SOE:1;             /* Source Offset Error */
         uint32_t  DAE:1;             /* Destination Address Error */
         uint32_t  DOE:1;             /* Destination Offset Error */
         uint32_t  NCE:1;             /* Nbytes/Citer Configuration Error */
         uint32_t  SGE:1;             /* Scatter/Gather Configuration Error */
         uint32_t  SBE:1;             /* Source Bus Error */
         uint32_t  DBE:1;             /* Destination Bus Error */
      } B;
   } SPP_DMA2_DMAES_32B_tag;

   typedef union {   /* SPP_DMA2_DMAERQH - DMA Enable Request Register */
      uint32_t R;
      struct {
         uint32_t  ERQ:32;            /* DMA Enable Request */
      } B;
   } SPP_DMA2_DMAERQH_32B_tag;

   typedef union {   /* SPP_DMA2_DMAERQL - DMA Enable Request Register */
      uint32_t R;
      struct {
         uint32_t  ERQ:32;            /* DMA Enable Request */
      } B;
   } SPP_DMA2_DMAERQL_32B_tag;

   typedef union {   /* SPP_DMA2_DMAEEIH - DMA Enable Error Interrupt Register */
      uint32_t R;
      struct {
         uint32_t  EEI:32;            /* DMA Enable Error Interrupt */
      } B;
   } SPP_DMA2_DMAEEIH_32B_tag;

   typedef union {   /* SPP_DMA2_DMAEEIL - DMA Enable Error Interrupt Register */
      uint32_t R;
      struct {
         uint32_t  EEI:32;            /* DMA Enable Error Interrupt */
      } B;
   } SPP_DMA2_DMAEEIL_32B_tag;

   typedef union {   /* SPP_DMA2_DMASERQ - DMA Set Enable Request Register */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   SERQ:7;            /* Set Enable Request */
      } B;
   } SPP_DMA2_DMASERQ_8B_tag;

   typedef union {   /* SPP_DMA2_DMACERQ - DMA Clear Enable Request Register */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   CERQ:7;            /* Clear Enable Request */
      } B;
   } SPP_DMA2_DMACERQ_8B_tag;

   typedef union {   /* SPP_DMA2_DMASEEI - DMA Set Enable Error Interrupt Register */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   SEEI:7;            /* Set Enable Error Interrupt */
      } B;
   } SPP_DMA2_DMASEEI_8B_tag;

   typedef union {   /* SPP_DMA2_DMACEEI - DMA Clear Enable Error Interrupt Register */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   CEEI:7;            /* Clear Enable Error Interrupt */
      } B;
   } SPP_DMA2_DMACEEI_8B_tag;

   typedef union {   /* SPP_DMA2_DMACINT - DMA Clear Interrupt Request */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   CINT:7;            /* Clear Interrupt Request */
      } B;
   } SPP_DMA2_DMACINT_8B_tag;

   typedef union {   /* SPP_DMA2_DMACERR - DMA Clear Error */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   CERR:7;            /* Clear Error Indicator */
      } B;
   } SPP_DMA2_DMACERR_8B_tag;

   typedef union {   /* SPP_DMA2_DMASSRT - DMA Set START Bit */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   SSRT:7;            /* Set START Bit */
      } B;
   } SPP_DMA2_DMASSRT_8B_tag;

   typedef union {   /* SPP_DMA2_DMACDNE - DMA Clear DONE Status */
      uint8_t R;
      struct {
         uint8_t:1;
         uint8_t   CDNE:7;            /* Clear DONE Status Bit */
      } B;
   } SPP_DMA2_DMACDNE_8B_tag;

   typedef union {   /* SPP_DMA2_DMAINTH - DMA Interrupt Request Register */
      uint32_t R;
      struct {
         uint32_t  INT:32;            /* DMA Interrupt Request */
      } B;
   } SPP_DMA2_DMAINTH_32B_tag;

   typedef union {   /* SPP_DMA2_DMAINTL - DMA Interrupt Request Register */
      uint32_t R;
      struct {
         uint32_t  INT:32;            /* DMA Interrupt Request */
      } B;
   } SPP_DMA2_DMAINTL_32B_tag;

