RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* SPP_DMA2_DMAERRH - DMA Error Register */
      uint32_t R;
      struct {
         uint32_t  ERR:32;            /* DMA Error n */
      } B;
   } SPP_DMA2_DMAERRH_32B_tag;

   typedef union {   /* SPP_DMA2_DMAERRL - DMA Error Register */
      uint32_t R;
      struct {
         uint32_t  ERR:32;            /* DMA Error n */
      } B;
   } SPP_DMA2_DMAERRL_32B_tag;

   typedef union {   /* SPP_DMA2_DMAHRSH - DMA Hardware Request Status Register */
      uint32_t R;
      struct {
         uint32_t  HRS:32;            /* DMA Hardware Request Status */
      } B;
   } SPP_DMA2_DMAHRSH_32B_tag;

   typedef union {   /* SPP_DMA2_DMAHRSL - DMA Hardware Request Status Register */
      uint32_t R;
      struct {
         uint32_t  HRS:32;            /* DMA Hardware Request Status */
      } B;
   } SPP_DMA2_DMAHRSL_32B_tag;

   typedef union {   /* SPP_DMA2_DMAGPOR - DMA General Purpose Output Register */
      uint32_t R;
      struct {
         uint32_t  GPOR:32;           /* DMA General Purpose Output */
      } B;
   } SPP_DMA2_DMAGPOR_32B_tag;


   /* Register layout for all registers DCHPRI... */

   typedef union {   /* SPP_DMA2_DCHPRIn - DMA Channel n Priority */
      uint8_t R;
      struct {
         uint8_t   ECP:1;             /* Enable Channel Preemption */
         uint8_t   DPA:1;             /* Disable Preempt Ability */
         uint8_t   GRPPRI:2;          /* Channel n Current Group Priority */
         uint8_t   CHPRI:4;           /* Channel n Arbitration Priority */
      } B;
   } SPP_DMA2_DCHPRI_8B_tag;


   /* Register layout for all registers TCDWORD0_... */

   typedef union {   /* SPP_DMA2_TCDn Word0 - Source Address */
      uint32_t R;
      struct {
         uint32_t  SADDR:32;          /* Source Address */
      } B;
   } SPP_DMA2_TCDWORD0__32B_tag;


   /* Register layout for all registers TCDWORD4_... */

   typedef union {   /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
      uint32_t R;
      struct {
         uint32_t  SMOD:5;            /* Source Address Modulo */
         uint32_t  SSIZE:3;           /* Source Data Transfer Size */
         uint32_t  DMOD:5;            /* Destination Address Module */
         uint32_t  DSIZE:3;           /* Destination Data Transfer Size */
         uint32_t  SOFF:16;           /* Source Address Signed Offset */
      } B;
   } SPP_DMA2_TCDWORD4__32B_tag;


   /* Register layout for all registers TCDWORD8_... */

   typedef union {   /* SPP_DMA2_TCDn Word2 - nbytes */
      uint32_t R;
      struct {
         uint32_t  SMLOE:1;           /* Source Minor Loop Offset Enable */
         uint32_t  DMLOE:1;           /* Destination Minor Loop Offset Enable */
         uint32_t  MLOFF:20;          /* Minor Loop Offset */
         uint32_t  NBYTES:10;         /* Inner Minor byte transfer Count */
      } B;
   } SPP_DMA2_TCDWORD8__32B_tag;


   /* Register layout for all registers TCDWORD12_... */

   typedef union {   /* SPP_DMA2_TCDn Word3 - slast */
      uint32_t R;
      struct {
         uint32_t  SLAST:32;          /* Last Source Address Adjustment */
      } B;
   } SPP_DMA2_TCDWORD12__32B_tag;


   /* Register layout for all registers TCDWORD16_... */

   typedef union {   /* SPP_DMA2_TCDn Word4 - daddr */
      uint32_t R;
      struct {
         uint32_t  DADDR:32;          /* Destination Address */
      } B;
   } SPP_DMA2_TCDWORD16__32B_tag;


   /* Register layout for all registers TCDWORD20_... */

   typedef union {   /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
      uint32_t R;
      struct {
         uint32_t  CITER_E_LINK:1;    /* Enable Channel to channel linking on minor loop complete */
         uint32_t  CITER_LINKCH:6;    /* Link Channel Number */
         uint32_t  CITER:9;           /* Current Major Iteration Count */
         uint32_t  DOFF:16;           /* Destination Address Signed Offset */
      } B;
   } SPP_DMA2_TCDWORD20__32B_tag;


   /* Register layout for all registers TCDWORD24_... */

   typedef union {   /* SPP_DMA2_TCDn Word6 -  dlast_sga */
      uint32_t R;
      struct {
         uint32_t  DLAST_SGA:32;      /* Last destination address adjustment */
      } B;
   } SPP_DMA2_TCDWORD24__32B_tag;


   /* Register layout for all registers TCDWORD28_... */

   typedef union {   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
      uint32_t R;
      struct {

#ifndef USE_FIELD_ALIASES_SPP_DMA2
         uint32_t BITER_E_LINK:1;        /* beginning ("major") iteration count */
#else
         uint32_t BITERE_LINK:1;        /* deprecated name - please avoid */
#endif         
         uint32_t  BITER:15;          /* Enable Channel to Channel linking on minor loop complete */
         uint32_t  BWC:2;             /* Bandwidth Control */
         uint32_t  MAJOR_LINKCH:6;    /* Link Channel Number */
         uint32_t  DONE:1;            /* channel done */
         uint32_t  ACTIVE:1;          /* Channel Active */
         uint32_t  MAJOR_E_LINK:1;    /* Enable Channel to Channel Linking on major loop complete */
         uint32_t  E_SG:1;            /* Enable Scatter/Gather Processing */
         uint32_t  D_REQ:1;           /* Disable Request */
         uint32_t  INT_HALF:1;        /* Enable an Interrupt when Major Counter is half complete */
         uint32_t  INT_MAJ:1;         /* Enable an Interrupt when Major Iteration count completes */
         uint32_t  START:1;           /* Channel Start */
      } B;
   } SPP_DMA2_TCDWORD28__32B_tag;


   typedef struct SPP_DMA2_CHANNEL_struct_tag {

                                 /* SPP_DMA2_TCDn Word0 - Source Address */
      SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_;  /* relative offset: 0x0000 */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
      SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_;  /* relative offset: 0x0004 */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
      SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_;  /* relative offset: 0x0008 */
                                          /* SPP_DMA2_TCDn Word3 - slast */
      SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_;  /* relative offset: 0x000C */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
      SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_;  /* relative offset: 0x0010 */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
      SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_;  /* relative offset: 0x0014 */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
      SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_;  /* relative offset: 0x0018 */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
      SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_;  /* relative offset: 0x001C */

