RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_18;  /* offset: 0x1244 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_18;  /* offset: 0x1248 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_18;  /* offset: 0x124C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_18;  /* offset: 0x1250 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_18;  /* offset: 0x1254 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_18;  /* offset: 0x1258 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_18;  /* offset: 0x125C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_19;  /* offset: 0x1260 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_19;  /* offset: 0x1264 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_19;  /* offset: 0x1268 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_19;  /* offset: 0x126C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_19;  /* offset: 0x1270 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_19;  /* offset: 0x1274 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_19;  /* offset: 0x1278 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_19;  /* offset: 0x127C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_20;  /* offset: 0x1280 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_20;  /* offset: 0x1284 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_20;  /* offset: 0x1288 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_20;  /* offset: 0x128C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_20;  /* offset: 0x1290 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_20;  /* offset: 0x1294 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_20;  /* offset: 0x1298 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_20;  /* offset: 0x129C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_21;  /* offset: 0x12A0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_21;  /* offset: 0x12A4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_21;  /* offset: 0x12A8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_21;  /* offset: 0x12AC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_21;  /* offset: 0x12B0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_21;  /* offset: 0x12B4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_21;  /* offset: 0x12B8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_21;  /* offset: 0x12BC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_22;  /* offset: 0x12C0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_22;  /* offset: 0x12C4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_22;  /* offset: 0x12C8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_22;  /* offset: 0x12CC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_22;  /* offset: 0x12D0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_22;  /* offset: 0x12D4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_22;  /* offset: 0x12D8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_22;  /* offset: 0x12DC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_23;  /* offset: 0x12E0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_23;  /* offset: 0x12E4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_23;  /* offset: 0x12E8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_23;  /* offset: 0x12EC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_23;  /* offset: 0x12F0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_23;  /* offset: 0x12F4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_23;  /* offset: 0x12F8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_23;  /* offset: 0x12FC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_24;  /* offset: 0x1300 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_24;  /* offset: 0x1304 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_24;  /* offset: 0x1308 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_24;  /* offset: 0x130C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_24;  /* offset: 0x1310 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_24;  /* offset: 0x1314 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_24;  /* offset: 0x1318 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_24;  /* offset: 0x131C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_25;  /* offset: 0x1320 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_25;  /* offset: 0x1324 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_25;  /* offset: 0x1328 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_25;  /* offset: 0x132C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_25;  /* offset: 0x1330 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_25;  /* offset: 0x1334 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_25;  /* offset: 0x1338 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_25;  /* offset: 0x133C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_26;  /* offset: 0x1340 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_26;  /* offset: 0x1344 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_26;  /* offset: 0x1348 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_26;  /* offset: 0x134C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_26;  /* offset: 0x1350 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_26;  /* offset: 0x1354 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_26;  /* offset: 0x1358 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_26;  /* offset: 0x135C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_27;  /* offset: 0x1360 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_27;  /* offset: 0x1364 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_27;  /* offset: 0x1368 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_27;  /* offset: 0x136C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_27;  /* offset: 0x1370 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_27;  /* offset: 0x1374 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_27;  /* offset: 0x1378 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_27;  /* offset: 0x137C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_28;  /* offset: 0x1380 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_28;  /* offset: 0x1384 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_28;  /* offset: 0x1388 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_28;  /* offset: 0x138C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_28;  /* offset: 0x1390 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_28;  /* offset: 0x1394 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_28;  /* offset: 0x1398 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_28;  /* offset: 0x139C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_29;  /* offset: 0x13A0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_29;  /* offset: 0x13A4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_29;  /* offset: 0x13A8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_29;  /* offset: 0x13AC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_29;  /* offset: 0x13B0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_29;  /* offset: 0x13B4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_29;  /* offset: 0x13B8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_29;  /* offset: 0x13BC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_30;  /* offset: 0x13C0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_30;  /* offset: 0x13C4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_30;  /* offset: 0x13C8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_30;  /* offset: 0x13CC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_30;  /* offset: 0x13D0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_30;  /* offset: 0x13D4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_30;  /* offset: 0x13D8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_30;  /* offset: 0x13DC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_31;  /* offset: 0x13E0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_31;  /* offset: 0x13E4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_31;  /* offset: 0x13E8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_31;  /* offset: 0x13EC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_31;  /* offset: 0x13F0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_31;  /* offset: 0x13F4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_31;  /* offset: 0x13F8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_31;  /* offset: 0x13FC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_32;  /* offset: 0x1400 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_32;  /* offset: 0x1404 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_32;  /* offset: 0x1408 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_32;  /* offset: 0x140C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_32;  /* offset: 0x1410 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_32;  /* offset: 0x1414 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_32;  /* offset: 0x1418 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_32;  /* offset: 0x141C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_33;  /* offset: 0x1420 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_33;  /* offset: 0x1424 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_33;  /* offset: 0x1428 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_33;  /* offset: 0x142C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_33;  /* offset: 0x1430 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_33;  /* offset: 0x1434 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_33;  /* offset: 0x1438 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_33;  /* offset: 0x143C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_34;  /* offset: 0x1440 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_34;  /* offset: 0x1444 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_34;  /* offset: 0x1448 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_34;  /* offset: 0x144C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_34;  /* offset: 0x1450 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_34;  /* offset: 0x1454 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_34;  /* offset: 0x1458 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_34;  /* offset: 0x145C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_35;  /* offset: 0x1460 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_35;  /* offset: 0x1464 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_35;  /* offset: 0x1468 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_35;  /* offset: 0x146C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_35;  /* offset: 0x1470 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_35;  /* offset: 0x1474 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_35;  /* offset: 0x1478 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_35;  /* offset: 0x147C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_36;  /* offset: 0x1480 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_36;  /* offset: 0x1484 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_36;  /* offset: 0x1488 size: 32 bit */
