RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_54;  /* offset: 0x16D4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_54;  /* offset: 0x16D8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_54;  /* offset: 0x16DC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_55;  /* offset: 0x16E0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_55;  /* offset: 0x16E4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_55;  /* offset: 0x16E8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_55;  /* offset: 0x16EC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_55;  /* offset: 0x16F0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_55;  /* offset: 0x16F4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_55;  /* offset: 0x16F8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_55;  /* offset: 0x16FC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_56;  /* offset: 0x1700 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_56;  /* offset: 0x1704 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_56;  /* offset: 0x1708 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_56;  /* offset: 0x170C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_56;  /* offset: 0x1710 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_56;  /* offset: 0x1714 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_56;  /* offset: 0x1718 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_56;  /* offset: 0x171C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_57;  /* offset: 0x1720 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_57;  /* offset: 0x1724 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_57;  /* offset: 0x1728 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_57;  /* offset: 0x172C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_57;  /* offset: 0x1730 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_57;  /* offset: 0x1734 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_57;  /* offset: 0x1738 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_57;  /* offset: 0x173C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_58;  /* offset: 0x1740 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_58;  /* offset: 0x1744 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_58;  /* offset: 0x1748 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_58;  /* offset: 0x174C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_58;  /* offset: 0x1750 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_58;  /* offset: 0x1754 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_58;  /* offset: 0x1758 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_58;  /* offset: 0x175C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_59;  /* offset: 0x1760 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_59;  /* offset: 0x1764 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_59;  /* offset: 0x1768 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_59;  /* offset: 0x176C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_59;  /* offset: 0x1770 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_59;  /* offset: 0x1774 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_59;  /* offset: 0x1778 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_59;  /* offset: 0x177C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_60;  /* offset: 0x1780 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_60;  /* offset: 0x1784 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_60;  /* offset: 0x1788 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_60;  /* offset: 0x178C size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_60;  /* offset: 0x1790 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_60;  /* offset: 0x1794 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_60;  /* offset: 0x1798 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_60;  /* offset: 0x179C size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_61;  /* offset: 0x17A0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_61;  /* offset: 0x17A4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_61;  /* offset: 0x17A8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_61;  /* offset: 0x17AC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_61;  /* offset: 0x17B0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_61;  /* offset: 0x17B4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_61;  /* offset: 0x17B8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_61;  /* offset: 0x17BC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_62;  /* offset: 0x17C0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_62;  /* offset: 0x17C4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_62;  /* offset: 0x17C8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_62;  /* offset: 0x17CC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_62;  /* offset: 0x17D0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_62;  /* offset: 0x17D4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_62;  /* offset: 0x17D8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_62;  /* offset: 0x17DC size: 32 bit */
                                 /* SPP_DMA2_TCDn Word0 - Source Address */
            SPP_DMA2_TCDWORD0__32B_tag TCDWORD0_63;  /* offset: 0x17E0 size: 32 bit */
                 /* SPP_DMA2_TCDn Word1 - smod, ssize, dmod, dsize, soff */
            SPP_DMA2_TCDWORD4__32B_tag TCDWORD4_63;  /* offset: 0x17E4 size: 32 bit */
                                         /* SPP_DMA2_TCDn Word2 - nbytes */
            SPP_DMA2_TCDWORD8__32B_tag TCDWORD8_63;  /* offset: 0x17E8 size: 32 bit */
                                          /* SPP_DMA2_TCDn Word3 - slast */
            SPP_DMA2_TCDWORD12__32B_tag TCDWORD12_63;  /* offset: 0x17EC size: 32 bit */
                                          /* SPP_DMA2_TCDn Word4 - daddr */
            SPP_DMA2_TCDWORD16__32B_tag TCDWORD16_63;  /* offset: 0x17F0 size: 32 bit */
                     /* SPP_DMA2_TCDn Word5 -  citer.e_link, citer, doff */
            SPP_DMA2_TCDWORD20__32B_tag TCDWORD20_63;  /* offset: 0x17F4 size: 32 bit */
                                     /* SPP_DMA2_TCDn Word6 -  dlast_sga */
            SPP_DMA2_TCDWORD24__32B_tag TCDWORD24_63;  /* offset: 0x17F8 size: 32 bit */
                                   /* SPP_DMA2_TCDn Word7 -  biter, etc. */
            SPP_DMA2_TCDWORD28__32B_tag TCDWORD28_63;  /* offset: 0x17FC size: 32 bit */
         };

