RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
   } SPP_DMA2_tag;


#define SPP_DMA2 (*(volatile SPP_DMA2_tag *) 0xFFF44000UL)



/****************************************************************/
/*                                                              */
/* Module: INTC  */
/*                                                              */
/****************************************************************/

   typedef union {   /* BCR - Block Configuration Register */
      uint32_t R;
      struct {
         uint32_t:18;
         uint32_t  VTES_PRC1:1;       /* Vector Table Entry Size - Processor 1 */
         uint32_t:4;
         uint32_t  HVEN_PRC1:1;       /* Hardware Vector Enable - Processor 1 */
         uint32_t:2;
#ifndef USE_FIELD_ALIASES_INTC
         uint32_t  VTES_PRC0:1;       /* Vector Table Entry Size - Processor 0 */
#else
         uint32_t  VTES:1;              /* deprecated name - please avoid */
#endif
         uint32_t:4;
#ifndef USE_FIELD_ALIASES_INTC
         uint32_t  HVEN_PRC0:1;       /* Hardware Vector Enable - Processor 0 */
#else
         uint32_t  HVEN:1;              /* deprecated name - please avoid */
#endif
      } B;
   } INTC_BCR_32B_tag;

   typedef union {   /* CPR - Current Priority Register - Processor 0 */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  PRI:4;             /* Priority Bits */
      } B;
   } INTC_CPR_PRC0_32B_tag;

   typedef union {   /* CPR - Current Priority Register - Processor 1 */
      uint32_t R;
      struct {
         uint32_t:28;
         uint32_t  PRI:4;             /* Priority Bits */
      } B;
   } INTC_CPR_PRC1_32B_tag;

   typedef union {   /* IACKR- Interrupt Acknowledge Register - Processor 0 */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_INTC
         uint32_t  VTBA_PRC0:21;      /* Vector Table Base Address - Processor 0 */
#else
         uint32_t  VTBA:21;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_INTC
         uint32_t  INTEC_PRC0:9;      /* Interrupt Vector - Processor 0 */
#else
         uint32_t  INTVEC:9;            /* deprecated name - please avoid */
#endif
         uint32_t:2;
      } B;
   } INTC_IACKR_PRC0_32B_tag;

   typedef union {   /* IACKR- Interrupt Acknowledge Register - Processor 1 */
      uint32_t R;
      struct {
         uint32_t  VTBA_PRC1:21;      /* Vector Table Base Address - Processor 1 */
         uint32_t  INTEC_PRC1:9;      /* Interrupt Vector - Processor 1 */
         uint32_t:2;
      } B;
   } INTC_IACKR_PRC1_32B_tag;

   typedef union {   /* EOIR- End of Interrupt Register - Processor 0 */
      uint32_t R;
   } INTC_EOIR_PRC0_32B_tag;

   typedef union {   /* EOIR- End of Interrupt Register - Processor 1 */
      uint32_t R;
   } INTC_EOIR_PRC1_32B_tag;


   /* Register layout for all registers SSCIR... */

   typedef union {   /* SSCIR0-7 INTC Software Set/Clear Interrupt Registers */
      uint8_t R;
      struct {
         uint8_t:6;
         uint8_t   SET:1;             /* Set Flag bit */
         uint8_t   CLR:1;             /* Clear Flag bit */
      } B;
   } INTC_SSCIR_8B_tag;

   typedef union {   /* SSCIR0_3 - Software Set/Clear Interrupt Registers */
      uint32_t R;
      struct {
         uint32_t:6;
         uint32_t  SET0:1;            /* Set Flag 0 bit */
         uint32_t  CLR0:1;            /* Clear Flag 0 bit */
         uint32_t:6;
         uint32_t  SET1:1;            /* Set Flag 1 bit */
         uint32_t  CLR1:1;            /* Clear Flag 1 bit */
         uint32_t:6;
         uint32_t  SET2:1;            /* Set Flag 2 bit */
         uint32_t  CLR2:1;            /* Clear Flag 2 bit */
         uint32_t:6;
         uint32_t  SET3:1;            /* Set Flag 3 bit */
         uint32_t  CLR3:1;            /* Clear Flag 3 bit */
      } B;
   } INTC_SSCIR0_3_32B_tag;

   typedef union {   /* SSCIR4_7 - Software Set/Clear Interrupt Registers */
      uint32_t R;
      struct {
         uint32_t:6;
         uint32_t  SET4:1;            /* Set Flag 4 bit */
         uint32_t  CLR4:1;            /* Clear Flag 4 bit */
         uint32_t:6;
         uint32_t  SET5:1;            /* Set Flag 5 bit */
         uint32_t  CLR5:1;            /* Clear Flag 5 bit */
         uint32_t:6;
         uint32_t  SET6:1;            /* Set Flag 6 bit */
         uint32_t  CLR6:1;            /* Clear Flag 6 bit */
         uint32_t:6;
         uint32_t  SET7:1;            /* Set Flag 7 bit */
         uint32_t  CLR7:1;            /* Clear Flag 7 bit */
      } B;
   } INTC_SSCIR4_7_32B_tag;


   /* Register layout for all registers PSR... */

   typedef union {   /* PSR0-511 - Priority Select Registers */
      uint8_t R;
      struct {
         uint8_t   PRC_SEL:2;         /* Processor Select */
         uint8_t:2;
         uint8_t   PRI:4;             /* Priority Select */
      } B;
   } INTC_PSR_8B_tag;


   /* Register layout for all registers PSR... */

   typedef union {   /* PSR0_3 - 508_511 - Priority Select Registers */
      uint32_t R;
      struct {
         uint32_t  PRC_SEL0:2;        /* Processor Select - Entry 0 */
         uint32_t:2;
         uint32_t  PRI0:4;            /* Priority Select - Entry 0 */
         uint32_t  PRC_SEL1:2;        /* Processor Select - Entry 1 */
         uint32_t:2;
         uint32_t  PRI1:4;            /* Priority Select - Entry 1 */
         uint32_t  PRC_SEL2:2;        /* Processor Select - Entry 2 */
         uint32_t:2;
         uint32_t  PRI2:4;            /* Priority Select - Entry 2 */
         uint32_t  PRC_SEL3:2;        /* Processor Select - Entry 3 */
         uint32_t:2;
         uint32_t  PRI3:4;            /* Priority Select - Entry 3 */
      } B;
   } INTC_PSR_32B_tag;



   typedef struct INTC_struct_tag { /* start of INTC_tag */
      union {
         INTC_BCR_32B_tag MCR;             /* deprecated - please avoid */

                                   /* BCR - Block Configuration Register */
         INTC_BCR_32B_tag BCR;             /* offset: 0x0000 size: 32 bit */

