RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      int8_t INTC_reserved_0004_C[4];
      union {
                        /* CPR - Current Priority Register - Processor 0 */
         INTC_CPR_PRC0_32B_tag CPR_PRC0;   /* offset: 0x0008 size: 32 bit */

         INTC_CPR_PRC0_32B_tag CPR;        /* deprecated - please avoid */

      };
                        /* CPR - Current Priority Register - Processor 1 */
      INTC_CPR_PRC1_32B_tag CPR_PRC1;      /* offset: 0x000C size: 32 bit */
      union {
                  /* IACKR- Interrupt Acknowledge Register - Processor 0 */
         INTC_IACKR_PRC0_32B_tag IACKR_PRC0;  /* offset: 0x0010 size: 32 bit */

         INTC_IACKR_PRC0_32B_tag IACKR;    /* deprecated - please avoid */

      };
                  /* IACKR- Interrupt Acknowledge Register - Processor 1 */
      INTC_IACKR_PRC1_32B_tag IACKR_PRC1;  /* offset: 0x0014 size: 32 bit */
      union {
                        /* EOIR- End of Interrupt Register - Processor 0 */
         INTC_EOIR_PRC0_32B_tag EOIR_PRC0;  /* offset: 0x0018 size: 32 bit */

         INTC_EOIR_PRC0_32B_tag EOIR;      /* deprecated - please avoid */

      };
                        /* EOIR- End of Interrupt Register - Processor 1 */
      INTC_EOIR_PRC1_32B_tag EOIR_PRC1;    /* offset: 0x001C size: 32 bit */
      union {
                 /* SSCIR0-7 INTC Software Set/Clear Interrupt Registers */
         INTC_SSCIR_8B_tag SSCIR[8];       /* offset: 0x0020  (0x0001 x 8) */

         struct {
                 /* SSCIR0-7 INTC Software Set/Clear Interrupt Registers */
            INTC_SSCIR_8B_tag SSCIR0;      /* offset: 0x0020 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR1;      /* offset: 0x0021 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR2;      /* offset: 0x0022 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR3;      /* offset: 0x0023 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR4;      /* offset: 0x0024 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR5;      /* offset: 0x0025 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR6;      /* offset: 0x0026 size: 8 bit */
            INTC_SSCIR_8B_tag SSCIR7;      /* offset: 0x0027 size: 8 bit */
         };

         struct {
                    /* SSCIR0_3 - Software Set/Clear Interrupt Registers */
            INTC_SSCIR0_3_32B_tag SSCIR0_3;  /* offset: 0x0020 size: 32 bit */
                    /* SSCIR4_7 - Software Set/Clear Interrupt Registers */
            INTC_SSCIR4_7_32B_tag SSCIR4_7;  /* offset: 0x0024 size: 32 bit */
         };

      };
      int8_t INTC_reserved_0028_C[24];
      union {
                         /* PSR0_3 - 508_511 - Priority Select Registers */
         INTC_PSR_32B_tag PSR_32B[128];    /* offset: 0x0040  (0x0004 x 128) */

                                 /* PSR0-511 - Priority Select Registers */
         INTC_PSR_8B_tag PSR[512];         /* offset: 0x0040  (0x0001 x 512) */

         struct {
                         /* PSR0_3 - 508_511 - Priority Select Registers */
            INTC_PSR_32B_tag PSR0_3;       /* offset: 0x0040 size: 32 bit */
            INTC_PSR_32B_tag PSR4_7;       /* offset: 0x0044 size: 32 bit */
            INTC_PSR_32B_tag PSR8_11;      /* offset: 0x0048 size: 32 bit */
            INTC_PSR_32B_tag PSR12_15;     /* offset: 0x004C size: 32 bit */
            INTC_PSR_32B_tag PSR16_19;     /* offset: 0x0050 size: 32 bit */
            INTC_PSR_32B_tag PSR20_23;     /* offset: 0x0054 size: 32 bit */
            INTC_PSR_32B_tag PSR24_27;     /* offset: 0x0058 size: 32 bit */
            INTC_PSR_32B_tag PSR28_31;     /* offset: 0x005C size: 32 bit */
            INTC_PSR_32B_tag PSR32_35;     /* offset: 0x0060 size: 32 bit */
            INTC_PSR_32B_tag PSR36_39;     /* offset: 0x0064 size: 32 bit */
            INTC_PSR_32B_tag PSR40_43;     /* offset: 0x0068 size: 32 bit */
            INTC_PSR_32B_tag PSR44_47;     /* offset: 0x006C size: 32 bit */
            INTC_PSR_32B_tag PSR48_51;     /* offset: 0x0070 size: 32 bit */
            INTC_PSR_32B_tag PSR52_55;     /* offset: 0x0074 size: 32 bit */
            INTC_PSR_32B_tag PSR56_59;     /* offset: 0x0078 size: 32 bit */
            INTC_PSR_32B_tag PSR60_63;     /* offset: 0x007C size: 32 bit */
            INTC_PSR_32B_tag PSR64_67;     /* offset: 0x0080 size: 32 bit */
            INTC_PSR_32B_tag PSR68_71;     /* offset: 0x0084 size: 32 bit */
            INTC_PSR_32B_tag PSR72_75;     /* offset: 0x0088 size: 32 bit */
            INTC_PSR_32B_tag PSR76_79;     /* offset: 0x008C size: 32 bit */
            INTC_PSR_32B_tag PSR80_83;     /* offset: 0x0090 size: 32 bit */
            INTC_PSR_32B_tag PSR84_87;     /* offset: 0x0094 size: 32 bit */
            INTC_PSR_32B_tag PSR88_91;     /* offset: 0x0098 size: 32 bit */
            INTC_PSR_32B_tag PSR92_95;     /* offset: 0x009C size: 32 bit */
            INTC_PSR_32B_tag PSR96_99;     /* offset: 0x00A0 size: 32 bit */
            INTC_PSR_32B_tag PSR100_103;   /* offset: 0x00A4 size: 32 bit */
            INTC_PSR_32B_tag PSR104_107;   /* offset: 0x00A8 size: 32 bit */
            INTC_PSR_32B_tag PSR108_111;   /* offset: 0x00AC size: 32 bit */
            INTC_PSR_32B_tag PSR112_115;   /* offset: 0x00B0 size: 32 bit */
            INTC_PSR_32B_tag PSR116_119;   /* offset: 0x00B4 size: 32 bit */
            INTC_PSR_32B_tag PSR120_123;   /* offset: 0x00B8 size: 32 bit */
            INTC_PSR_32B_tag PSR124_127;   /* offset: 0x00BC size: 32 bit */
            INTC_PSR_32B_tag PSR128_131;   /* offset: 0x00C0 size: 32 bit */
            INTC_PSR_32B_tag PSR132_135;   /* offset: 0x00C4 size: 32 bit */
            INTC_PSR_32B_tag PSR136_139;   /* offset: 0x00C8 size: 32 bit */
            INTC_PSR_32B_tag PSR140_143;   /* offset: 0x00CC size: 32 bit */
            INTC_PSR_32B_tag PSR144_147;   /* offset: 0x00D0 size: 32 bit */
            INTC_PSR_32B_tag PSR148_151;   /* offset: 0x00D4 size: 32 bit */
            INTC_PSR_32B_tag PSR152_155;   /* offset: 0x00D8 size: 32 bit */
            INTC_PSR_32B_tag PSR156_159;   /* offset: 0x00DC size: 32 bit */
            INTC_PSR_32B_tag PSR160_163;   /* offset: 0x00E0 size: 32 bit */
            INTC_PSR_32B_tag PSR164_167;   /* offset: 0x00E4 size: 32 bit */
            INTC_PSR_32B_tag PSR168_171;   /* offset: 0x00E8 size: 32 bit */
            INTC_PSR_32B_tag PSR172_175;   /* offset: 0x00EC size: 32 bit */
            INTC_PSR_32B_tag PSR176_179;   /* offset: 0x00F0 size: 32 bit */
            INTC_PSR_32B_tag PSR180_183;   /* offset: 0x00F4 size: 32 bit */
            INTC_PSR_32B_tag PSR184_187;   /* offset: 0x00F8 size: 32 bit */
            INTC_PSR_32B_tag PSR188_191;   /* offset: 0x00FC size: 32 bit */
            INTC_PSR_32B_tag PSR192_195;   /* offset: 0x0100 size: 32 bit */
            INTC_PSR_32B_tag PSR196_199;   /* offset: 0x0104 size: 32 bit */
            INTC_PSR_32B_tag PSR200_203;   /* offset: 0x0108 size: 32 bit */
            INTC_PSR_32B_tag PSR204_207;   /* offset: 0x010C size: 32 bit */
            INTC_PSR_32B_tag PSR208_211;   /* offset: 0x0110 size: 32 bit */
            INTC_PSR_32B_tag PSR212_215;   /* offset: 0x0114 size: 32 bit */
            INTC_PSR_32B_tag PSR216_219;   /* offset: 0x0118 size: 32 bit */
            INTC_PSR_32B_tag PSR220_223;   /* offset: 0x011C size: 32 bit */
            INTC_PSR_32B_tag PSR224_227;   /* offset: 0x0120 size: 32 bit */
            INTC_PSR_32B_tag PSR228_231;   /* offset: 0x0124 size: 32 bit */
            INTC_PSR_32B_tag PSR232_235;   /* offset: 0x0128 size: 32 bit */
            INTC_PSR_32B_tag PSR236_239;   /* offset: 0x012C size: 32 bit */
            INTC_PSR_32B_tag PSR240_243;   /* offset: 0x0130 size: 32 bit */
            INTC_PSR_32B_tag PSR244_247;   /* offset: 0x0134 size: 32 bit */
            INTC_PSR_32B_tag PSR248_251;   /* offset: 0x0138 size: 32 bit */
            INTC_PSR_32B_tag PSR252_255;   /* offset: 0x013C size: 32 bit */
            INTC_PSR_32B_tag PSR256_259;   /* offset: 0x0140 size: 32 bit */
            INTC_PSR_32B_tag PSR260_263;   /* offset: 0x0144 size: 32 bit */
            INTC_PSR_32B_tag PSR264_267;   /* offset: 0x0148 size: 32 bit */
            INTC_PSR_32B_tag PSR268_271;   /* offset: 0x014C size: 32 bit */
            INTC_PSR_32B_tag PSR272_275;   /* offset: 0x0150 size: 32 bit */
            INTC_PSR_32B_tag PSR276_279;   /* offset: 0x0154 size: 32 bit */
            INTC_PSR_32B_tag PSR280_283;   /* offset: 0x0158 size: 32 bit */
            INTC_PSR_32B_tag PSR284_287;   /* offset: 0x015C size: 32 bit */
            INTC_PSR_32B_tag PSR288_291;   /* offset: 0x0160 size: 32 bit */
            INTC_PSR_32B_tag PSR292_295;   /* offset: 0x0164 size: 32 bit */
            INTC_PSR_32B_tag PSR296_299;   /* offset: 0x0168 size: 32 bit */
            INTC_PSR_32B_tag PSR300_303;   /* offset: 0x016C size: 32 bit */
            INTC_PSR_32B_tag PSR304_307;   /* offset: 0x0170 size: 32 bit */
            INTC_PSR_32B_tag PSR308_311;   /* offset: 0x0174 size: 32 bit */
            INTC_PSR_32B_tag PSR312_315;   /* offset: 0x0178 size: 32 bit */
            INTC_PSR_32B_tag PSR316_319;   /* offset: 0x017C size: 32 bit */
            INTC_PSR_32B_tag PSR320_323;   /* offset: 0x0180 size: 32 bit */
            INTC_PSR_32B_tag PSR324_327;   /* offset: 0x0184 size: 32 bit */
            INTC_PSR_32B_tag PSR328_331;   /* offset: 0x0188 size: 32 bit */
            INTC_PSR_32B_tag PSR332_335;   /* offset: 0x018C size: 32 bit */
            INTC_PSR_32B_tag PSR336_339;   /* offset: 0x0190 size: 32 bit */
            INTC_PSR_32B_tag PSR340_343;   /* offset: 0x0194 size: 32 bit */
            INTC_PSR_32B_tag PSR344_347;   /* offset: 0x0198 size: 32 bit */
            INTC_PSR_32B_tag PSR348_351;   /* offset: 0x019C size: 32 bit */
            INTC_PSR_32B_tag PSR352_355;   /* offset: 0x01A0 size: 32 bit */
            INTC_PSR_32B_tag PSR356_359;   /* offset: 0x01A4 size: 32 bit */
            INTC_PSR_32B_tag PSR360_363;   /* offset: 0x01A8 size: 32 bit */
            INTC_PSR_32B_tag PSR364_367;   /* offset: 0x01AC size: 32 bit */
            INTC_PSR_32B_tag PSR368_371;   /* offset: 0x01B0 size: 32 bit */
            INTC_PSR_32B_tag PSR372_375;   /* offset: 0x01B4 size: 32 bit */
            INTC_PSR_32B_tag PSR376_379;   /* offset: 0x01B8 size: 32 bit */
            INTC_PSR_32B_tag PSR380_383;   /* offset: 0x01BC size: 32 bit */
            INTC_PSR_32B_tag PSR384_387;   /* offset: 0x01C0 size: 32 bit */
            INTC_PSR_32B_tag PSR388_391;   /* offset: 0x01C4 size: 32 bit */
            INTC_PSR_32B_tag PSR392_395;   /* offset: 0x01C8 size: 32 bit */
            INTC_PSR_32B_tag PSR396_399;   /* offset: 0x01CC size: 32 bit */
            INTC_PSR_32B_tag PSR400_403;   /* offset: 0x01D0 size: 32 bit */
            INTC_PSR_32B_tag PSR404_407;   /* offset: 0x01D4 size: 32 bit */
            INTC_PSR_32B_tag PSR408_411;   /* offset: 0x01D8 size: 32 bit */
            INTC_PSR_32B_tag PSR412_415;   /* offset: 0x01DC size: 32 bit */
            INTC_PSR_32B_tag PSR416_419;   /* offset: 0x01E0 size: 32 bit */
            INTC_PSR_32B_tag PSR420_423;   /* offset: 0x01E4 size: 32 bit */
            INTC_PSR_32B_tag PSR424_427;   /* offset: 0x01E8 size: 32 bit */
            INTC_PSR_32B_tag PSR428_431;   /* offset: 0x01EC size: 32 bit */
            INTC_PSR_32B_tag PSR432_435;   /* offset: 0x01F0 size: 32 bit */
            INTC_PSR_32B_tag PSR436_439;   /* offset: 0x01F4 size: 32 bit */
            INTC_PSR_32B_tag PSR440_443;   /* offset: 0x01F8 size: 32 bit */
            INTC_PSR_32B_tag PSR444_447;   /* offset: 0x01FC size: 32 bit */
            INTC_PSR_32B_tag PSR448_451;   /* offset: 0x0200 size: 32 bit */
            INTC_PSR_32B_tag PSR452_455;   /* offset: 0x0204 size: 32 bit */
            INTC_PSR_32B_tag PSR456_459;   /* offset: 0x0208 size: 32 bit */
            INTC_PSR_32B_tag PSR460_463;   /* offset: 0x020C size: 32 bit */
            INTC_PSR_32B_tag PSR464_467;   /* offset: 0x0210 size: 32 bit */
            INTC_PSR_32B_tag PSR468_471;   /* offset: 0x0214 size: 32 bit */
            INTC_PSR_32B_tag PSR472_475;   /* offset: 0x0218 size: 32 bit */
            INTC_PSR_32B_tag PSR476_479;   /* offset: 0x021C size: 32 bit */
            INTC_PSR_32B_tag PSR480_483;   /* offset: 0x0220 size: 32 bit */
            INTC_PSR_32B_tag PSR484_487;   /* offset: 0x0224 size: 32 bit */
            INTC_PSR_32B_tag PSR488_491;   /* offset: 0x0228 size: 32 bit */
            INTC_PSR_32B_tag PSR492_495;   /* offset: 0x022C size: 32 bit */
            INTC_PSR_32B_tag PSR496_499;   /* offset: 0x0230 size: 32 bit */
            INTC_PSR_32B_tag PSR500_503;   /* offset: 0x0234 size: 32 bit */
            INTC_PSR_32B_tag PSR504_507;   /* offset: 0x0238 size: 32 bit */
            INTC_PSR_32B_tag PSR508_511;   /* offset: 0x023C size: 32 bit */
         };

