RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
            INTC_PSR_8B_tag PSR314;        /* offset: 0x017A size: 8 bit */
            INTC_PSR_8B_tag PSR315;        /* offset: 0x017B size: 8 bit */
            INTC_PSR_8B_tag PSR316;        /* offset: 0x017C size: 8 bit */
            INTC_PSR_8B_tag PSR317;        /* offset: 0x017D size: 8 bit */
            INTC_PSR_8B_tag PSR318;        /* offset: 0x017E size: 8 bit */
            INTC_PSR_8B_tag PSR319;        /* offset: 0x017F size: 8 bit */
            INTC_PSR_8B_tag PSR320;        /* offset: 0x0180 size: 8 bit */
            INTC_PSR_8B_tag PSR321;        /* offset: 0x0181 size: 8 bit */
            INTC_PSR_8B_tag PSR322;        /* offset: 0x0182 size: 8 bit */
            INTC_PSR_8B_tag PSR323;        /* offset: 0x0183 size: 8 bit */
            INTC_PSR_8B_tag PSR324;        /* offset: 0x0184 size: 8 bit */
            INTC_PSR_8B_tag PSR325;        /* offset: 0x0185 size: 8 bit */
            INTC_PSR_8B_tag PSR326;        /* offset: 0x0186 size: 8 bit */
            INTC_PSR_8B_tag PSR327;        /* offset: 0x0187 size: 8 bit */
            INTC_PSR_8B_tag PSR328;        /* offset: 0x0188 size: 8 bit */
            INTC_PSR_8B_tag PSR329;        /* offset: 0x0189 size: 8 bit */
            INTC_PSR_8B_tag PSR330;        /* offset: 0x018A size: 8 bit */
            INTC_PSR_8B_tag PSR331;        /* offset: 0x018B size: 8 bit */
            INTC_PSR_8B_tag PSR332;        /* offset: 0x018C size: 8 bit */
            INTC_PSR_8B_tag PSR333;        /* offset: 0x018D size: 8 bit */
            INTC_PSR_8B_tag PSR334;        /* offset: 0x018E size: 8 bit */
            INTC_PSR_8B_tag PSR335;        /* offset: 0x018F size: 8 bit */
            INTC_PSR_8B_tag PSR336;        /* offset: 0x0190 size: 8 bit */
            INTC_PSR_8B_tag PSR337;        /* offset: 0x0191 size: 8 bit */
            INTC_PSR_8B_tag PSR338;        /* offset: 0x0192 size: 8 bit */
            INTC_PSR_8B_tag PSR339;        /* offset: 0x0193 size: 8 bit */
            INTC_PSR_8B_tag PSR340;        /* offset: 0x0194 size: 8 bit */
            INTC_PSR_8B_tag PSR341;        /* offset: 0x0195 size: 8 bit */
            INTC_PSR_8B_tag PSR342;        /* offset: 0x0196 size: 8 bit */
            INTC_PSR_8B_tag PSR343;        /* offset: 0x0197 size: 8 bit */
            INTC_PSR_8B_tag PSR344;        /* offset: 0x0198 size: 8 bit */
            INTC_PSR_8B_tag PSR345;        /* offset: 0x0199 size: 8 bit */
            INTC_PSR_8B_tag PSR346;        /* offset: 0x019A size: 8 bit */
            INTC_PSR_8B_tag PSR347;        /* offset: 0x019B size: 8 bit */
            INTC_PSR_8B_tag PSR348;        /* offset: 0x019C size: 8 bit */
            INTC_PSR_8B_tag PSR349;        /* offset: 0x019D size: 8 bit */
            INTC_PSR_8B_tag PSR350;        /* offset: 0x019E size: 8 bit */
            INTC_PSR_8B_tag PSR351;        /* offset: 0x019F size: 8 bit */
            INTC_PSR_8B_tag PSR352;        /* offset: 0x01A0 size: 8 bit */
            INTC_PSR_8B_tag PSR353;        /* offset: 0x01A1 size: 8 bit */
            INTC_PSR_8B_tag PSR354;        /* offset: 0x01A2 size: 8 bit */
            INTC_PSR_8B_tag PSR355;        /* offset: 0x01A3 size: 8 bit */
            INTC_PSR_8B_tag PSR356;        /* offset: 0x01A4 size: 8 bit */
            INTC_PSR_8B_tag PSR357;        /* offset: 0x01A5 size: 8 bit */
            INTC_PSR_8B_tag PSR358;        /* offset: 0x01A6 size: 8 bit */
            INTC_PSR_8B_tag PSR359;        /* offset: 0x01A7 size: 8 bit */
            INTC_PSR_8B_tag PSR360;        /* offset: 0x01A8 size: 8 bit */
            INTC_PSR_8B_tag PSR361;        /* offset: 0x01A9 size: 8 bit */
            INTC_PSR_8B_tag PSR362;        /* offset: 0x01AA size: 8 bit */
            INTC_PSR_8B_tag PSR363;        /* offset: 0x01AB size: 8 bit */
            INTC_PSR_8B_tag PSR364;        /* offset: 0x01AC size: 8 bit */
            INTC_PSR_8B_tag PSR365;        /* offset: 0x01AD size: 8 bit */
            INTC_PSR_8B_tag PSR366;        /* offset: 0x01AE size: 8 bit */
            INTC_PSR_8B_tag PSR367;        /* offset: 0x01AF size: 8 bit */
            INTC_PSR_8B_tag PSR368;        /* offset: 0x01B0 size: 8 bit */
            INTC_PSR_8B_tag PSR369;        /* offset: 0x01B1 size: 8 bit */
            INTC_PSR_8B_tag PSR370;        /* offset: 0x01B2 size: 8 bit */
            INTC_PSR_8B_tag PSR371;        /* offset: 0x01B3 size: 8 bit */
            INTC_PSR_8B_tag PSR372;        /* offset: 0x01B4 size: 8 bit */
            INTC_PSR_8B_tag PSR373;        /* offset: 0x01B5 size: 8 bit */
            INTC_PSR_8B_tag PSR374;        /* offset: 0x01B6 size: 8 bit */
            INTC_PSR_8B_tag PSR375;        /* offset: 0x01B7 size: 8 bit */
            INTC_PSR_8B_tag PSR376;        /* offset: 0x01B8 size: 8 bit */
            INTC_PSR_8B_tag PSR377;        /* offset: 0x01B9 size: 8 bit */
            INTC_PSR_8B_tag PSR378;        /* offset: 0x01BA size: 8 bit */
            INTC_PSR_8B_tag PSR379;        /* offset: 0x01BB size: 8 bit */
            INTC_PSR_8B_tag PSR380;        /* offset: 0x01BC size: 8 bit */
            INTC_PSR_8B_tag PSR381;        /* offset: 0x01BD size: 8 bit */
            INTC_PSR_8B_tag PSR382;        /* offset: 0x01BE size: 8 bit */
            INTC_PSR_8B_tag PSR383;        /* offset: 0x01BF size: 8 bit */
            INTC_PSR_8B_tag PSR384;        /* offset: 0x01C0 size: 8 bit */
            INTC_PSR_8B_tag PSR385;        /* offset: 0x01C1 size: 8 bit */
            INTC_PSR_8B_tag PSR386;        /* offset: 0x01C2 size: 8 bit */
            INTC_PSR_8B_tag PSR387;        /* offset: 0x01C3 size: 8 bit */
            INTC_PSR_8B_tag PSR388;        /* offset: 0x01C4 size: 8 bit */
            INTC_PSR_8B_tag PSR389;        /* offset: 0x01C5 size: 8 bit */
            INTC_PSR_8B_tag PSR390;        /* offset: 0x01C6 size: 8 bit */
            INTC_PSR_8B_tag PSR391;        /* offset: 0x01C7 size: 8 bit */
            INTC_PSR_8B_tag PSR392;        /* offset: 0x01C8 size: 8 bit */
            INTC_PSR_8B_tag PSR393;        /* offset: 0x01C9 size: 8 bit */
            INTC_PSR_8B_tag PSR394;        /* offset: 0x01CA size: 8 bit */
            INTC_PSR_8B_tag PSR395;        /* offset: 0x01CB size: 8 bit */
            INTC_PSR_8B_tag PSR396;        /* offset: 0x01CC size: 8 bit */
            INTC_PSR_8B_tag PSR397;        /* offset: 0x01CD size: 8 bit */
            INTC_PSR_8B_tag PSR398;        /* offset: 0x01CE size: 8 bit */
            INTC_PSR_8B_tag PSR399;        /* offset: 0x01CF size: 8 bit */
            INTC_PSR_8B_tag PSR400;        /* offset: 0x01D0 size: 8 bit */
            INTC_PSR_8B_tag PSR401;        /* offset: 0x01D1 size: 8 bit */
            INTC_PSR_8B_tag PSR402;        /* offset: 0x01D2 size: 8 bit */
            INTC_PSR_8B_tag PSR403;        /* offset: 0x01D3 size: 8 bit */
            INTC_PSR_8B_tag PSR404;        /* offset: 0x01D4 size: 8 bit */
            INTC_PSR_8B_tag PSR405;        /* offset: 0x01D5 size: 8 bit */
            INTC_PSR_8B_tag PSR406;        /* offset: 0x01D6 size: 8 bit */
            INTC_PSR_8B_tag PSR407;        /* offset: 0x01D7 size: 8 bit */
            INTC_PSR_8B_tag PSR408;        /* offset: 0x01D8 size: 8 bit */
            INTC_PSR_8B_tag PSR409;        /* offset: 0x01D9 size: 8 bit */
            INTC_PSR_8B_tag PSR410;        /* offset: 0x01DA size: 8 bit */
            INTC_PSR_8B_tag PSR411;        /* offset: 0x01DB size: 8 bit */
            INTC_PSR_8B_tag PSR412;        /* offset: 0x01DC size: 8 bit */
            INTC_PSR_8B_tag PSR413;        /* offset: 0x01DD size: 8 bit */
            INTC_PSR_8B_tag PSR414;        /* offset: 0x01DE size: 8 bit */
            INTC_PSR_8B_tag PSR415;        /* offset: 0x01DF size: 8 bit */
            INTC_PSR_8B_tag PSR416;        /* offset: 0x01E0 size: 8 bit */
            INTC_PSR_8B_tag PSR417;        /* offset: 0x01E1 size: 8 bit */
            INTC_PSR_8B_tag PSR418;        /* offset: 0x01E2 size: 8 bit */
            INTC_PSR_8B_tag PSR419;        /* offset: 0x01E3 size: 8 bit */
            INTC_PSR_8B_tag PSR420;        /* offset: 0x01E4 size: 8 bit */
            INTC_PSR_8B_tag PSR421;        /* offset: 0x01E5 size: 8 bit */
            INTC_PSR_8B_tag PSR422;        /* offset: 0x01E6 size: 8 bit */
            INTC_PSR_8B_tag PSR423;        /* offset: 0x01E7 size: 8 bit */
            INTC_PSR_8B_tag PSR424;        /* offset: 0x01E8 size: 8 bit */
            INTC_PSR_8B_tag PSR425;        /* offset: 0x01E9 size: 8 bit */
            INTC_PSR_8B_tag PSR426;        /* offset: 0x01EA size: 8 bit */
            INTC_PSR_8B_tag PSR427;        /* offset: 0x01EB size: 8 bit */
            INTC_PSR_8B_tag PSR428;        /* offset: 0x01EC size: 8 bit */
            INTC_PSR_8B_tag PSR429;        /* offset: 0x01ED size: 8 bit */
            INTC_PSR_8B_tag PSR430;        /* offset: 0x01EE size: 8 bit */
            INTC_PSR_8B_tag PSR431;        /* offset: 0x01EF size: 8 bit */
            INTC_PSR_8B_tag PSR432;        /* offset: 0x01F0 size: 8 bit */
            INTC_PSR_8B_tag PSR433;        /* offset: 0x01F1 size: 8 bit */
            INTC_PSR_8B_tag PSR434;        /* offset: 0x01F2 size: 8 bit */
            INTC_PSR_8B_tag PSR435;        /* offset: 0x01F3 size: 8 bit */
            INTC_PSR_8B_tag PSR436;        /* offset: 0x01F4 size: 8 bit */
            INTC_PSR_8B_tag PSR437;        /* offset: 0x01F5 size: 8 bit */
            INTC_PSR_8B_tag PSR438;        /* offset: 0x01F6 size: 8 bit */
            INTC_PSR_8B_tag PSR439;        /* offset: 0x01F7 size: 8 bit */
            INTC_PSR_8B_tag PSR440;        /* offset: 0x01F8 size: 8 bit */
            INTC_PSR_8B_tag PSR441;        /* offset: 0x01F9 size: 8 bit */
            INTC_PSR_8B_tag PSR442;        /* offset: 0x01FA size: 8 bit */
            INTC_PSR_8B_tag PSR443;        /* offset: 0x01FB size: 8 bit */
            INTC_PSR_8B_tag PSR444;        /* offset: 0x01FC size: 8 bit */
            INTC_PSR_8B_tag PSR445;        /* offset: 0x01FD size: 8 bit */
            INTC_PSR_8B_tag PSR446;        /* offset: 0x01FE size: 8 bit */
            INTC_PSR_8B_tag PSR447;        /* offset: 0x01FF size: 8 bit */
            INTC_PSR_8B_tag PSR448;        /* offset: 0x0200 size: 8 bit */
            INTC_PSR_8B_tag PSR449;        /* offset: 0x0201 size: 8 bit */
            INTC_PSR_8B_tag PSR450;        /* offset: 0x0202 size: 8 bit */
            INTC_PSR_8B_tag PSR451;        /* offset: 0x0203 size: 8 bit */
            INTC_PSR_8B_tag PSR452;        /* offset: 0x0204 size: 8 bit */
            INTC_PSR_8B_tag PSR453;        /* offset: 0x0205 size: 8 bit */
            INTC_PSR_8B_tag PSR454;        /* offset: 0x0206 size: 8 bit */
            INTC_PSR_8B_tag PSR455;        /* offset: 0x0207 size: 8 bit */
            INTC_PSR_8B_tag PSR456;        /* offset: 0x0208 size: 8 bit */
            INTC_PSR_8B_tag PSR457;        /* offset: 0x0209 size: 8 bit */
            INTC_PSR_8B_tag PSR458;        /* offset: 0x020A size: 8 bit */
            INTC_PSR_8B_tag PSR459;        /* offset: 0x020B size: 8 bit */
            INTC_PSR_8B_tag PSR460;        /* offset: 0x020C size: 8 bit */
            INTC_PSR_8B_tag PSR461;        /* offset: 0x020D size: 8 bit */
            INTC_PSR_8B_tag PSR462;        /* offset: 0x020E size: 8 bit */
            INTC_PSR_8B_tag PSR463;        /* offset: 0x020F size: 8 bit */
            INTC_PSR_8B_tag PSR464;        /* offset: 0x0210 size: 8 bit */
            INTC_PSR_8B_tag PSR465;        /* offset: 0x0211 size: 8 bit */
            INTC_PSR_8B_tag PSR466;        /* offset: 0x0212 size: 8 bit */
            INTC_PSR_8B_tag PSR467;        /* offset: 0x0213 size: 8 bit */
            INTC_PSR_8B_tag PSR468;        /* offset: 0x0214 size: 8 bit */
            INTC_PSR_8B_tag PSR469;        /* offset: 0x0215 size: 8 bit */
            INTC_PSR_8B_tag PSR470;        /* offset: 0x0216 size: 8 bit */
            INTC_PSR_8B_tag PSR471;        /* offset: 0x0217 size: 8 bit */
            INTC_PSR_8B_tag PSR472;        /* offset: 0x0218 size: 8 bit */
            INTC_PSR_8B_tag PSR473;        /* offset: 0x0219 size: 8 bit */
            INTC_PSR_8B_tag PSR474;        /* offset: 0x021A size: 8 bit */
            INTC_PSR_8B_tag PSR475;        /* offset: 0x021B size: 8 bit */
            INTC_PSR_8B_tag PSR476;        /* offset: 0x021C size: 8 bit */
            INTC_PSR_8B_tag PSR477;        /* offset: 0x021D size: 8 bit */
            INTC_PSR_8B_tag PSR478;        /* offset: 0x021E size: 8 bit */
            INTC_PSR_8B_tag PSR479;        /* offset: 0x021F size: 8 bit */
            INTC_PSR_8B_tag PSR480;        /* offset: 0x0220 size: 8 bit */
            INTC_PSR_8B_tag PSR481;        /* offset: 0x0221 size: 8 bit */
            INTC_PSR_8B_tag PSR482;        /* offset: 0x0222 size: 8 bit */
            INTC_PSR_8B_tag PSR483;        /* offset: 0x0223 size: 8 bit */
            INTC_PSR_8B_tag PSR484;        /* offset: 0x0224 size: 8 bit */
            INTC_PSR_8B_tag PSR485;        /* offset: 0x0225 size: 8 bit */
            INTC_PSR_8B_tag PSR486;        /* offset: 0x0226 size: 8 bit */
            INTC_PSR_8B_tag PSR487;        /* offset: 0x0227 size: 8 bit */
            INTC_PSR_8B_tag PSR488;        /* offset: 0x0228 size: 8 bit */
            INTC_PSR_8B_tag PSR489;        /* offset: 0x0229 size: 8 bit */
            INTC_PSR_8B_tag PSR490;        /* offset: 0x022A size: 8 bit */
            INTC_PSR_8B_tag PSR491;        /* offset: 0x022B size: 8 bit */
            INTC_PSR_8B_tag PSR492;        /* offset: 0x022C size: 8 bit */
            INTC_PSR_8B_tag PSR493;        /* offset: 0x022D size: 8 bit */
            INTC_PSR_8B_tag PSR494;        /* offset: 0x022E size: 8 bit */
            INTC_PSR_8B_tag PSR495;        /* offset: 0x022F size: 8 bit */
            INTC_PSR_8B_tag PSR496;        /* offset: 0x0230 size: 8 bit */
            INTC_PSR_8B_tag PSR497;        /* offset: 0x0231 size: 8 bit */
            INTC_PSR_8B_tag PSR498;        /* offset: 0x0232 size: 8 bit */
            INTC_PSR_8B_tag PSR499;        /* offset: 0x0233 size: 8 bit */
            INTC_PSR_8B_tag PSR500;        /* offset: 0x0234 size: 8 bit */
            INTC_PSR_8B_tag PSR501;        /* offset: 0x0235 size: 8 bit */
            INTC_PSR_8B_tag PSR502;        /* offset: 0x0236 size: 8 bit */
            INTC_PSR_8B_tag PSR503;        /* offset: 0x0237 size: 8 bit */
            INTC_PSR_8B_tag PSR504;        /* offset: 0x0238 size: 8 bit */
            INTC_PSR_8B_tag PSR505;        /* offset: 0x0239 size: 8 bit */
            INTC_PSR_8B_tag PSR506;        /* offset: 0x023A size: 8 bit */
            INTC_PSR_8B_tag PSR507;        /* offset: 0x023B size: 8 bit */
            INTC_PSR_8B_tag PSR508;        /* offset: 0x023C size: 8 bit */
            INTC_PSR_8B_tag PSR509;        /* offset: 0x023D size: 8 bit */
            INTC_PSR_8B_tag PSR510;        /* offset: 0x023E size: 8 bit */
            INTC_PSR_8B_tag PSR511;        /* offset: 0x023F size: 8 bit */
         };

