RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
   } INTC_tag;


#define INTC  (*(volatile INTC_tag *) 0xFFF48000UL)



/****************************************************************/
/*                                                              */
/* Module: DSPI  */
/*                                                              */
/****************************************************************/

   typedef union DSPI_MCR_tag {   /* MCR - Module Configuration Register */
      uint32_t R;
      struct {
         uint32_t  MSTR:1;            /* Master/Slave mode select */
         uint32_t  CONT_SCKE:1;       /* Continuous SCK Enable */
         uint32_t  DCONF:2;           /* DSPI Configuration */
         uint32_t  FRZ:1;             /* Freeze */
         uint32_t  MTFE:1;            /* Modified Timing Format Enable */
         uint32_t  PCSSE:1;           /* Peripheral Chip Select Strobe Enable */
         uint32_t  ROOE:1;            /* Receive FIFO Overflow Overwrite Enable */
         uint32_t  PCSIS7:1;          /* Peripheral Chip Select 7 Inactive State */
         uint32_t  PCSIS6:1;          /* Peripheral Chip Select 6 Inactive State */
         uint32_t  PCSIS5:1;          /* Peripheral Chip Select 5 Inactive State */
         uint32_t  PCSIS4:1;          /* Peripheral Chip Select 4 Inactive State */
         uint32_t  PCSIS3:1;          /* Peripheral Chip Select 3 Inactive State */
         uint32_t  PCSIS2:1;          /* Peripheral Chip Select 2 Inactive State */
         uint32_t  PCSIS1:1;          /* Peripheral Chip Select 1 Inactive State */
         uint32_t  PCSIS0:1;          /* Peripheral Chip Select 0 Inactive State */
         uint32_t  DOZE:1;            /* Doze Enable */
         uint32_t  MDIS:1;            /* Module Disable */
         uint32_t  DIS_TXF:1;         /* Disable Transmit FIFO */
         uint32_t  DIS_RXF:1;         /* Disable Receive FIFO */
         uint32_t  CLR_TXF:1;         /* Clear TX FIFO */
         uint32_t  CLR_RXF:1;         /* Clear RX FIFO */
         uint32_t  SMPL_PT:2;         /* Sample Point */
         uint32_t:7;
         uint32_t  HALT:1;            /* Halt */
      } B;
   } DSPI_MCR_32B_tag;

   typedef union {   /* TCR - Transfer Count Register */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  SPI_TCNT:16;       /* SPI Transfer Counter */
#else
         uint32_t  TCNT:16;             /* deprecated name - please avoid */
#endif
         uint32_t:16;
      } B;
   } DSPI_TCR_32B_tag;


   /* Register layout for all registers CTAR... */

   typedef union DSPI_CTAR_tag {   /* CTAR0-7 - Clock and Transfer Attribute Registers */
      uint32_t R;
      struct {
         uint32_t  DBR:1;             /* Double Baud Rate */
         uint32_t  FMSZ:4;            /* Frame Size */
         uint32_t  CPOL:1;            /* Clock Polarity */
         uint32_t  CPHA:1;            /* Clock Phase */
         uint32_t  LSBFE:1;           /* LSB First Enable */
         uint32_t  PCSSCK:2;          /* PCS to SCK Delay Prescaler */
         uint32_t  PASC:2;            /* After SCK Delay Prescaler */
         uint32_t  PDT:2;             /* Delay after Transfer Prescaler */
         uint32_t  PBR:2;             /* Baud Rate Prescaler */
         uint32_t  CSSCK:4;           /* PCS to SCK Delay Scaler */
         uint32_t  ASC:4;             /* After SCK Delay Scaler */
         uint32_t  DT:4;              /* Delay after Transfer Scaler */
         uint32_t  BR:4;              /* Baud Rate Scaler */
      } B;
   } DSPI_CTAR_32B_tag;

   typedef union DSPI_SR_tag {   /* SR - Status Register */
      uint32_t R;
      struct {
         uint32_t  TCF:1;             /* Transfer Complete Flag */
         uint32_t  TXRXS:1;           /* TX & RX Status */
         uint32_t:1;
         uint32_t  EOQF:1;            /* End of queue Flag */
         uint32_t  TFUF:1;            /* Transmit FIFO Underflow Flag */
         uint32_t:1;
         uint32_t  TFFF:1;            /* Transmit FIFO FIll Flag */
         uint32_t:5;
         uint32_t  RFOF:1;            /* Receive FIFO Overflow Flag */
         uint32_t:1;
         uint32_t  RFDF:1;            /* Receive FIFO Drain Flag */
         uint32_t:1;
         uint32_t  TXCTR:4;           /* TX FIFO Counter */
         uint32_t  TXNXTPTR:4;        /* Transmit Next Pointer */
         uint32_t  RXCTR:4;           /* RX FIFO Counter */
         uint32_t  POPNXTPTR:4;       /* Pop Next Pointer */
      } B;
   } DSPI_SR_32B_tag;

   typedef union DSPI_RSER_tag {   /* RSER - DMA/Interrupt Request Register */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  TCF_RE:1;          /* Transmission Complete Request Enable */
#else
         uint32_t  TCFRE:1;             /* deprecated name - please avoid */
#endif
         uint32_t:2;
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  EOQF_RE:1;         /* DSPI Finished Request Enable */
#else
         uint32_t  EOQFRE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  TFUF_RE:1;         /* Transmit FIFO Underflow Request Enable */
#else
         uint32_t  TFUFRE:1;            /* deprecated name - please avoid */
#endif
         uint32_t:1;
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  TFFF_RE:1;         /* Transmit FIFO Fill Request Enable */
#else
         uint32_t  TFFFRE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  TFFF_DIRS:1;       /* Transmit FIFO Fill DMA or Interrupt Request Select */
#else
         uint32_t  TFFFDIRS:1;          /* deprecated name - please avoid */
#endif
         uint32_t:4;
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  RFOF_RE:1;         /* Receive FIFO overflow Request Enable */
#else
         uint32_t  RFOFRE:1;            /* deprecated name - please avoid */
#endif
         uint32_t:1;
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  RFDF_RE:1;         /* Receive FIFO Drain Request Enable */
#else
         uint32_t  RFDFRE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  RFDF_DIRS:1;       /* Receive FIFO Drain DMA or Interrupt Request Select */
#else
         uint32_t  RFDFDIRS:1;          /* deprecated name - please avoid */
#endif
         uint32_t:16;
      } B;
   } DSPI_RSER_32B_tag;

   typedef union DSPI_PUSHR_tag {   /* PUSHR - PUSH TX FIFO Register */
      uint32_t R;
      struct {
         uint32_t  CONT:1;            /* Continuous Peripheral Chip Select Enable */
         uint32_t  CTAS:3;            /* Clock and Transfer Attributes Select */
         uint32_t  EOQ:1;             /* End of Queue */
         uint32_t  CTCNT:1;           /* Clear SPI_TCNT */
         uint32_t:2;
         uint32_t  PCS7:1;            /* Peripheral Chip Select 7 */
         uint32_t  PCS6:1;            /* Peripheral Chip Select 6 */
         uint32_t  PCS5:1;            /* Peripheral Chip Select 5 */
         uint32_t  PCS4:1;            /* Peripheral Chip Select 4 */
         uint32_t  PCS3:1;            /* Peripheral Chip Select 3 */
         uint32_t  PCS2:1;            /* Peripheral Chip Select 2 */
         uint32_t  PCS1:1;            /* Peripheral Chip Select 1 */
         uint32_t  PCS0:1;            /* Peripheral Chip Select 0 */
         uint32_t  TXDATA:16;         /* Transmit Data */
      } B;
   } DSPI_PUSHR_32B_tag;

