RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union DSPI_POPR_tag {   /* POPR - POP RX FIFO Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  RXDATA:16;         /* Receive Data */
      } B;
   } DSPI_POPR_32B_tag;


   /* Register layout for all registers TXFR... */

   typedef union {   /* Transmit FIFO Registers */
      uint32_t R;
      struct {
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  FIFO_TXCMD:16;     /* Transmit Command */
#else
         uint32_t  TXCMD:16;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  FIFO_TXDATA:16;    /* Transmit Data */
#else
         uint32_t  TXDATA:16;           /* deprecated name - please avoid */
#endif
      } B;
   } DSPI_TXFR_32B_tag;


   /* Register layout for all registers RXFR... */

   typedef union {   /* Receive FIFO Registers */
      uint32_t R;
      struct {
         uint32_t:16;
#ifndef USE_FIELD_ALIASES_DSPI
         uint32_t  FIFO_RXDATA:16;    /* Transmit Data */
#else
         uint32_t  RXDATA:16;           /* deprecated name - please avoid */
#endif
      } B;
   } DSPI_RXFR_32B_tag;

   typedef union {   /* DSICR - DSI Configuration Register */
      uint32_t R;
      struct {
         uint32_t  MTOE:1;            /* Multiple Transfer Operation Enable */
         uint32_t:1;
         uint32_t  MTOCNT:6;          /* Multiple Transfer Operation Count */
         uint32_t:4;
         uint32_t  TXSS:1;            /* Transmit Data Source Select */
         uint32_t  TPOL:1;            /* Trigger Polarity */
         uint32_t  TRRE:1;            /* Trigger Reception Enable */
         uint32_t  CID:1;             /* Change in Data Transfer Enable */
         uint32_t  DCONT:1;           /* DSI Continuous Peripheral Chip Select Enable */
         uint32_t  DSICTAS:3;         /* DSI CLock and Transfer Attributes Select */
         uint32_t:4;
         uint32_t  DPCS7:1;           /* DSI Peripheral Chip Select 7 */
         uint32_t  DPCS6:1;           /* DSI Peripheral Chip Select 6 */
         uint32_t  DPCS5:1;           /* DSI Peripheral Chip Select 5 */
         uint32_t  DPCS4:1;           /* DSI Peripheral Chip Select 4 */
         uint32_t  DPCS3:1;           /* DSI Peripheral Chip Select 3 */
         uint32_t  DPCS2:1;           /* DSI Peripheral Chip Select 2 */
         uint32_t  DPCS1:1;           /* DSI Peripheral Chip Select 1 */
         uint32_t  DPCS0:1;           /* DSI Peripheral Chip Select 0 */
      } B;
   } DSPI_DSICR_32B_tag;

   typedef union {   /* SDR - DSI Serialization Data Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  SER_DATA:16;       /* Serialized Data */
      } B;
   } DSPI_SDR_32B_tag;

   typedef union {   /* ASDR - DSI Alternate Serialization Data Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  ASER_DATA:16;      /* Alternate Serialized Data */
      } B;
   } DSPI_ASDR_32B_tag;

   typedef union {   /* COMPR - DSI Transmit Comparison Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  COMP_DATA:16;      /* Compare Data */
      } B;
   } DSPI_COMPR_32B_tag;

   typedef union {   /* DDR - DSI Deserialization Data Register */
      uint32_t R;
      struct {
         uint32_t:16;
         uint32_t  DESER_DATA:16;     /* Deserialized Data */
      } B;
   } DSPI_DDR_32B_tag;

   typedef union {   /* DSICR1 - DSI Configuration Register 1 */
      uint32_t R;
   } DSPI_DSICR1_32B_tag;



   typedef struct DSPI_tag { /* start of DSPI_tag */
                                  /* MCR - Module Configuration Register */
      DSPI_MCR_32B_tag MCR;                /* offset: 0x0000 size: 32 bit */
      int8_t DSPI_reserved_0004[4];
                                        /* TCR - Transfer Count Register */
      DSPI_TCR_32B_tag TCR;                /* offset: 0x0008 size: 32 bit */
      union {
                     /* CTAR0-7 - Clock and Transfer Attribute Registers */
         DSPI_CTAR_32B_tag CTAR[8];        /* offset: 0x000C  (0x0004 x 8) */

         struct {
                     /* CTAR0-7 - Clock and Transfer Attribute Registers */
            DSPI_CTAR_32B_tag CTAR0;       /* offset: 0x000C size: 32 bit */
            DSPI_CTAR_32B_tag CTAR1;       /* offset: 0x0010 size: 32 bit */
            DSPI_CTAR_32B_tag CTAR2;       /* offset: 0x0014 size: 32 bit */
            DSPI_CTAR_32B_tag CTAR3;       /* offset: 0x0018 size: 32 bit */
            DSPI_CTAR_32B_tag CTAR4;       /* offset: 0x001C size: 32 bit */
            DSPI_CTAR_32B_tag CTAR5;       /* offset: 0x0020 size: 32 bit */
            DSPI_CTAR_32B_tag CTAR6;       /* offset: 0x0024 size: 32 bit */
            DSPI_CTAR_32B_tag CTAR7;       /* offset: 0x0028 size: 32 bit */
         };

      };
                                                 /* SR - Status Register */
      DSPI_SR_32B_tag SR;                  /* offset: 0x002C size: 32 bit */
                                /* RSER - DMA/Interrupt Request Register */
      DSPI_RSER_32B_tag RSER;              /* offset: 0x0030 size: 32 bit */
                                        /* PUSHR - PUSH TX FIFO Register */
      DSPI_PUSHR_32B_tag PUSHR;            /* offset: 0x0034 size: 32 bit */
                                          /* POPR - POP RX FIFO Register */
      DSPI_POPR_32B_tag POPR;              /* offset: 0x0038 size: 32 bit */
      union {
                                              /* Transmit FIFO Registers */
         DSPI_TXFR_32B_tag TXFR[5];        /* offset: 0x003C  (0x0004 x 5) */

         struct {
                                              /* Transmit FIFO Registers */
            DSPI_TXFR_32B_tag TXFR0;       /* offset: 0x003C size: 32 bit */
            DSPI_TXFR_32B_tag TXFR1;       /* offset: 0x0040 size: 32 bit */
            DSPI_TXFR_32B_tag TXFR2;       /* offset: 0x0044 size: 32 bit */
            DSPI_TXFR_32B_tag TXFR3;       /* offset: 0x0048 size: 32 bit */
            DSPI_TXFR_32B_tag TXFR4;       /* offset: 0x004C size: 32 bit */
         };

