RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      int8_t DSPI_reserved_0050_C[44];
      union {
                                               /* Receive FIFO Registers */
         DSPI_RXFR_32B_tag RXFR[5];        /* offset: 0x007C  (0x0004 x 5) */

         struct {
                                               /* Receive FIFO Registers */
            DSPI_RXFR_32B_tag RXFR0;       /* offset: 0x007C size: 32 bit */
            DSPI_RXFR_32B_tag RXFR1;       /* offset: 0x0080 size: 32 bit */
            DSPI_RXFR_32B_tag RXFR2;       /* offset: 0x0084 size: 32 bit */
            DSPI_RXFR_32B_tag RXFR3;       /* offset: 0x0088 size: 32 bit */
            DSPI_RXFR_32B_tag RXFR4;       /* offset: 0x008C size: 32 bit */
         };

      };
      int8_t DSPI_reserved_0090[44];
                                   /* DSICR - DSI Configuration Register */
      DSPI_DSICR_32B_tag DSICR;            /* offset: 0x00BC size: 32 bit */
                                /* SDR - DSI Serialization Data Register */
      DSPI_SDR_32B_tag SDR;                /* offset: 0x00C0 size: 32 bit */
                     /* ASDR - DSI Alternate Serialization Data Register */
      DSPI_ASDR_32B_tag ASDR;              /* offset: 0x00C4 size: 32 bit */
                             /* COMPR - DSI Transmit Comparison Register */
      DSPI_COMPR_32B_tag COMPR;            /* offset: 0x00C8 size: 32 bit */
                              /* DDR - DSI Deserialization Data Register */
      DSPI_DDR_32B_tag DDR;                /* offset: 0x00CC size: 32 bit */
                                /* DSICR1 - DSI Configuration Register 1 */
      DSPI_DSICR1_32B_tag DSICR1;          /* offset: 0x00D0 size: 32 bit */
   } DSPI_tag;


#define DSPI_A (*(volatile DSPI_tag *) 0xFFF90000UL)
#define DSPI_B (*(volatile DSPI_tag *) 0xFFF94000UL)
#define DSPI_C (*(volatile DSPI_tag *) 0xFFF98000UL)



/****************************************************************/
/*                                                              */
/* Module: FLEXCAN  */
/*                                                              */
/****************************************************************/

   typedef union {   /* MCR - Module Configuration Register */
      uint32_t R;
      struct {
         uint32_t  MDIS:1;            /* Module Disable */
         uint32_t  FRZ:1;             /* Freeze Enable */
         uint32_t  FEN:1;             /* FIFO Enable */
         uint32_t  HALT:1;            /* Halt Flexcan */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  NOT_RDY:1;         /* Flexcan Not Ready */
#else
         uint32_t  NOTRDY:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  WAK_MSK:1;         /* Wake Up Interrupt Mask */
#else
         uint32_t  WAKMSK:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  SOFT_RST:1;        /* Soft Reset */
#else
         uint32_t  SOFTRST:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  FRZ_ACK:1;         /* Freeze Mode Acknowledge */
#else
         uint32_t  FRZACK:1;            /* deprecated name - please avoid */
#endif
         uint32_t  SUPV:1;            /* Supervisor Mode */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  SLF_WAK:1;         /* Self Wake Up */
#else
         uint32_t  SLFWAK:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  WRN_EN:1;          /* Warning Interrupt Enable */
#else
         uint32_t  WRNEN:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  LPM_ACK:1;         /* Low Power Mode Acknowledge */
#else
         uint32_t  LPMACK:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  WAK_SRC:1;         /* Wake Up Source */
#else
         uint32_t  WAKSRC:1;            /* deprecated name - please avoid */
#endif
         uint32_t  DOZE:1;            /* Doze Mode Enable */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  SRX_DIS:1;         /* Self Reception Disable */
#else
         uint32_t  SRXDIS:1;            /* deprecated name - please avoid */
#endif
         uint32_t  BCC:1;             /* Backwards Compatibility Configuration */
         uint32_t:2;
         uint32_t  LPRIO_EN:1;        /* Local Priority Enable */
         uint32_t  AEN:1;             /* Abort Enable */
         uint32_t:2;
         uint32_t  IDAM:2;            /* ID Acceptance Mode */
         uint32_t:2;
         uint32_t  MAXMB:6;           /* Maximum Number of Message Buffers */
      } B;
   } FLEXCAN_MCR_32B_tag;

   typedef union {   /* CTRL -  Control Register */
      uint32_t R;
      struct {
         uint32_t  PRESDIV:8;         /* Prescaler Divsion Factor */
         uint32_t  RJW:2;             /* Resync Jump Width */
         uint32_t  PSEG1:3;           /* Phase Segment 1 */
         uint32_t  PSEG2:3;           /* Phase Segment 2 */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BOFF_MSK:1;        /* Bus Off Mask */
#else
         uint32_t  BOFFMSK:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  ERR_MSK:1;         /* Error Mask */
#else
         uint32_t  ERRMSK:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  CLK_SRC:1;         /* CAN Engine Clock Source */
#else
         uint32_t  CLKSRC:1;            /* deprecated name - please avoid */
#endif
         uint32_t  LPB:1;             /* Loop Back */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  TWRN_MSK:1;        /* Tx Warning Interrupt Mask */
#else
         uint32_t  TWRNMSK:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  RWRN_MSK:1;        /* Rx Warning Interrupt Mask */
#else
         uint32_t  RWRNMSK:1;           /* deprecated name - please avoid */
#endif
         uint32_t:2;
         uint32_t  SMP:1;             /* Sampling Mode */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BOFF_REC:1;        /* Bus Off Recovery Mode */
#else
         uint32_t  BOFFREC:1;           /* deprecated name - please avoid */
#endif
         uint32_t  TSYN:1;            /* Timer Sync Mode */
         uint32_t  LBUF:1;            /* Lowest Buffer Transmitted First */
         uint32_t  LOM:1;             /* Listen-Only Mode */
         uint32_t  PROPSEG:3;         /* Propagation Segment */
      } B;
   } FLEXCAN_CTRL_32B_tag;

