RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* TIMER - Free Running Timer */
      uint32_t R;
   } FLEXCAN_TIMER_32B_tag;

   typedef union {   /* RXGMASK - Rx Global Mask Register */
      uint32_t R;
#ifndef USE_FIELD_ALIASES_FLEXCAN
      struct {
         uint32_t  MI:32;             /* deprecated field -- do not use */
      } B;
#endif
   } FLEXCAN_RXGMASK_32B_tag;

   typedef union {   /* RX14MASK - Rx 14 Mask Register */
      uint32_t R;
#ifndef USE_FIELD_ALIASES_FLEXCAN
      struct {
         uint32_t  MI:32;             /* deprecated field -- do not use */
      } B;
#endif
   } FLEXCAN_RX14MASK_32B_tag;

   typedef union {   /* RX15MASK - Rx 15 Mask Register */
      uint32_t R;
#ifndef USE_FIELD_ALIASES_FLEXCAN
      struct {
         uint32_t  MI:32;             /* deprecated field -- do not use */
      } B;
#endif
   } FLEXCAN_RX15MASK_32B_tag;

   typedef union {   /* ECR - Error Counter Register */
      uint32_t R;
      struct {
         uint32_t:16;
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  RX_ERR_COUNTER:8;   /* Rx Error Counter */
#else
         uint32_t  RXECNT:8;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  TX_ERR_COUNTER:8;   /* Tx Error Counter */
#else
         uint32_t  TXECNT:8;            /* deprecated name - please avoid */
#endif
      } B;
   } FLEXCAN_ECR_32B_tag;

   typedef union {   /* ESR - Error and Status Register */
      uint32_t R;
      struct {
         uint32_t:14;
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  TWRN_INT:1;        /* Tx Warning Interrupt Flag */
#else
         uint32_t  TWRNINT:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  RWRN_INT:1;        /* Rx Warning Interrupt Flag */
#else
         uint32_t  RWRNINT:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BIT1_ERR:1;        /* Bit 1 Error */
#else
         uint32_t  BIT1ERR:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BIT0_ERR:1;        /* Bit 0 Error */
#else
         uint32_t  BIT0ERR:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  ACK_ERR:1;         /* Acknowledge Error */
#else
         uint32_t  ACKERR:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  CRC_ERR:1;         /* Cyclic Redundancy Check Error */
#else
         uint32_t  CRCERR:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  FRM_ERR:1;         /* Form Error */
#else
         uint32_t  FRMERR:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  STF_ERR:1;         /* Stuffing Error */
#else
         uint32_t  STFERR:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  TX_WRN:1;          /* Tx Error Counter */
#else
         uint32_t  TXWRN:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  RX_WRN:1;          /* Rx Error Counter */
#else
         uint32_t  RXWRN:1;             /* deprecated name - please avoid */
#endif
         uint32_t  IDLE:1;            /* CAN bus Idle State */
         uint32_t  TXRX:1;            /* Current Flexcan Status */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  FLT_CONF:2;        /* Fault Confinement State */
#else
         uint32_t  FLTCONF:2;           /* deprecated name - please avoid */
#endif
         uint32_t:1;
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BOFF_INT:1;        /* Bus Off Interrupt */
#else
         uint32_t  BOFFINT:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  ERR_INT:1;         /* Error Interrupt */
#else
         uint32_t  ERRINT:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  WAK_INT:1;         /* Wake-Up Interrupt */
#else
         uint32_t  WAKINT:1;            /* deprecated name - please avoid */
#endif
      } B;
   } FLEXCAN_ESR_32B_tag;

   typedef union {   /* IMASK2 - Interrupt Masks 2 Register */
      uint32_t R;
      struct {
         uint32_t  BUF63M:1;          /* Buffer MB Mask 63 Bit */
         uint32_t  BUF62M:1;          /* Buffer MB Mask 62 Bit */
         uint32_t  BUF61M:1;          /* Buffer MB Mask 61 Bit */
         uint32_t  BUF60M:1;          /* Buffer MB Mask 60 Bit */
         uint32_t  BUF59M:1;          /* Buffer MB Mask 59 Bit */
         uint32_t  BUF58M:1;          /* Buffer MB Mask 58 Bit */
         uint32_t  BUF57M:1;          /* Buffer MB Mask 57 Bit */
         uint32_t  BUF56M:1;          /* Buffer MB Mask 56 Bit */
         uint32_t  BUF55M:1;          /* Buffer MB Mask 55 Bit */
         uint32_t  BUF54M:1;          /* Buffer MB Mask 54 Bit */
         uint32_t  BUF53M:1;          /* Buffer MB Mask 53 Bit */
         uint32_t  BUF52M:1;          /* Buffer MB Mask 52 Bit */
         uint32_t  BUF51M:1;          /* Buffer MB Mask 51 Bit */
         uint32_t  BUF50M:1;          /* Buffer MB Mask 50 Bit */
         uint32_t  BUF49M:1;          /* Buffer MB Mask 49 Bit */
         uint32_t  BUF48M:1;          /* Buffer MB Mask 48 Bit */
         uint32_t  BUF47M:1;          /* Buffer MB Mask 47 Bit */
         uint32_t  BUF46M:1;          /* Buffer MB Mask 46 Bit */
         uint32_t  BUF45M:1;          /* Buffer MB Mask 45 Bit */
         uint32_t  BUF44M:1;          /* Buffer MB Mask 44 Bit */
         uint32_t  BUF43M:1;          /* Buffer MB Mask 43 Bit */
         uint32_t  BUF42M:1;          /* Buffer MB Mask 42 Bit */
         uint32_t  BUF41M:1;          /* Buffer MB Mask 41 Bit */
         uint32_t  BUF40M:1;          /* Buffer MB Mask 40 Bit */
         uint32_t  BUF39M:1;          /* Buffer MB Mask 39 Bit */
         uint32_t  BUF38M:1;          /* Buffer MB Mask 38 Bit */
         uint32_t  BUF37M:1;          /* Buffer MB Mask 37 Bit */
         uint32_t  BUF36M:1;          /* Buffer MB Mask 36 Bit */
         uint32_t  BUF35M:1;          /* Buffer MB Mask 35 Bit */
         uint32_t  BUF34M:1;          /* Buffer MB Mask 34 Bit */
         uint32_t  BUF33M:1;          /* Buffer MB Mask 33 Bit */
         uint32_t  BUF32M:1;          /* Buffer MB Mask 32 Bit */
      } B;
   } FLEXCAN_IMASK2_32B_tag;

