RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* IMASK1 - Interrupt Masks 1 Register */
      uint32_t R;
      struct {
         uint32_t  BUF31M:1;          /* Buffer MB Mask 31 Bit */
         uint32_t  BUF30M:1;          /* Buffer MB Mask 30 Bit */
         uint32_t  BUF29M:1;          /* Buffer MB Mask 29 Bit */
         uint32_t  BUF28M:1;          /* Buffer MB Mask 28 Bit */
         uint32_t  BUF27M:1;          /* Buffer MB Mask 27 Bit */
         uint32_t  BUF26M:1;          /* Buffer MB Mask 26 Bit */
         uint32_t  BUF25M:1;          /* Buffer MB Mask 25 Bit */
         uint32_t  BUF24M:1;          /* Buffer MB Mask 24 Bit */
         uint32_t  BUF23M:1;          /* Buffer MB Mask 23 Bit */
         uint32_t  BUF22M:1;          /* Buffer MB Mask 22 Bit */
         uint32_t  BUF21M:1;          /* Buffer MB Mask 21 Bit */
         uint32_t  BUF20M:1;          /* Buffer MB Mask 20 Bit */
         uint32_t  BUF19M:1;          /* Buffer MB Mask 19 Bit */
         uint32_t  BUF18M:1;          /* Buffer MB Mask 18 Bit */
         uint32_t  BUF17M:1;          /* Buffer MB Mask 17 Bit */
         uint32_t  BUF16M:1;          /* Buffer MB Mask 16 Bit */
         uint32_t  BUF15M:1;          /* Buffer MB Mask 15 Bit */
         uint32_t  BUF14M:1;          /* Buffer MB Mask 14 Bit */
         uint32_t  BUF13M:1;          /* Buffer MB Mask 13 Bit */
         uint32_t  BUF12M:1;          /* Buffer MB Mask 12 Bit */
         uint32_t  BUF11M:1;          /* Buffer MB Mask 11 Bit */
         uint32_t  BUF10M:1;          /* Buffer MB Mask 10 Bit */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF9M:1;           /* Buffer MB Mask 9 Bit */
#else
         uint32_t  BUF09M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF8M:1;           /* Buffer MB Mask 8 Bit */
#else
         uint32_t  BUF08M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF7M:1;           /* Buffer MB Mask 7 Bit */
#else
         uint32_t  BUF07M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF6M:1;           /* Buffer MB Mask 6 Bit */
#else
         uint32_t  BUF06M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF5M:1;           /* Buffer MB Mask 5 Bit */
#else
         uint32_t  BUF05M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF4M:1;           /* Buffer MB Mask 4 Bit */
#else
         uint32_t  BUF04M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF3M:1;           /* Buffer MB Mask 3 Bit */
#else
         uint32_t  BUF03M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF2M:1;           /* Buffer MB Mask 2 Bit */
#else
         uint32_t  BUF02M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF1M:1;           /* Buffer MB Mask 1 Bit */
#else
         uint32_t  BUF01M:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF0M:1;           /* Buffer MB Mask 0 Bit */
#else
         uint32_t  BUF00M:1;            /* deprecated name - please avoid */
#endif
      } B;
   } FLEXCAN_IMASK1_32B_tag;

   typedef union {   /* IFLAG2 - Interrupt Flags 2 Register */
      uint32_t R;
      struct {
         uint32_t  BUF63I:1;          /* Buffer MB Interrupt 63 Bit */
         uint32_t  BUF62I:1;          /* Buffer MB Interrupt 62 Bit */
         uint32_t  BUF61I:1;          /* Buffer MB Interrupt 61 Bit */
         uint32_t  BUF60I:1;          /* Buffer MB Interrupt 60 Bit */
         uint32_t  BUF59I:1;          /* Buffer MB Interrupt 59 Bit */
         uint32_t  BUF58I:1;          /* Buffer MB Interrupt 58 Bit */
         uint32_t  BUF57I:1;          /* Buffer MB Interrupt 57 Bit */
         uint32_t  BUF56I:1;          /* Buffer MB Interrupt 56 Bit */
         uint32_t  BUF55I:1;          /* Buffer MB Interrupt 55 Bit */
         uint32_t  BUF54I:1;          /* Buffer MB Interrupt 54 Bit */
         uint32_t  BUF53I:1;          /* Buffer MB Interrupt 53 Bit */
         uint32_t  BUF52I:1;          /* Buffer MB Interrupt 52 Bit */
         uint32_t  BUF51I:1;          /* Buffer MB Interrupt 51 Bit */
         uint32_t  BUF50I:1;          /* Buffer MB Interrupt 50 Bit */
         uint32_t  BUF49I:1;          /* Buffer MB Interrupt 49 Bit */
         uint32_t  BUF48I:1;          /* Buffer MB Interrupt 48 Bit */
         uint32_t  BUF47I:1;          /* Buffer MB Interrupt 47 Bit */
         uint32_t  BUF46I:1;          /* Buffer MB Interrupt 46 Bit */
         uint32_t  BUF45I:1;          /* Buffer MB Interrupt 45 Bit */
         uint32_t  BUF44I:1;          /* Buffer MB Interrupt 44 Bit */
         uint32_t  BUF43I:1;          /* Buffer MB Interrupt 43 Bit */
         uint32_t  BUF42I:1;          /* Buffer MB Interrupt 42 Bit */
         uint32_t  BUF41I:1;          /* Buffer MB Interrupt 41 Bit */
         uint32_t  BUF40I:1;          /* Buffer MB Interrupt 40 Bit */
         uint32_t  BUF39I:1;          /* Buffer MB Interrupt 39 Bit */
         uint32_t  BUF38I:1;          /* Buffer MB Interrupt 38 Bit */
         uint32_t  BUF37I:1;          /* Buffer MB Interrupt 37 Bit */
         uint32_t  BUF36I:1;          /* Buffer MB Interrupt 36 Bit */
         uint32_t  BUF35I:1;          /* Buffer MB Interrupt 35 Bit */
         uint32_t  BUF34I:1;          /* Buffer MB Interrupt 34 Bit */
         uint32_t  BUF33I:1;          /* Buffer MB Interrupt 33 Bit */
         uint32_t  BUF32I:1;          /* Buffer MB Interrupt 32 Bit */
      } B;
   } FLEXCAN_IFLAG2_32B_tag;

   typedef union {   /* IFLAG1 - Interrupt Flags 1 Register */
      uint32_t R;
      struct {
         uint32_t  BUF31I:1;          /* Buffer MB Interrupt 31 Bit */
         uint32_t  BUF30I:1;          /* Buffer MB Interrupt 30 Bit */
         uint32_t  BUF29I:1;          /* Buffer MB Interrupt 29 Bit */
         uint32_t  BUF28I:1;          /* Buffer MB Interrupt 28 Bit */
         uint32_t  BUF27I:1;          /* Buffer MB Interrupt 27 Bit */
         uint32_t  BUF26I:1;          /* Buffer MB Interrupt 26 Bit */
         uint32_t  BUF25I:1;          /* Buffer MB Interrupt 25 Bit */
         uint32_t  BUF24I:1;          /* Buffer MB Interrupt 24 Bit */
         uint32_t  BUF23I:1;          /* Buffer MB Interrupt 23 Bit */
         uint32_t  BUF22I:1;          /* Buffer MB Interrupt 22 Bit */
         uint32_t  BUF21I:1;          /* Buffer MB Interrupt 21 Bit */
         uint32_t  BUF20I:1;          /* Buffer MB Interrupt 20 Bit */
         uint32_t  BUF19I:1;          /* Buffer MB Interrupt 19 Bit */
         uint32_t  BUF18I:1;          /* Buffer MB Interrupt 18 Bit */
         uint32_t  BUF17I:1;          /* Buffer MB Interrupt 17 Bit */
         uint32_t  BUF16I:1;          /* Buffer MB Interrupt 16 Bit */
         uint32_t  BUF15I:1;          /* Buffer MB Interrupt 15 Bit */
         uint32_t  BUF14I:1;          /* Buffer MB Interrupt 14 Bit */
         uint32_t  BUF13I:1;          /* Buffer MB Interrupt 13 Bit */
         uint32_t  BUF12I:1;          /* Buffer MB Interrupt 12 Bit */
         uint32_t  BUF11I:1;          /* Buffer MB Interrupt 11 Bit */
         uint32_t  BUF10I:1;          /* Buffer MB Interrupt 10 Bit */
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF9I:1;           /* Buffer MB Interrupt 9 Bit */
#else
         uint32_t  BUF09I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF8I:1;           /* Buffer MB Interrupt 8 Bit */
#else
         uint32_t  BUF08I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF7I:1;           /* Buffer MB Interrupt 7 Bit */
#else
         uint32_t  BUF07I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF6I:1;           /* Buffer MB Interrupt 6 Bit */
#else
         uint32_t  BUF06I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF5I:1;           /* Buffer MB Interrupt 5 Bit */
#else
         uint32_t  BUF05I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF4I:1;           /* Buffer MB Interrupt 4 Bit */
#else
         uint32_t  BUF04I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF3I:1;           /* Buffer MB Interrupt 3 Bit */
#else
         uint32_t  BUF03I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF2I:1;           /* Buffer MB Interrupt 2 Bit */
#else
         uint32_t  BUF02I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF1I:1;           /* Buffer MB Interrupt 1 Bit */
#else
         uint32_t  BUF01I:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FLEXCAN
         uint32_t  BUF0I:1;           /* Buffer MB Interrupt 0 Bit */
#else
         uint32_t  BUF00I:1;            /* deprecated name - please avoid */
#endif
      } B;
   } FLEXCAN_IFLAG1_32B_tag;


   /* Register layout for all registers MSG_CS... */

   typedef union {   /* Message Buffer Control and Status */
      uint32_t R;
      struct {
         uint32_t:4;
         uint32_t  CODE:4;            /* Message Buffer Code */
         uint32_t:1;
         uint32_t  SRR:1;             /* Substitute Remote Request */
         uint32_t  IDE:1;             /* ID Extended Bit */
         uint32_t  RTR:1;             /* Remote Transmission Request */
         uint32_t  LENGTH:4;          /* Length of Data in Bytes */
         uint32_t  TIMESTAMP:16;      /* Free-Running Counter Time Stamp */
      } B;
   } FLEXCAN_MSG_CS_32B_tag;


   /* Register layout for all registers MSG_ID... */

   typedef union {   /* Message Buffer Identifier Field */
      uint32_t R;
      struct {
         uint32_t  PRIO:3;            /* Local Priority */
         uint32_t STD_ID:11;
         uint32_t EXT_ID:18;
      } B;
   } FLEXCAN_MSG_ID_32B_tag;


   /* Register layout for all registers MSG_BYTE0_3... */

   typedef union {   /* Message Buffer Data Register */
      uint32_t R;
      uint8_t   BYTE[4];    /* individual bytes can be accessed */
      uint32_t  WORD;       /* individual words can be accessed */
   } FLEXCAN_MSG_DATA_32B_tag;

