RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
    typedef union {
            uint8_t  B[8]; /* Data buffer in Bytes (8 bits) */
            uint16_t H[4]; /* Data buffer in Half-words (16 bits) */
            uint32_t W[2]; /* Data buffer in words (32 bits) */
            uint32_t R[2]; /* Data buffer in words (32 bits) */
   } FLEXCAN_MSG_DATA2_32B_tag;

   /* Register layout for all registers MSG_BYTE4_7 matches xxx */


   /* Register layout for all registers RXIMR... */

   typedef union {   /* FLEXCAN_RXIMR0 - FLEXCAN_RXIMR63 - RX Individual Mask Registers */
      uint32_t R;
   } FLEXCAN_RXIMR_32B_tag;


   typedef struct FLEXCAN_MB_struct_tag {

      union {
                                    /* Message Buffer Control and Status */
         FLEXCAN_MSG_CS_32B_tag MSG_CS;   /* relative offset: 0x0000 */
         FLEXCAN_MSG_CS_32B_tag CS;       /* deprecated - please avoid */
      };
      union {
                                      /* Message Buffer Identifier Field */
         FLEXCAN_MSG_ID_32B_tag MSG_ID;   /* relative offset: 0x0004 */
         FLEXCAN_MSG_ID_32B_tag ID;       /* deprecated - please avoid */
      };
      union {	  /* Message Buffer Data Register */
	     
		 struct {
            FLEXCAN_MSG_DATA_32B_tag MSG_BYTE0_3;  /* relative offset: 0x0008 */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG_BYTE4_7;  /* relative offset: 0x000C */
         };
		 
		 FLEXCAN_MSG_DATA2_32B_tag DATA;  /* relative offset: 0x000C */
		 
      };

   } FLEXCAN_MB_tag;


   typedef struct FLEXCAN_struct_tag { /* start of FLEXCAN_tag */
                                  /* MCR - Module Configuration Register */
      FLEXCAN_MCR_32B_tag MCR;             /* offset: 0x0000 size: 32 bit */
      union {
                                             /* CTRL -  Control Register */
         FLEXCAN_CTRL_32B_tag CTRL;        /* offset: 0x0004 size: 32 bit */

         FLEXCAN_CTRL_32B_tag CR;          /* deprecated - please avoid */

      };
                                           /* TIMER - Free Running Timer */
      FLEXCAN_TIMER_32B_tag TIMER;         /* offset: 0x0008 size: 32 bit */
      int8_t FLEXCAN_reserved_000C[4];
                                    /* RXGMASK - Rx Global Mask Register */
      FLEXCAN_RXGMASK_32B_tag RXGMASK;     /* offset: 0x0010 size: 32 bit */
                                       /* RX14MASK - Rx 14 Mask Register */
      FLEXCAN_RX14MASK_32B_tag RX14MASK;   /* offset: 0x0014 size: 32 bit */
                                       /* RX15MASK - Rx 15 Mask Register */
      FLEXCAN_RX15MASK_32B_tag RX15MASK;   /* offset: 0x0018 size: 32 bit */
                                         /* ECR - Error Counter Register */
      FLEXCAN_ECR_32B_tag ECR;             /* offset: 0x001C size: 32 bit */
                                      /* ESR - Error and Status Register */
      FLEXCAN_ESR_32B_tag ESR;             /* offset: 0x0020 size: 32 bit */
      union {
         FLEXCAN_IMASK2_32B_tag IMRH;      /* deprecated - please avoid */

                                  /* IMASK2 - Interrupt Masks 2 Register */
         FLEXCAN_IMASK2_32B_tag IMASK2;    /* offset: 0x0024 size: 32 bit */

      };
      union {
         FLEXCAN_IMASK1_32B_tag IMRL;      /* deprecated - please avoid */

                                  /* IMASK1 - Interrupt Masks 1 Register */
         FLEXCAN_IMASK1_32B_tag IMASK1;    /* offset: 0x0028 size: 32 bit */

      };
      union {
         FLEXCAN_IFLAG2_32B_tag IFRH;      /* deprecated - please avoid */

                                  /* IFLAG2 - Interrupt Flags 2 Register */
         FLEXCAN_IFLAG2_32B_tag IFLAG2;    /* offset: 0x002C size: 32 bit */

      };
      union {
         FLEXCAN_IFLAG1_32B_tag IFRL;      /* deprecated - please avoid */

                                  /* IFLAG1 - Interrupt Flags 1 Register */
         FLEXCAN_IFLAG1_32B_tag IFLAG1;    /* offset: 0x0030 size: 32 bit */

      };
      int8_t FLEXCAN_reserved_0034_C[76];
      union {
                                                     /*  Register set MB */
         FLEXCAN_MB_tag MB[64];            /* offset: 0x0080  (0x0010 x 64) */

                                                   /*  Alias name for MB */
         FLEXCAN_MB_tag BUF[64];           /* deprecated - please avoid */

         struct {
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG0_CS;  /* offset: 0x0080 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG0_ID;  /* offset: 0x0084 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG0_BYTE0_3;  /* offset: 0x0088 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG0_BYTE4_7;  /* offset: 0x008C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG1_CS;  /* offset: 0x0090 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG1_ID;  /* offset: 0x0094 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG1_BYTE0_3;  /* offset: 0x0098 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG1_BYTE4_7;  /* offset: 0x009C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG2_CS;  /* offset: 0x00A0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG2_ID;  /* offset: 0x00A4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG2_BYTE0_3;  /* offset: 0x00A8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG2_BYTE4_7;  /* offset: 0x00AC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG3_CS;  /* offset: 0x00B0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG3_ID;  /* offset: 0x00B4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG3_BYTE0_3;  /* offset: 0x00B8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG3_BYTE4_7;  /* offset: 0x00BC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG4_CS;  /* offset: 0x00C0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG4_ID;  /* offset: 0x00C4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG4_BYTE0_3;  /* offset: 0x00C8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG4_BYTE4_7;  /* offset: 0x00CC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG5_CS;  /* offset: 0x00D0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG5_ID;  /* offset: 0x00D4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG5_BYTE0_3;  /* offset: 0x00D8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG5_BYTE4_7;  /* offset: 0x00DC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG6_CS;  /* offset: 0x00E0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG6_ID;  /* offset: 0x00E4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG6_BYTE0_3;  /* offset: 0x00E8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG6_BYTE4_7;  /* offset: 0x00EC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG7_CS;  /* offset: 0x00F0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG7_ID;  /* offset: 0x00F4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG7_BYTE0_3;  /* offset: 0x00F8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG7_BYTE4_7;  /* offset: 0x00FC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG8_CS;  /* offset: 0x0100 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG8_ID;  /* offset: 0x0104 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG8_BYTE0_3;  /* offset: 0x0108 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG8_BYTE4_7;  /* offset: 0x010C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG9_CS;  /* offset: 0x0110 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG9_ID;  /* offset: 0x0114 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG9_BYTE0_3;  /* offset: 0x0118 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG9_BYTE4_7;  /* offset: 0x011C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG10_CS;  /* offset: 0x0120 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG10_ID;  /* offset: 0x0124 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG10_BYTE0_3;  /* offset: 0x0128 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG10_BYTE4_7;  /* offset: 0x012C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG11_CS;  /* offset: 0x0130 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG11_ID;  /* offset: 0x0134 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG11_BYTE0_3;  /* offset: 0x0138 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG11_BYTE4_7;  /* offset: 0x013C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG12_CS;  /* offset: 0x0140 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG12_ID;  /* offset: 0x0144 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG12_BYTE0_3;  /* offset: 0x0148 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG12_BYTE4_7;  /* offset: 0x014C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG13_CS;  /* offset: 0x0150 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG13_ID;  /* offset: 0x0154 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG13_BYTE0_3;  /* offset: 0x0158 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG13_BYTE4_7;  /* offset: 0x015C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG14_CS;  /* offset: 0x0160 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG14_ID;  /* offset: 0x0164 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG14_BYTE0_3;  /* offset: 0x0168 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG14_BYTE4_7;  /* offset: 0x016C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG15_CS;  /* offset: 0x0170 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG15_ID;  /* offset: 0x0174 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG15_BYTE0_3;  /* offset: 0x0178 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG15_BYTE4_7;  /* offset: 0x017C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG16_CS;  /* offset: 0x0180 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG16_ID;  /* offset: 0x0184 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG16_BYTE0_3;  /* offset: 0x0188 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG16_BYTE4_7;  /* offset: 0x018C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG17_CS;  /* offset: 0x0190 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG17_ID;  /* offset: 0x0194 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG17_BYTE0_3;  /* offset: 0x0198 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG17_BYTE4_7;  /* offset: 0x019C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG18_CS;  /* offset: 0x01A0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG18_ID;  /* offset: 0x01A4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG18_BYTE0_3;  /* offset: 0x01A8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG18_BYTE4_7;  /* offset: 0x01AC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG19_CS;  /* offset: 0x01B0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG19_ID;  /* offset: 0x01B4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG19_BYTE0_3;  /* offset: 0x01B8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG19_BYTE4_7;  /* offset: 0x01BC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG20_CS;  /* offset: 0x01C0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG20_ID;  /* offset: 0x01C4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG20_BYTE0_3;  /* offset: 0x01C8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG20_BYTE4_7;  /* offset: 0x01CC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG21_CS;  /* offset: 0x01D0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG21_ID;  /* offset: 0x01D4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG21_BYTE0_3;  /* offset: 0x01D8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG21_BYTE4_7;  /* offset: 0x01DC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG22_CS;  /* offset: 0x01E0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG22_ID;  /* offset: 0x01E4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG22_BYTE0_3;  /* offset: 0x01E8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG22_BYTE4_7;  /* offset: 0x01EC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG23_CS;  /* offset: 0x01F0 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG23_ID;  /* offset: 0x01F4 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG23_BYTE0_3;  /* offset: 0x01F8 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG23_BYTE4_7;  /* offset: 0x01FC size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG24_CS;  /* offset: 0x0200 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG24_ID;  /* offset: 0x0204 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG24_BYTE0_3;  /* offset: 0x0208 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG24_BYTE4_7;  /* offset: 0x020C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG25_CS;  /* offset: 0x0210 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG25_ID;  /* offset: 0x0214 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG25_BYTE0_3;  /* offset: 0x0218 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG25_BYTE4_7;  /* offset: 0x021C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG26_CS;  /* offset: 0x0220 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG26_ID;  /* offset: 0x0224 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG26_BYTE0_3;  /* offset: 0x0228 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG26_BYTE4_7;  /* offset: 0x022C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG27_CS;  /* offset: 0x0230 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG27_ID;  /* offset: 0x0234 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG27_BYTE0_3;  /* offset: 0x0238 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG27_BYTE4_7;  /* offset: 0x023C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG28_CS;  /* offset: 0x0240 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG28_ID;  /* offset: 0x0244 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG28_BYTE0_3;  /* offset: 0x0248 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG28_BYTE4_7;  /* offset: 0x024C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG29_CS;  /* offset: 0x0250 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG29_ID;  /* offset: 0x0254 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG29_BYTE0_3;  /* offset: 0x0258 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG29_BYTE4_7;  /* offset: 0x025C size: 32 bit */
                                    /* Message Buffer Control and Status */
            FLEXCAN_MSG_CS_32B_tag MSG30_CS;  /* offset: 0x0260 size: 32 bit */
                                      /* Message Buffer Identifier Field */
            FLEXCAN_MSG_ID_32B_tag MSG30_ID;  /* offset: 0x0264 size: 32 bit */
                                         /* Message Buffer Data Register */
            FLEXCAN_MSG_DATA_32B_tag MSG30_BYTE0_3;  /* offset: 0x0268 size: 32 bit */
