RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
                     /* CHCONFIG[0-15] - Channel Configuration Registers */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG0;  /* offset: 0x0000 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG1;  /* offset: 0x0001 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG2;  /* offset: 0x0002 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG3;  /* offset: 0x0003 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG4;  /* offset: 0x0004 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG5;  /* offset: 0x0005 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG6;  /* offset: 0x0006 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG7;  /* offset: 0x0007 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG8;  /* offset: 0x0008 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG9;  /* offset: 0x0009 size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG10;  /* offset: 0x000A size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG11;  /* offset: 0x000B size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG12;  /* offset: 0x000C size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG13;  /* offset: 0x000D size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG14;  /* offset: 0x000E size: 8 bit */
            DMA_CH_MUX_CHCONFIG_8B_tag CHCONFIG15;  /* offset: 0x000F size: 8 bit */
         };

      };
   } DMA_CH_MUX_tag;


#define DMA_CH_MUX (*(volatile DMA_CH_MUX_tag *) 0xFFFDC000UL)



/****************************************************************/
/*                                                              */
/* Module: FR  */
/*                                                              */
/****************************************************************/

   typedef union {   /* Module Version Number */
      uint16_t R;
      struct {
         uint16_t  CHIVER:8;          /* VERSION NUMBER OF CHI */
         uint16_t  PEVER:8;           /* VERSION NUMBER OF PE */
      } B;
   } FR_MVR_16B_tag;

   typedef union {   /* Module Configuration Register */
      uint16_t R;
      struct {
         uint16_t  MEN:1;             /* Module Enable */
         uint16_t  SBFF:1;            /* System Bus Failure Freeze */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SCM:1;             /* single channel device mode */
#else
         uint16_t  SCMD:1;              /* deprecated name - please avoid */
#endif
         uint16_t  CHB:1;             /* Channel B enable */
         uint16_t  CHA:1;             /* channel A enable */
         uint16_t  SFFE:1;            /* Sync. frame filter Enable */
         uint16_t  ECCE:1;            /* ECC Functionlity Enable */
         uint16_t  TMODER:1;          /* Functional Test mode */
         uint16_t  FUM:1;             /* FIFO Update Mode */
         uint16_t  FAM:1;             /* FIFO Address Mode */
         uint16_t:1;
         uint16_t  CLKSEL:1;          /* Protocol Engine clock source select */
         uint16_t  BITRATE:3;         /* Bus bit rate */
         uint16_t:1;
      } B;
   } FR_MCR_16B_tag;

   typedef union {   /* SYSTEM MEMORY BASE ADD HIGH REG */
      uint16_t R;
      struct {
         uint16_t  SMBA_31_16:16;     /* SYS_MEM_BASE_ADDR[31:16] */
      } B;
   } FR_SYMBADHR_16B_tag;

   typedef union {   /* SYSTEM MEMORY BASE ADD LOW  REG */
      uint16_t R;
      struct {
         uint16_t  SMBA_15_4:12;      /* SYS_MEM_BASE_ADDR[15:4] */
         uint16_t:4;
      } B;
   } FR_SYMBADLR_16B_tag;

   typedef union {   /* STROBE SIGNAL CONTROL REGISTER */
      uint16_t R;
      struct {
         uint16_t  WMD:1;             /* DEFINES WRITE MODE OF REG */
         uint16_t:3;
         uint16_t  SEL:4;             /* STROBE SIGNSL SELECT */
         uint16_t:3;
         uint16_t  ENB:1;             /* STROBE SIGNAL ENABLE */
         uint16_t:2;
         uint16_t  STBPSEL:2;         /* STROBE PORT SELECT */
      } B;
   } FR_STBSCR_16B_tag;

   typedef union {   /* MESSAGE BUFFER DATA SIZE REGISTER */
      uint16_t R;
      struct {
         uint16_t:1;
         uint16_t  MBSEG2DS:7;        /* MESSAGE BUFFER SEGMENT 2 DATA SIZE */
         uint16_t:1;
         uint16_t  MBSEG1DS:7;        /* MESSAGE BUFFER SEGMENT 1 DATA SIZE */
      } B;
   } FR_MBDSR_16B_tag;

   typedef union {   /* MESS. BUFFER SEG. SIZE & UTILISATION REG */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  LAST_MB_SEG1:6;    /* LAST MESS BUFFER IN SEG 1 */
         uint16_t:2;
         uint16_t  LAST_MB_UTIL:6;    /* LAST MESSAGE BUFFER UTILISED */
      } B;
   } FR_MBSSUTR_16B_tag;

   typedef union {   /* PE DRAM ACCESS REGISTER */
      uint16_t R;
      struct {
         uint16_t  INST:4;            /* PE DRAM ACCESS INSTRUCTION */
         uint16_t  ADDR:11;           /* PE DRAM ACCESS ADDRESS */
         uint16_t  DAD:1;             /* PE DRAM ACCESS DONE */
      } B;
   } FR_PEDRAR_16B_tag;

   typedef union {   /* PE DRAM DATA REGISTER */
      uint16_t R;
      struct {
         uint16_t  DATA:16;           /* DATA TO BE READ OR WRITTEN */
      } B;
   } FR_PEDRDR_16B_tag;

   typedef union {   /* PROTOCOL OPERATION CONTROL REG */
      uint16_t R;
      struct {
         uint16_t  WME:1;             /* WRITE MODE EXTERNAL CORRECTION */
         uint16_t:3;
         uint16_t  EOC_AP:2;          /* EXTERNAL OFFSET CORRECTION APPLICATION */
         uint16_t  ERC_AP:2;          /* EXTERNAL RATE CORRECTION APPLICATION */
         uint16_t  BSY:1;             /* PROTOCOL CONTROL COMMAND WRITE BUSY */
         uint16_t:3;
         uint16_t  POCCMD:4;          /* PROTOCOL CONTROL COMMAND */
      } B;
   } FR_POCR_16B_tag;

   typedef union {   /* GLOBAL INTERRUPT FLAG & ENABLE REG */
      uint16_t R;
      struct {
         uint16_t  MIF:1;             /* MODULE INTERRUPT FLAG */
         uint16_t  PRIF:1;            /* PROTOCOL INTERRUPT FLAG */
         uint16_t  CHIF:1;            /* CHI INTERRUPT FLAG */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  WUPIF:1;           /* WAKEUP INTERRUPT FLAG */
#else
         uint16_t  WKUPIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FAFBIF:1;          /* RECEIVE FIFO CHANNEL B ALMOST FULL INTERRUPT FLAG */
#else
         uint16_t  FNEBIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FAFAIF:1;          /* RECEIVE FIFO CHANNEL A ALMOST FULL INTERRUPT FLAG */
#else
         uint16_t  FNEAIF:1;            /* deprecated name - please avoid */
#endif
         uint16_t  RBIF:1;            /* RECEIVE MESSAGE BUFFER INTERRUPT FLAG */
         uint16_t  TBIF:1;            /* TRANSMIT BUFFER INTERRUPT FLAG */
         uint16_t  MIE:1;             /* MODULE INTERRUPT ENABLE */
         uint16_t  PRIE:1;            /* PROTOCOL INTERRUPT ENABLE */
         uint16_t  CHIE:1;            /* CHI INTERRUPT ENABLE */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  WUPIE:1;           /* WAKEUP INTERRUPT ENABLE */
#else
         uint16_t  WKUPIE:1;            /* deprecated name - please avoid */
#endif
         uint16_t  FNEBIE:1;          /* RECEIVE FIFO CHANNEL B NOT EMPTY INTERRUPT ENABLE */
         uint16_t  FNEAIE:1;          /* RECEIVE FIFO CHANNEL A NOT EMPTY INTERRUPT ENABLE */
         uint16_t  RBIE:1;            /* RECEIVE BUFFER INTERRUPT ENABLE */
         uint16_t  TBIE:1;            /* TRANSMIT BUFFER INTERRUPT ENABLE */
      } B;
   } FR_GIFER_16B_tag;

