RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* PROTOCOL INTERRUPT FLAG REGISTER 0 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FATL_IF:1;         /* FATAL PROTOCOL ERROR INTERRUPT FLAG */
#else
         uint16_t  FATLIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  INTL_IF:1;         /* INTERNAL PROTOCOL ERROR INTERRUPT FLAG */
#else
         uint16_t  INTLIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  ILCF_IF:1;         /* ILLEGAL PROTOCOL CONFIGURATION INTERRUPT FLAG */
#else
         uint16_t  ILCFIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CSA_IF:1;          /* COLDSTART ABORT INTERRUPT FLAG */
#else
         uint16_t  CSAIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MRC_IF:1;          /* MISSING RATE CORRECTION INTERRUPT FLAG */
#else
         uint16_t  MRCIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MOC_IF:1;          /* MISSING OFFSET CORRECTION INTERRUPT FLAG */
#else
         uint16_t  MOCIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CCL_IF:1;          /* CLOCK CORRECTION LIMIT REACHED INTERRUPT FLAG */
#else
         uint16_t  CCLIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MXS_IF:1;          /* MAX SYNC FRAMES DETECTED INTERRUPT FLAG */
#else
         uint16_t  MXSIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MTX_IF:1;          /* MEDIA ACCESS TEST SYMBOL RECEIVED INTERRUPT FLAG */
#else
         uint16_t  MTXIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LTXB_IF:1;         /* pLATESTTX VIOLATION ON CHANNEL B INTERRUPT FLAG */
#else
         uint16_t  LTXBIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LTXA_IF:1;         /* pLATESTTX VIOLATION ON CHANNEL A INTERRUPT FLAG */
#else
         uint16_t  LTXAIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TBVB_IF:1;         /* TRANSMISSION ACROSS BOUNDARY ON CHANNEL B INTERRUPT FLAG */
#else
         uint16_t  TBVBIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TBVA_IF:1;         /* TRANSMISSION ACROSS BOUNDARY ON CHANNEL A INTERRUPT FLAG */
#else
         uint16_t  TBVAIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TI2_IF:1;          /* TIMER 2 EXPIRED INTERRUPT FLAG */
#else
         uint16_t  TI2IF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TI1_IF:1;          /* TIMER 1 EXPIRED INTERRUPT FLAG */
#else
         uint16_t  TI1IF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CYS_IF:1;          /* CYCLE START INTERRUPT FLAG */
#else
         uint16_t  CYSIF:1;             /* deprecated name - please avoid */
#endif
      } B;
   } FR_PIFR0_16B_tag;

   typedef union {   /* PROTOCOL INTERRUPT FLAG REGISTER 1 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  EMC_IF:1;          /* ERROR MODE CHANGED INTERRUPT FLAG */
#else
         uint16_t  EMCIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  IPC_IF:1;          /* ILLEGAL PROTOCOL CONTROL COMMAND INTERRUPT FLAG */
#else
         uint16_t  IPCIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  PECF_IF:1;         /* PROTOCOL ENGINE COMMUNICATION FAILURE INTERRUPT FLAG */
#else
         uint16_t  PECFIF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  PSC_IF:1;          /* PROTOCOL STATE CHANGED INTERRUPT FLAG */
#else
         uint16_t  PSCIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SSI3_IF:1;         /* SLOT STATUS COUNTER 3 INCREMENTED INTERRUPT FLAG */
#else
         uint16_t  SSI3IF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SSI2_IF:1;         /* SLOT STATUS COUNTER 2 INCREMENTED INTERRUPT FLAG */
#else
         uint16_t  SSI2IF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SSI1_IF:1;         /* SLOT STATUS COUNTER 1 INCREMENTED INTERRUPT FLAG */
#else
         uint16_t  SSI1IF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SSI0_IF:1;         /* SLOT STATUS COUNTER 0 INCREMENTED INTERRUPT FLAG */
#else
         uint16_t  SSI0IF:1;            /* deprecated name - please avoid */
#endif
         uint16_t:2;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  EVT_IF:1;          /* EVEN CYCLE TABLE WRITTEN INTERRUPT FLAG */
#else
         uint16_t  EVTIF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  ODT_IF:1;          /* ODD CYCLE TABLE WRITTEN INTERRUPT FLAG */
#else
         uint16_t  ODTIF:1;             /* deprecated name - please avoid */
#endif
         uint16_t:4;
      } B;
   } FR_PIFR1_16B_tag;

   typedef union {   /* PROTOCOL INTERRUPT ENABLE REGISTER 0 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FATL_IE:1;         /* FATAL PROTOCOL ERROR INTERRUPT ENABLE */
#else
         uint16_t  FATLIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  INTL_IE:1;         /* INTERNAL PROTOCOL ERROR INTERRUPT ENABLE */
#else
         uint16_t  INTLIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  ILCF_IE:1;         /* ILLEGAL PROTOCOL CONFIGURATION INTERRUPT ENABLE */
#else
         uint16_t  ILCFIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CSA_IE:1;          /* COLDSTART ABORT INTERRUPT ENABLE */
#else
         uint16_t  CSAIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MRC_IE:1;          /* MISSING RATE CORRECTION INTERRUPT ENABLE */
#else
         uint16_t  MRCIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MOC_IE:1;          /* MISSING OFFSET CORRECTION INTERRUPT ENABLE */
#else
         uint16_t  MOCIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CCL_IE:1;          /* CLOCK CORRECTION LIMIT REACHED */
#else
         uint16_t  CCLIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MXS_IE:1;          /* MAX SYNC FRAMES DETECTED INTERRUPT ENABLE */
#else
         uint16_t  MXSIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MTX_IE:1;          /* MEDIA ACCESS TEST SYMBOL RECEIVED INTERRUPT ENABLE */
#else
         uint16_t  MTXIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LTXB_IE:1;         /* pLATESTTX VIOLATION ON CHANNEL B INTERRUPT ENABLE */
#else
         uint16_t  LTXBIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LTXA_IE:1;         /* pLATESTTX VIOLATION ON CHANNEL A INTERRUPT ENABLE */
#else
         uint16_t  LTXAIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TBVB_IE:1;         /* TRANSMISSION ACROSS BOUNDARY ON CHANNEL B INTERRUPT ENABLE */
#else
         uint16_t  TBVBIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TBVA_IE:1;         /* TRANSMISSION ACROSS BOUNDARY ON CHANNEL A INTERRUPT ENABLE */
#else
         uint16_t  TBVAIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TI2_IE:1;          /* TIMER 2 EXPIRED INTERRUPT ENABLE */
#else
         uint16_t  TI2IE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TI1_IE:1;          /* TIMER 1 EXPIRED INTERRUPT ENABLE */
#else
         uint16_t  TI1IE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CYS_IE:1;          /* CYCLE START INTERRUPT ENABLE */
#else
         uint16_t  CYSIE:1;             /* deprecated name - please avoid */
#endif
      } B;
   } FR_PIER0_16B_tag;

   typedef union {   /* PROTOCOL INTERRUPT ENABLE REGISTER 1 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  EMC_IE:1;          /* ERROR MODE CHANGED INTERRUPT Enable */
#else
         uint16_t  EMCIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  IPC_IE:1;          /* ILLEGAL PROTOCOL CONTROL COMMAND INTERRUPT Enable */
#else
         uint16_t  IPCIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  PECF_IE:1;         /* PROTOCOL ENGINE COMMUNICATION FAILURE INTERRUPT Enable */
#else
         uint16_t  PECFIE:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  PSC_IE:1;          /* PROTOCOL STATE CHANGED INTERRUPT Enable */
#else
         uint16_t  PSCIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SSI_3_0_IE:4;      /* SLOT STATUS COUNTER INCREMENTED INTERRUPT Enable */
#else
         uint16_t  SSI3IE:1;
         uint16_t  SSI2IE:1;
         uint16_t  SSI1IE:1;
         uint16_t  SSI0IE:1;
#endif
         
         uint16_t:2;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  EVT_IE:1;          /* EVEN CYCLE TABLE WRITTEN INTERRUPT Enable */
#else
         uint16_t  EVTIE:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  ODT_IE:1;          /* ODD CYCLE TABLE WRITTEN INTERRUPT Enable */
#else
         uint16_t  ODTIE:1;             /* deprecated name - please avoid */
#endif
         uint16_t:4;
      } B;
   } FR_PIER1_16B_tag;

   typedef union {   /* CHI ERROR FLAG REGISTER */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FRLB_EF:1;         /* FRAME LOST CHANNEL B ERROR FLAG */
#else
         uint16_t  FRLBEF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FRLA_EF:1;         /* FRAME LOST CHANNEL A ERROR FLAG */
#else
         uint16_t  FRLAEF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  PCMI_EF:1;         /* PROTOCOL COMMAND IGNORED ERROR FLAG */
#else
         uint16_t  PCMIEF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FOVB_EF:1;         /* RECEIVE FIFO OVERRUN CHANNEL B ERROR FLAG */
#else
         uint16_t  FOVBEF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FOVA_EF:1;         /* RECEIVE FIFO OVERRUN CHANNEL A ERROR FLAG */
#else
         uint16_t  FOVAEF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MBS_EF:1;          /* MESSAGE BUFFER SEARCH ERROR FLAG */
#else
         uint16_t  MSBEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MBU_EF:1;          /* MESSAGE BUFFER UTILIZATION ERROR FLAG */
#else
         uint16_t  MBUEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LCK_EF:1;          /* LOCK ERROR FLAG */
#else
         uint16_t  LCKEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  DBL_EF:1;          /* DOUBLE TRANSMIT MESSAGE BUFFER LOCK ERROR FLAG */
#else
         uint16_t  DBLEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SBCF_EF:1;         /* SYSTEM BUS COMMUNICATION FAILURE ERROR FLAG */
#else
         uint16_t  SBCFEF:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FID_EF:1;          /* FRAME ID ERROR FLAG */
#else
         uint16_t  FIDEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  DPL_EF:1;          /* DYNAMIC PAYLOAD LENGTH ERROR FLAG */
#else
         uint16_t  DPLEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SPL_EF:1;          /* STATIC PAYLOAD LENGTH ERROR FLAG */
#else
         uint16_t  SPLEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  NML_EF:1;          /* NETWORK MANAGEMENT LENGTH ERROR FLAG */
#else
         uint16_t  NMLEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  NMF_EF:1;          /* NETWORK MANAGEMENT FRAME ERROR FLAG */
#else
         uint16_t  NMFEF:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  ILSA_EF:1;         /* ILLEGAL SYSTEM MEMORY ACCESS ERROR FLAG */
#else
         uint16_t  ILSAEF:1;            /* deprecated name - please avoid */
#endif
      } B;
   } FR_CHIERFR_16B_tag;

   typedef union {   /* Message Buffer Interrupt Vector Register */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  TBIVEC:6;          /* Transmit Buffer Interrupt Vector */
         uint16_t:2;
         uint16_t  RBIVEC:6;          /* Receive Buffer Interrupt Vector */
      } B;
   } FR_MBIVEC_16B_tag;

   typedef union {   /* Channel A Status Error Counter Register */
      uint16_t R;
      struct {
         uint16_t  STATUS_ERR_CNT:16;   /* Channel Status Error Counter */
      } B;
   } FR_CASERCR_16B_tag;

   typedef union {   /* Channel B Status Error Counter Register */
      uint16_t R;
      struct {
         uint16_t  STATUS_ERR_CNT:16;   /* Channel Status Error Counter */
      } B;
   } FR_CBSERCR_16B_tag;

   typedef union {   /* Protocol Status Register 0 */
      uint16_t R;
      struct {
         uint16_t  ERRMODE:2;         /* Error Mode */
         uint16_t  SLOTMODE:2;        /* Slot Mode */
         uint16_t:1;
         uint16_t  PROTSTATE:3;       /* Protocol State */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  STARTUPSTATE:4;    /* Startup State */
#else
         uint16_t  SUBSTATE:4;          /* deprecated name - please avoid */
#endif
         uint16_t  WAKEUPSTATE:4;     /* Wakeup Status */
      } B;
   } FR_PSR0_16B_tag;

   typedef union {   /* Protocol Status Register 1 */
      uint16_t R;
      struct {
         uint16_t  CSAA:1;            /* Coldstart Attempt Aborted Flag */
         uint16_t  CSP:1;             /* Leading Coldstart Path */
         uint16_t:1;
         uint16_t  REMCSAT:5;         /* Remaining Coldstart Attempts */
         uint16_t  CPN:1;             /* Leading Coldstart Path Noise */
         uint16_t  HHR:1;             /* Host Halt Request Pending */
         uint16_t  FRZ:1;             /* Freeze Occurred */
         uint16_t  APTAC:5;           /* Allow Passive to Active Counter */
      } B;
   } FR_PSR1_16B_tag;

