RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Protocol Status Register 2 */
      uint16_t R;
      struct {
         uint16_t  NBVB:1;            /* NIT Boundary Violation on Channel B */
         uint16_t  NSEB:1;            /* NIT Syntax Error on Channel B */
         uint16_t  STCB:1;            /* Symbol Window Transmit Conflict on Channel B */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SSVB:1;            /* Symbol Window Boundary Violation on Channel B */
#else
         uint16_t  SBVB:1;              /* deprecated name - please avoid */
#endif
         uint16_t  SSEB:1;            /* Symbol Window Syntax Error on Channel B */
         uint16_t  MTB:1;             /* Media Access Test Symbol MTS Received on Channel B */
         uint16_t  NBVA:1;            /* NIT Boundary Violation on Channel A */
         uint16_t  NSEA:1;            /* NIT Syntax Error on Channel A */
         uint16_t  STCA:1;            /* Symbol Window Transmit Conflict on Channel A */
         uint16_t  SBVA:1;            /* Symbol Window Boundary Violation on Channel A */
         uint16_t  SSEA:1;            /* Symbol Window Syntax Error on Channel A */
         uint16_t  MTA:1;             /* Media Access Test Symbol MTS Received on Channel A */
         uint16_t  CLKCORRFAILCNT:4;   /* Clock Correction Failed Counter */
      } B;
   } FR_PSR2_16B_tag;

   typedef union {   /* Protocol Status Register 3 */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  WUB:1;             /* Wakeup Symbol Received on Channel B */
         uint16_t  ABVB:1;            /* Aggregated Boundary Violation on Channel B */
         uint16_t  AACB:1;            /* Aggregated Additional Communication on Channel B */
         uint16_t  ACEB:1;            /* Aggregated Content Error on Channel B */
         uint16_t  ASEB:1;            /* Aggregated Syntax Error on Channel B */
         uint16_t  AVFB:1;            /* Aggregated Valid Frame on Channel B */
         uint16_t:2;
         uint16_t  WUA:1;             /* Wakeup Symbol Received on Channel A */
         uint16_t  ABVA:1;            /* Aggregated Boundary Violation on Channel A */
         uint16_t  AACA:1;            /* Aggregated Additional Communication on Channel A */
         uint16_t  ACEA:1;            /* Aggregated Content Error on Channel A */
         uint16_t  ASEA:1;            /* Aggregated Syntax Error on Channel A */
         uint16_t  AVFA:1;            /* Aggregated Valid Frame on Channel A */
      } B;
   } FR_PSR3_16B_tag;

   typedef union {   /* Macrotick Counter Register */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  MTCT:14;           /* Macrotick Counter */
      } B;
   } FR_MTCTR_16B_tag;

   typedef union {   /* Cycle Counter Register */
      uint16_t R;
      struct {
         uint16_t:10;
         uint16_t  CYCCNT:6;          /* Cycle Counter */
      } B;
   } FR_CYCTR_16B_tag;

   typedef union {   /* Slot Counter Channel A Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  SLOTCNTA:11;       /* Slot Counter Value for Channel A */
      } B;
   } FR_SLTCTAR_16B_tag;

   typedef union {   /* Slot Counter Channel B Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  SLOTCNTB:11;       /* Slot Counter Value for Channel B */
      } B;
   } FR_SLTCTBR_16B_tag;

   typedef union {   /* Rate Correction Value Register */
      uint16_t R;
      struct {
         uint16_t  RATECORR:16;       /* Rate Correction Value */
      } B;
   } FR_RTCORVR_16B_tag;

   typedef union {   /* Offset Correction Value Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  OFFSETCORR:10;     /* Offset Correction Value */
      } B;
   } FR_OFCORVR_16B_tag;

   typedef union {   /* Combined Interrupt Flag Register */
      uint16_t R;
      struct {
         uint16_t:8;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MIF:1;             /* Module Interrupt Flag */
#else
         uint16_t  MIFR:1;              /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  PRIF:1;            /* Protocol Interrupt Flag */
#else
         uint16_t  PRIFR:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CHIF:1;            /* CHI Interrupt Flag */
#else
         uint16_t  CHIFR:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  WUPIF:1;           /* Wakeup Interrupt Flag */
#else
         uint16_t  WUPIFR:1;            /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FAFBIF:1;          /* Receive FIFO channel B Almost Full Interrupt Flag */
#else
         uint16_t  FNEBIFR:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FAFAIF:1;          /* Receive FIFO channel A Almost Full Interrupt Flag */
#else
         uint16_t  FNEAIFR:1;           /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  RBIF:1;            /* Receive Message Buffer Interrupt Flag */
#else
         uint16_t  RBIFR:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  TBIF:1;            /* Transmit Message Buffer Interrupt Flag */
#else
         uint16_t  TBIFR:1;             /* deprecated name - please avoid */
#endif
      } B;
   } FR_CIFR_16B_tag;

   typedef union {   /* System Memory Access Time-Out Register */
      uint16_t R;
      struct {
         uint16_t:8;
         uint16_t  TIMEOUT:8;         /* Time-Out */
      } B;
   } FR_SYMATOR_16B_tag;

   typedef union {   /* Sync Frame Counter Register */
      uint16_t R;
      struct {
         uint16_t  SFEVB:4;           /* Sync Frames Channel B, even cycle */
         uint16_t  SFEVA:4;           /* Sync Frames Channel A, even cycle */
         uint16_t  SFODB:4;           /* Sync Frames Channel B, odd cycle */
         uint16_t  SFODA:4;           /* Sync Frames Channel A, odd cycle */
      } B;
   } FR_SFCNTR_16B_tag;

