RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Sync Frame Table Offset Register */
      uint16_t R;
      struct {
         uint16_t  SFT_OFFSET_15_1:15;   /* Sync Frame Table Offset */
         uint16_t:1;
      } B;
   } FR_SFTOR_16B_tag;

   typedef union {   /* Sync Frame Table Configuration, Control, Status Register */
      uint16_t R;
      struct {
         uint16_t  ELKT:1;            /* Even Cycle Tables Lock/Unlock Trigger */
         uint16_t  OLKT:1;            /* Odd Cycle Tables Lock/Unlock Trigger */
         uint16_t  CYCNUM:6;          /* Cycle Number */
         uint16_t  ELKS:1;            /* Even Cycle Tables Lock Status */
         uint16_t  OLKS:1;            /* Odd Cycle Tables Lock Status */
         uint16_t  EVAL:1;            /* Even Cycle Tables Valid */
         uint16_t  OVAL:1;            /* Odd Cycle Tables Valid */
         uint16_t:1;
         uint16_t  OPT:1;             /* One Pair Trigger */
         uint16_t  SDVEN:1;           /* Sync Frame Deviation Table Enable */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  SIVEN:1;           /* Sync Frame ID Table Enable */
#else
         uint16_t  SIDEN:1;             /* deprecated name - please avoid */
#endif
      } B;
   } FR_SFTCCSR_16B_tag;

   typedef union {   /* Sync Frame ID Rejection Filter */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  SYNFRID:10;        /* Sync Frame Rejection ID */
      } B;
   } FR_SFIDRFR_16B_tag;

   typedef union {   /* Sync Frame ID Acceptance Filter Value Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  FVAL:10;           /* Filter Value */
      } B;
   } FR_SFIDAFVR_16B_tag;

   typedef union {   /* Sync Frame ID Acceptance Filter Mask Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  FMSK:10;           /* Filter Mask */
      } B;
   } FR_SFIDAFMR_16B_tag;

   typedef union {   /* Network Management Vector Register0 */
      uint16_t R;
      struct {
         uint16_t  NMVP_15_8:8;       /* Network Management Vector Part */
         uint16_t  NMVP_7_0:8;        /* Network Management Vector Part */
      } B;
   } FR_NMVR0_16B_tag;

   typedef union {   /* Network Management Vector Register1 */
      uint16_t R;
      struct {
         uint16_t  NMVP_15_8:8;       /* Network Management Vector Part */
         uint16_t  NMVP_7_0:8;        /* Network Management Vector Part */
      } B;
   } FR_NMVR1_16B_tag;

   typedef union {   /* Network Management Vector Register2 */
      uint16_t R;
      struct {
         uint16_t  NMVP_15_8:8;       /* Network Management Vector Part */
         uint16_t  NMVP_7_0:8;        /* Network Management Vector Part */
      } B;
   } FR_NMVR2_16B_tag;

   typedef union {   /* Network Management Vector Register3 */
      uint16_t R;
      struct {
         uint16_t  NMVP_15_8:8;       /* Network Management Vector Part */
         uint16_t  NMVP_7_0:8;        /* Network Management Vector Part */
      } B;
   } FR_NMVR3_16B_tag;

   typedef union {   /* Network Management Vector Register4 */
      uint16_t R;
      struct {
         uint16_t  NMVP_15_8:8;       /* Network Management Vector Part */
         uint16_t  NMVP_7_0:8;        /* Network Management Vector Part */
      } B;
   } FR_NMVR4_16B_tag;

   typedef union {   /* Network Management Vector Register5 */
      uint16_t R;
      struct {
         uint16_t  NMVP_15_8:8;       /* Network Management Vector Part */
         uint16_t  NMVP_7_0:8;        /* Network Management Vector Part */
      } B;
   } FR_NMVR5_16B_tag;

   typedef union {   /* Network Management Vector Length Register */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  NMVL:4;            /* Network Management Vector Length */
      } B;
   } FR_NMVLR_16B_tag;

   typedef union {   /* Timer Configuration and Control Register */
      uint16_t R;
      struct {
         uint16_t:2;
#ifndef USE_FIELD_ALIASES_FR		 
         uint16_t  T2_CFG:1;          /* Timer T2 Configuration */
#else
         uint16_t  T2CFG:1;          /* Timer T2 Configuration */
#endif		
#ifndef USE_FIELD_ALIASES_FR	 
         uint16_t  T2_REP:1;          /* Timer T2 Repetitive Mode */
#else
         uint16_t  T2REP:1;          /* Timer T2 Configuration */
#endif	
         uint16_t:1;
         uint16_t  T2SP:1;            /* Timer T2 Stop */
         uint16_t  T2TR:1;            /* Timer T2 Trigger */
         uint16_t  T2ST:1;            /* Timer T2 State */
         uint16_t:3;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  T1_REP:1;          /* Timer T1 Repetitive Mode */
#else
         uint16_t  T1REP:1;          
#endif	
         uint16_t:1;
         uint16_t  T1SP:1;            /* Timer T1 Stop */
         uint16_t  T1TR:1;            /* Timer T1 Trigger */
         uint16_t  T1ST:1;            /* Timer T1 State */
      } B;
   } FR_TICCR_16B_tag;

   typedef union {   /* Timer 1 Cycle Set Register */
      uint16_t R;
      struct {
         uint16_t:2;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  T1_CYC_VAL:6;      /* Timer T1 Cycle Filter Value */
#else
         uint16_t  TI1CYCVAL:1;        /* Timer T1 Cycle Filter Value */       
#endif	
         uint16_t:2;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  T1_CYC_MSK:6;      /* Timer T1 Cycle Filter Mask */
#else
         uint16_t  TI1CYCMSK:1;      /* Timer T1 Cycle Filter Mask */
#endif	
      } B;
   } FR_TI1CYSR_16B_tag;

   typedef union {   /* Timer 1 Macrotick Offset Register */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  T1_MTOFFSET:14;    /* Timer 1 Macrotick Offset */
      } B;
   } FR_TI1MTOR_16B_tag;

   typedef union {   /* Timer 2 Configuration Register 0 */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  T2_CYC_VAL:6;      /* Timer T2 Cycle Filter Value */
         uint16_t:2;
         uint16_t  T2_CYC_MSK:6;      /* Timer T2 Cycle Filter Mask */
      } B;
   } FR_TI2CR0_16B_tag;

   typedef union {   /* Timer 2 Configuration Register 1 */
      uint16_t R;
      struct {
         uint16_t  T2_MTCNT:16;       /* Timer T2 Macrotick Offset */
      } B;
   } FR_TI2CR1_16B_tag;

   typedef union {   /* Slot Status Selection Register */
      uint16_t R;
      struct {
         uint16_t  WMD:1;             /* Write Mode */
         uint16_t:1;
         uint16_t  SEL:2;             /* Selector */
         uint16_t:1;
         uint16_t  SLOTNUMBER:11;     /* Slot Number */
      } B;
   } FR_SSSR_16B_tag;

   typedef union {   /* Slot Status Counter Condition Register */
      uint16_t R;
      struct {
         uint16_t  WMD:1;             /* Write Mode */
         uint16_t:1;
         uint16_t  SEL:2;             /* Selector */
         uint16_t:1;
         uint16_t  CNTCFG:2;          /* Counter Configuration */
         uint16_t  MCY:1;             /* Multi Cycle Selection */
         uint16_t  VFR:1;             /* Valid Frame Restriction */
         uint16_t  SYF:1;             /* Sync Frame Restriction */
         uint16_t  NUF:1;             /* Null Frame Restriction */
         uint16_t  SUF:1;             /* Startup Frame Restriction */
         uint16_t  STATUSMASK:4;      /* Slot Status Mask */
      } B;
   } FR_SSCCR_16B_tag;

