RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Slot Status Register0 */
      uint16_t R;
      struct {
         uint16_t  VFB:1;             /* Valid Frame on Channel B */
         uint16_t  SYB:1;             /* Sync Frame Indicator Channel B */
         uint16_t  NFB:1;             /* Null Frame Indicator Channel B */
         uint16_t  SUB:1;             /* Startup Frame Indicator Channel B */
         uint16_t  SEB:1;             /* Syntax Error on Channel B */
         uint16_t  CEB:1;             /* Content Error on Channel B */
         uint16_t  BVB:1;             /* Boundary Violation on Channel B */
         uint16_t  TCB:1;             /* Transmission Conflict on Channel B */
         uint16_t  VFA:1;             /* Valid Frame on Channel A */
         uint16_t  SYA:1;             /* Sync Frame Indicator Channel A */
         uint16_t  NFA:1;             /* Null Frame Indicator Channel A */
         uint16_t  SUA:1;             /* Startup Frame Indicator Channel A */
         uint16_t  SEA:1;             /* Syntax Error on Channel A */
         uint16_t  CEA:1;             /* Content Error on Channel A */
         uint16_t  BVA:1;             /* Boundary Violation on Channel A */
         uint16_t  TCA:1;             /* Transmission Conflict on Channel A */
      } B;
   } FR_SSR_16B_tag;

   

   typedef union {   /* Slot Status Counter Register0 */
      uint16_t R;
      struct {
         uint16_t  SLOTSTSTUSCNT:16;   /* Slot Status Counter */
      } B;
   } FR_SSCR0_16B_tag;

   typedef union {   /* Slot Status Counter Register1 */
      uint16_t R;
      struct {
         uint16_t  SLOTSTSTUSCNT:16;   /* Slot Status Counter */
      } B;
   } FR_SSCR1_16B_tag;

   typedef union {   /* Slot Status Counter Register2 */
      uint16_t R;
      struct {
         uint16_t  SLOTSTSTUSCNT:16;   /* Slot Status Counter */
      } B;
   } FR_SSCR2_16B_tag;

   typedef union {   /* Slot Status Counter Register3 */
      uint16_t R;
      struct {
         uint16_t  SLOTSTSTUSCNT:16;   /* Slot Status Counter */
      } B;
   } FR_SSCR3_16B_tag;

   typedef union {   /* MTS A Configuration Register */
      uint16_t R;
      struct {
         uint16_t  MTE:1;             /* Media Access Test Symbol Transmission Enable */
         uint16_t:1;
         uint16_t  CYCCNTMSK:6;       /* Cycle Counter Mask */
         uint16_t:2;
         uint16_t  CYCCNTVAL:6;       /* Cycle Counter Value */
      } B;
   } FR_MTSACFR_16B_tag;

   typedef union {   /* MTS B Configuration Register */
      uint16_t R;
      struct {
         uint16_t  MTE:1;             /* Media Access Test Symbol Transmission Enable */
         uint16_t:1;
         uint16_t  CYCCNTMSK:6;       /* Cycle Counter Mask */
         uint16_t:2;
         uint16_t  CYCCNTVAL:6;       /* Cycle Counter Value */
      } B;
   } FR_MTSBCFR_16B_tag;

   typedef union {   /* Receive Shadow Buffer Index Register */
      uint16_t R;
      struct {
         uint16_t  WMD:1;             /* Write Mode */
         uint16_t:1;
         uint16_t  SEL:2;             /* Selector */
         uint16_t:5;
         uint16_t  RSBIDX:7;          /* Receive Shadow Buffer Index */
      } B;
   } FR_RSBIR_16B_tag;

   typedef union {   /* Receive FIFO Watermark and Selection Register */
      uint16_t R;
      struct {
         uint16_t  WM:8;              /* Watermark Value */
         uint16_t:7;
         uint16_t  SEL:1;             /* Select */
      } B;
   } FR_RFWMSR_16B_tag;

   typedef union {   /* Receive FIFO Start Index Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  SIDX:10;           /* Start Index */
      } B;
   } FR_RF_RFSIR_16B_tag;

   typedef union {   /* Receive FIFO Depth and Size Register */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  FIFO_DEPTH:8;      /* FIFO Depth */
#else
         uint16_t  FIFODEPTH:8;         /* deprecated name - please avoid */
#endif
         uint16_t:1;
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  ENTRY_SIZE:7;      /* Entry Size */
#else
         uint16_t  ENTRYSIZE:7;         /* deprecated name - please avoid */
#endif
      } B;
   } FR_RFDSR_16B_tag;

   typedef union {   /* Receive FIFO A Read Index Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  RDIDX:10;          /* Read Index */
      } B;
   } FR_RFARIR_16B_tag;

   typedef union {   /* Receive FIFO B Read Index Register */
      uint16_t R;
      struct {
         uint16_t:6;
         uint16_t  RDIDX:10;          /* Read Index */
      } B;
   } FR_RFBRIR_16B_tag;

   typedef union {   /* Receive FIFO Message ID Acceptance Filter Value Register */
      uint16_t R;
      struct {
         uint16_t  MIDAFVAL:16;       /* Message ID Acceptance Filter Value */
      } B;
   } FR_RFMIDAFVR_16B_tag;

   typedef union {   /* Receive FIFO Message ID Acceptance Filter Mask Register */
      uint16_t R;
      struct {
         uint16_t  MIDAFMSK:16;       /* Message ID Acceptance Filter Mask */
      } B;
   } FR_RFMIDAFMR_16B_tag;

   typedef union {   /* Receive FIFO Frame ID Rejection Filter Value Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  FIDRFVAL:11;       /* Frame ID Rejection Filter Value */
      } B;
   } FR_RFFIDRFVR_16B_tag;

   typedef union {   /* Receive FIFO Frame ID Rejection Filter Mask Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  FIDRFMSK:11;       /* Frame ID Rejection Filter Mask */
      } B;
   } FR_RFFIDRFMR_16B_tag;

   typedef union {   /* Receive FIFO Range Filter Configuration Register */
      uint16_t R;
      struct {
         uint16_t  WMD:1;             /* Write Mode */
         uint16_t  IBD:1;             /* Interval Boundary */
         uint16_t  SEL:2;             /* Filter Selector */
         uint16_t:1;
         uint16_t  SID:11;            /* Slot ID */
      } B;
   } FR_RFRFCFR_16B_tag;

   typedef union {   /* Receive FIFO Range Filter Control Register */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  F3MD:1;            /* Range Filter 3 Mode */
         uint16_t  F2MD:1;            /* Range Filter 2 Mode */
         uint16_t  F1MD:1;            /* Range Filter 1 Mode */
         uint16_t  F0MD:1;            /* Range Filter 0 Mode */
         uint16_t:4;
         uint16_t  F3EN:1;            /* Range Filter 3 Enable */
         uint16_t  F2EN:1;            /* Range Filter 2 Enable */
         uint16_t  F1EN:1;            /* Range Filter 1 Enable */
         uint16_t  F0EN:1;            /* Range Filter 0 Enable */
      } B;
   } FR_RFRFCTR_16B_tag;

   typedef union {   /* Last Dynamic Transmit Slot Channel A Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  LASTDYNTXSLOTA:11;   /* Last Dynamic Transmission Slot Channel A */
      } B;
   } FR_LDTXSLAR_16B_tag;

   typedef union {   /* Last Dynamic Transmit Slot Channel B Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  LASTDYNTXSLOTB:11;   /* Last Dynamic Transmission Slot Channel B */
      } B;
   } FR_LDTXSLBR_16B_tag;

   typedef union {   /* Protocol Configuration Register 0 */
      uint16_t R;
      struct {
         uint16_t  ACTION_POINT_OFFSET:6;   /* gdActionPointOffset - 1 */
         uint16_t  STATIC_SLOT_LENGTH:10;   /* gdStaticSlot */
      } B;
   } FR_PCR0_16B_tag;

