RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Protocol Configuration Register 1 */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  MACRO_AFTER_FIRST_STATIC_SLOT:14;   /* gMacroPerCycle - gdStaticSlot */
      } B;
   } FR_PCR1_16B_tag;

   typedef union {   /* Protocol Configuration Register 2 */
      uint16_t R;
      struct {
         uint16_t  MINISLOT_AFTER_ACTION_POINT:6;   /* gdMinislot - gdMinislotActionPointOffset - 1 */
         uint16_t  NUMBER_OF_STATIC_SLOTS:10;   /* gNumberOfStaticSlots */
      } B;
   } FR_PCR2_16B_tag;

   typedef union {   /* Protocol Configuration Register 3 */
      uint16_t R;
      struct {
         uint16_t  WAKEUP_SYMBOL_RX_LOW:6;   /* gdWakeupSymbolRxLow */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MINISLOT_ACTION_POINT_OFFSET_4_0:5;   /* gdMinislotActionPointOffset - 1 */
#else
         uint16_t  MINISLOT_ACTION_POINT_OFFSET:5;     /* deprecated name - please avoid */
#endif
         uint16_t  COLDSTART_ATTEMPTS:5;   /* gColdstartAttempts */
      } B;
   } FR_PCR3_16B_tag;

   typedef union {   /* Protocol Configuration Register 4 */
      uint16_t R;
      struct {
         uint16_t  CAS_RX_LOW_MAX:7;   /* gdCASRxLowMax - 1 */
         uint16_t  WAKEUP_SYMBOL_RX_WINDOW:9;   /* gdWakeupSymbolRxWindow */
      } B;
   } FR_PCR4_16B_tag;

   typedef union {   /* Protocol Configuration Register 5 */
      uint16_t R;
      struct {
         uint16_t  TSS_TRANSMITTER:4;   /* gdTSSTransmitter */
         uint16_t  WAKEUP_SYMBOL_TX_LOW:6;   /* gdWakeupSymbolTxLow */
         uint16_t  WAKEUP_SYMBOL_RX_IDLE:6;   /* gdWakeupSymbolRxIdle */
      } B;
   } FR_PCR5_16B_tag;

   typedef union {   /* Protocol Configuration Register 6 */
      uint16_t R;
      struct {
         uint16_t:1;
         uint16_t  SYMBOL_WINDOW_AFTER_ACTION_POINT:8;   /* gdSymbolWindow - gdActionPointOffset - 1 */
         uint16_t  MACRO_INITIAL_OFFSET_A:7;   /* pMacroInitialOffset[A] */
      } B;
   } FR_PCR6_16B_tag;

   typedef union {   /* Protocol Configuration Register 7 */
      uint16_t R;
      struct {
         uint16_t  DECODING_CORRECTION_B:9;   /* pDecodingCorrection + pDelayCompensation[B] + 2 */
         uint16_t  MICRO_PER_MACRO_NOM_HALF:7;   /* round(pMicroPerMacroNom / 2) */
      } B;
   } FR_PCR7_16B_tag;

   typedef union {   /* Protocol Configuration Register 8 */
      uint16_t R;
      struct {
         uint16_t  MAX_WITHOUT_CLOCK_CORRECTION_FATAL:4;   /* gMaxWithoutClockCorrectionFatal */
         uint16_t  MAX_WITHOUT_CLOCK_CORRECTION_PASSIVE:4;   /* gMaxWithoutClockCorrectionPassive */
         uint16_t  WAKEUP_SYMBOL_TX_IDLE:8;   /* gdWakeupSymbolTxIdle */
      } B;
   } FR_PCR8_16B_tag;

   typedef union {   /* Protocol Configuration Register 9 */
      uint16_t R;
      struct {
         uint16_t  MINISLOT_EXISTS:1;   /* gNumberOfMinislots!=0 */
         uint16_t  SYMBOL_WINDOW_EXISTS:1;   /* gdSymbolWindow!=0 */
         uint16_t  OFFSET_CORRECTION_OUT:14;   /* pOffsetCorrectionOut */
      } B;
   } FR_PCR9_16B_tag;

   typedef union {   /* Protocol Configuration Register 10 */
      uint16_t R;
      struct {
         uint16_t  SINGLE_SLOT_ENABLED:1;   /* pSingleSlotEnabled */
         uint16_t  WAKEUP_CHANNEL:1;   /* pWakeupChannel */
         uint16_t  MACRO_PER_CYCLE:14;   /* pMicroPerCycle */
      } B;
   } FR_PCR10_16B_tag;

   typedef union {   /* Protocol Configuration Register 11 */
      uint16_t R;
      struct {
         uint16_t  KEY_SLOT_USED_FOR_STARTUP:1;   /* pKeySlotUsedForStartup */
         uint16_t  KEY_SLOT_USED_FOR_SYNC:1;   /* pKeySlotUsedForSync */
         uint16_t  OFFSET_CORRECTION_START:14;   /* gOffsetCorrectionStart */
      } B;
   } FR_PCR11_16B_tag;

   typedef union {   /* Protocol Configuration Register 12 */
      uint16_t R;
      struct {
         uint16_t  ALLOW_PASSIVE_TO_ACTIVE:5;   /* pAllowPassiveToActive */
         uint16_t  KEY_SLOT_HEADER_CRC:11;   /* header CRC for key slot */
      } B;
   } FR_PCR12_16B_tag;

   typedef union {   /* Protocol Configuration Register 13 */
      uint16_t R;
      struct {
         uint16_t  FIRST_MINISLOT_ACTION_POINT_OFFSET:6;   /* max(gdActionPointOffset,gdMinislotActionPointOffset) - 1 */
         uint16_t  STATIC_SLOT_AFTER_ACTION_POINT:10;   /* gdStaticSlot - gdActionPointOffset - 1 */
      } B;
   } FR_PCR13_16B_tag;

   typedef union {   /* Protocol Configuration Register 14 */
      uint16_t R;
      struct {
         uint16_t  RATE_CORRECTION_OUT:11;   /* pRateCorrectionOut */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LISTEN_TIMEOUT_20_16:5;   /* pdListenTimeout - 1 */
#else
         uint16_t  LISTEN_TIMEOUT_H:5;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR14_16B_tag;

   typedef union {   /* Protocol Configuration Register 15 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  LISTEN_TIMEOUT_15_0:16;   /* pdListenTimeout - 1 */
#else
         uint16_t  LISTEN_TIMEOUT_L:16;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR15_16B_tag;

   typedef union {   /* Protocol Configuration Register 16 */
      uint16_t R;
      struct {
         uint16_t  MACRO_INITIAL_OFFSET_B:7;   /* pMacroInitialOffset[B] */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  NOISE_LISTEN_TIMEOUT_24_16:9;   /* (gListenNoise * pdListenTimeout) - 1 */
#else
         uint16_t  NOISE_LISTEN_TIMEOUT_H:9;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR16_16B_tag;

   typedef union {   /* Protocol Configuration Register 17 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  NOISE_LISTEN_TIMEOUT_15_0:16;   /* (gListenNoise * pdListenTimeout) - 1 */
#else
         uint16_t  NOISE_LISTEN_TIMEOUT_L:16;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR17_16B_tag;

   typedef union {   /* Protocol Configuration Register 18 */
      uint16_t R;
      struct {
         uint16_t  WAKEUP_PATTERN:6;   /* pWakeupPattern */
         uint16_t  KEY_SLOT_ID:10;    /* pKeySlotId */
      } B;
   } FR_PCR18_16B_tag;

   typedef union {   /* Protocol Configuration Register 19 */
      uint16_t R;
      struct {
         uint16_t  DECODING_CORRECTION_A:9;   /* pDecodingCorrection + pDelayCompensation[A] + 2 */
         uint16_t  PAYLOAD_LENGTH_STATIC:7;   /* gPayloadLengthStatic */
      } B;
   } FR_PCR19_16B_tag;

   typedef union {   /* Protocol Configuration Register 20 */
      uint16_t R;
      struct {
         uint16_t  MICRO_INITIAL_OFFSET_B:8;   /* pMicroInitialOffset[B] */
         uint16_t  MICRO_INITIAL_OFFSET_A:8;   /* pMicroInitialOffset[A] */
      } B;
   } FR_PCR20_16B_tag;

   typedef union {   /* Protocol Configuration Register 21 */
      uint16_t R;
      struct {
         uint16_t  EXTERN_RATE_CORRECTION:3;   /* pExternRateCorrection */
         uint16_t  LATEST_TX:13;      /* gNumberOfMinislots - pLatestTx */
      } B;
   } FR_PCR21_16B_tag;

