RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* Protocol Configuration Register 22 */
      uint16_t R;
      struct {
         uint16_t  R:1;               /* Reserved bit */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  COMP_ACCEPTED_STARRUP_RANGE_A:11;   /* pdAcceptedStartupRange - pDelayCompensationChA */
#else
         uint16_t  COMP_ACCEPTED_STARTUP_RANGE_A:11;     /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MICRO_PER_CYCLE_19_16:4;   /* gMicroPerCycle */
#else
         uint16_t  MICRO_PER_CYCLE_H:4;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR22_16B_tag;

   typedef union {   /* Protocol Configuration Register 23 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MICRO_PER_CYCLE_15_0:16;   /* pMicroPerCycle */
#else
         uint16_t  micro_per_cycle_l:16;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR23_16B_tag;

   typedef union {   /* Protocol Configuration Register 24 */
      uint16_t R;
      struct {
         uint16_t  CLUSTER_DRIFT_DAMPING:5;   /* pClusterDriftDamping */
         uint16_t  MAX_PAYLOAD_LENGTH_DYNAMIC:7;   /* pPayloadLengthDynMax */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MICRO_PER_CYCLE_MIN_19_16:4;   /* pMicroPerCycle - pdMaxDrift */
#else
         uint16_t  MICRO_PER_CYCLE_MIN_H:4;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR24_16B_tag;

   typedef union {   /* Protocol Configuration Register 25 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MICRO_PER_CYCLE_MIN_15_0:16;   /* pMicroPerCycle - pdMaxDrift */
#else
         uint16_t  MICRO_PER_CYCLE_MIN_L:16;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR25_16B_tag;

   typedef union {   /* Protocol Configuration Register 26 */
      uint16_t R;
      struct {
         uint16_t  ALLOW_HALT_DUE_TO_CLOCK:1;   /* pAllowHaltDueToClock */
         uint16_t  COMP_ACCEPTED_STARTUP_RANGE_B:11;   /* pdAcceptedStartupRange - pDelayCompensationChB */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MICRO_PER_CYCLE_MAX_19_16:4;   /* pMicroPerCycle + pdMaxDrift */
#else
         uint16_t  MICRO_PER_CYCLE_MAX_H:4;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR26_16B_tag;

   typedef union {   /* Protocol Configuration Register 27 */
      uint16_t R;
      struct {
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  MICRO_PER_CYCLE_MAX_15_0:16;   /* pMicroPerCycle + pdMaxDrift */
#else
         uint16_t  MICRO_PER_CYCLE_MAX_L:16;     /* deprecated name - please avoid */
#endif
      } B;
   } FR_PCR27_16B_tag;

   typedef union {   /* Protocol Configuration Register 28 */
      uint16_t R;
      struct {
         uint16_t  DYNAMIC_SLOT_IDLE_PHASE:2;   /* gdDynamicSlotIdlePhase */
         uint16_t  MACRO_AFTER_OFFSET_CORRECTION:14;   /* gMacroPerCycle - gOffsetCorrectionStart */
      } B;
   } FR_PCR28_16B_tag;

   typedef union {   /* Protocol Configuration Register 29 */
      uint16_t R;
      struct {
         uint16_t  EXTERN_OFFSET_CORRECTION:3;   /* pExternOffsetCorrection */
         uint16_t  MINISLOTS_MAX:13;   /* gNumberOfMinislots - 1 */
      } B;
   } FR_PCR29_16B_tag;

   typedef union {   /* Protocol Configuration Register 30 */
      uint16_t R;
      struct {
         uint16_t:12;
         uint16_t  SYNC_NODE_MAX:4;   /* gSyncNodeMax */
      } B;
   } FR_PCR30_16B_tag;

   typedef union {   /* Receive FIFO System Memory Base Address High Register */
      uint16_t R;
      struct {
         uint16_t  SMBA_31_16:16;     /* System Memory Base Address */
      } B;
   } FR_RFSYMBHADR_16B_tag;

   typedef union {   /* Receive FIFO System Memory Base Address Low Register */
      uint16_t R;
      struct {
         uint16_t:4;
         uint16_t  SMBA_15_4:12;      /* System Memory Base Address */
      } B;
   } FR_RFSYMBLADR_16B_tag;

   typedef union {   /* Receive FIFO Periodic Timer Register */
      uint16_t R;
      struct {
         uint16_t:2;
         uint16_t  PTD:14;            /* Periodic Timer Duration */
      } B;
   } FR_RFPTR_16B_tag;

   typedef union {   /* Receive FIFO Fill Level and Pop Count Register */
      uint16_t R;
      struct {
         uint16_t  FLPCB:8;           /* Fill Level and Pop Count Channel B */
         uint16_t  FLPCA:8;           /* Fill Level and Pop Count Channel A */
      } B;
   } FR_RFFLPCR_16B_tag;

   typedef union {   /* ECC Error Interrupt Flag and Enable Register */
      uint16_t R;
      struct {
         uint16_t  LRNE_OF:1;         /* LRAM Non-Corrected Error Overflow Flag */
         uint16_t  LRCE_OF:1;         /* LRAM Corrected Error Overflow Flag */
         uint16_t  DRNE_OF:1;         /* DRAM Non-Corrected Error Overflow Flag */
         uint16_t  DRCE_OF:1;         /* DRAM Corrected Error Overflow Flag */
         uint16_t  LRNE_IF:1;         /* LRAM Non-Corrected Error Interrupt Flag */
         uint16_t  LRCE_IF:1;         /* LRAM Corrected Error Interrupt Flag */
         uint16_t  DRNE_IF:1;         /* DRAM Non-Corrected Error Interrupt Flag */
         uint16_t  DRCE_IF:1;         /* DRAM Corrected Error Interrupt Flag */
         uint16_t:4;
         uint16_t  LRNE_IE:1;         /* LRAM Non-Corrected Error Interrupt Enable */
         uint16_t  LRCE_IE:1;         /* LRAM Corrected Error Interrupt Enable */
         uint16_t  DRNE_IE:1;         /* DRAM Non-Corrected Error Interrupt Enable */
         uint16_t  DRCE_IE:1;         /* DRAM Corrected Error Interrupt Enable */
      } B;
   } FR_EEIFER_16B_tag;

   typedef union {   /* ECC Error Report and Injection Control Register */
      uint16_t R;
      struct {
         uint16_t  BSY:1;             /* Register Update Busy */
         uint16_t:5;
         uint16_t  ERS:2;             /* Error Report Select */
         uint16_t:3;
         uint16_t  ERM:1;             /* Error Report Mode */
         uint16_t:2;
         uint16_t  EIM:1;             /* Error Injection Mode */
         uint16_t  EIE:1;             /* Error Injection Enable */
      } B;
   } FR_EERICR_16B_tag;

