RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
   typedef union {   /* ECC Error Report Adress Register */
      uint16_t R;
      struct {
         uint16_t  MID:1;             /* Memory Identifier */
         uint16_t  BANK:3;            /* Memory Bank */
         uint16_t  ADDR:12;           /* Memory Address */
      } B;
   } FR_EERAR_16B_tag;

   typedef union {   /* ECC Error Report Data Register */
      uint16_t R;
      struct {
         uint16_t  DATA:16;           /* Data */
      } B;
   } FR_EERDR_16B_tag;

   typedef union {   /* ECC Error Report Code Register */
      uint16_t R;
      struct {
         uint16_t:11;
         uint16_t  CODE:5;            /* Code */
      } B;
   } FR_EERCR_16B_tag;

   typedef union {   /* ECC Error Injection Address Register */
      uint16_t R;
      struct {
         uint16_t  MID:1;             /* Memory Identifier */
         uint16_t  BANK:3;            /* Memory Bank */
         uint16_t  ADDR:12;           /* Memory Address */
      } B;
   } FR_EEIAR_16B_tag;

   typedef union {   /* ECC Error Injection Data Register */
      uint16_t R;
      struct {
         uint16_t  DATA:16;           /* Data */
      } B;
   } FR_EEIDR_16B_tag;

   typedef union {   /* ECC Error Injection Code Register */
      uint16_t R;
      struct {
         uint16_t:11;
         uint16_t  CODE:5;            /* Code */
      } B;
   } FR_EEICR_16B_tag;


   /* Register layout for all registers MBCCSR... */

   typedef union {   /* Message Buffer Configuration Control Status Register */
      uint16_t R;
      struct {
         uint16_t:1;
         uint16_t  MCM:1;             /* Message Buffer Commit Mode */
         uint16_t  MBT:1;             /* Message Buffer Type */
         uint16_t  MTD:1;             /* Message Buffer Transfer Direction */
         uint16_t  CMT:1;             /* Commit for Transmission */
         uint16_t  EDT:1;             /* Enable/Disable Trigger */
         uint16_t  LCKT:1;            /* Lock/Unlock Trigger */
         uint16_t  MBIE:1;            /* Message Buffer Interrupt Enable */
         uint16_t:3;
         uint16_t  DUP:1;             /* Data Updated */
         uint16_t  DVAL:1;            /* DataValid */
         uint16_t  EDS:1;             /* Enable/Disable Status */
         uint16_t  LCKS:1;            /* LockStatus */
         uint16_t  MBIF:1;            /* Message Buffer Interrupt Flag */
      } B;
   } FR_MBCCSR_16B_tag;


   /* Register layout for all registers MBCCFR... */

   typedef union {   /* Message Buffer Cycle Counter Filter Register */
      uint16_t R;
      struct {
         uint16_t  MTM:1;             /* Message Buffer Transmission Mode */
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CHA:1;             /* Channel Assignment */
#else
         uint16_t  CHNLA:1;             /* deprecated name - please avoid */
#endif
#ifndef USE_FIELD_ALIASES_FR
         uint16_t  CHB:1;             /* Channel Assignment */
#else
         uint16_t  CHNLB:1;             /* deprecated name - please avoid */
#endif
         uint16_t  CCFE:1;            /* Cycle Counter Filtering Enable */
         uint16_t  CCFMSK:6;          /* Cycle Counter Filtering Mask */
         uint16_t  CCFVAL:6;          /* Cycle Counter Filtering Value */
      } B;
   } FR_MBCCFR_16B_tag;


   /* Register layout for all registers MBFIDR... */

   typedef union {   /* Message Buffer Frame ID Register */
      uint16_t R;
      struct {
         uint16_t:5;
         uint16_t  FID:11;            /* Frame ID */
      } B;
   } FR_MBFIDR_16B_tag;


   /* Register layout for all registers MBIDXR... */

   typedef union {   /* Message Buffer Index Register */
      uint16_t R;
      struct {
         uint16_t:9;
         uint16_t  MBIDX:7;           /* Message Buffer Index */
      } B;
   } FR_MBIDXR_16B_tag;


   /* Register layout for generated register(s) NMVR... */

   typedef union {   /*  */
      uint16_t R;
   } FR_NMVR_16B_tag;




   /* Register layout for generated register(s) SSCR... */

   typedef union {   /*  */
      uint16_t R;
   } FR_SSCR_16B_tag;


   typedef struct FR_MB_struct_tag {

                 /* Message Buffer Configuration Control Status Register */
      FR_MBCCSR_16B_tag MBCCSR;           /* relative offset: 0x0000 */
                         /* Message Buffer Cycle Counter Filter Register */
      FR_MBCCFR_16B_tag MBCCFR;           /* relative offset: 0x0002 */
                                     /* Message Buffer Frame ID Register */
      FR_MBFIDR_16B_tag MBFIDR;           /* relative offset: 0x0004 */
                                        /* Message Buffer Index Register */
      FR_MBIDXR_16B_tag MBIDXR;           /* relative offset: 0x0006 */

   } FR_MB_tag;


   typedef struct FR_struct_tag { /* start of FR_tag */
                                                /* Module Version Number */
      FR_MVR_16B_tag MVR;                  /* offset: 0x0000 size: 16 bit */
                                        /* Module Configuration Register */
      FR_MCR_16B_tag MCR;                  /* offset: 0x0002 size: 16 bit */
      union {
         FR_SYMBADHR_16B_tag SYSBADHR;     /* deprecated - please avoid */

                                      /* SYSTEM MEMORY BASE ADD HIGH REG */
         FR_SYMBADHR_16B_tag SYMBADHR;     /* offset: 0x0004 size: 16 bit */

      };
      union {
         FR_SYMBADLR_16B_tag SYSBADLR;     /* deprecated - please avoid */

                                      /* SYSTEM MEMORY BASE ADD LOW  REG */
         FR_SYMBADLR_16B_tag SYMBADLR;     /* offset: 0x0006 size: 16 bit */

      };
                                       /* STROBE SIGNAL CONTROL REGISTER */
      FR_STBSCR_16B_tag STBSCR;            /* offset: 0x0008 size: 16 bit */
      int8_t FR_reserved_000A[2];
                                    /* MESSAGE BUFFER DATA SIZE REGISTER */
      FR_MBDSR_16B_tag MBDSR;              /* offset: 0x000C size: 16 bit */
                             /* MESS. BUFFER SEG. SIZE & UTILISATION REG */
      FR_MBSSUTR_16B_tag MBSSUTR;          /* offset: 0x000E size: 16 bit */
      union {
                                              /* PE DRAM ACCESS REGISTER */
         FR_PEDRAR_16B_tag PEDRAR;         /* offset: 0x0010 size: 16 bit */

         FR_PEDRAR_16B_tag PADR;           /* deprecated - please avoid */

