RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
      };
      union {
                                                /* PE DRAM DATA REGISTER */
         FR_PEDRDR_16B_tag PEDRDR;         /* offset: 0x0012 size: 16 bit */

         FR_PEDRDR_16B_tag PDAR;           /* deprecated - please avoid */

      };
                                       /* PROTOCOL OPERATION CONTROL REG */
      FR_POCR_16B_tag POCR;                /* offset: 0x0014 size: 16 bit */
                                   /* GLOBAL INTERRUPT FLAG & ENABLE REG */
      FR_GIFER_16B_tag GIFER;              /* offset: 0x0016 size: 16 bit */
                                   /* PROTOCOL INTERRUPT FLAG REGISTER 0 */
      FR_PIFR0_16B_tag PIFR0;              /* offset: 0x0018 size: 16 bit */
                                   /* PROTOCOL INTERRUPT FLAG REGISTER 1 */
      FR_PIFR1_16B_tag PIFR1;              /* offset: 0x001A size: 16 bit */
                                 /* PROTOCOL INTERRUPT ENABLE REGISTER 0 */
      FR_PIER0_16B_tag PIER0;              /* offset: 0x001C size: 16 bit */
                                 /* PROTOCOL INTERRUPT ENABLE REGISTER 1 */
      FR_PIER1_16B_tag PIER1;              /* offset: 0x001E size: 16 bit */
                                              /* CHI ERROR FLAG REGISTER */
      FR_CHIERFR_16B_tag CHIERFR;          /* offset: 0x0020 size: 16 bit */
                             /* Message Buffer Interrupt Vector Register */
      FR_MBIVEC_16B_tag MBIVEC;            /* offset: 0x0022 size: 16 bit */
                              /* Channel A Status Error Counter Register */
      FR_CASERCR_16B_tag CASERCR;          /* offset: 0x0024 size: 16 bit */
                              /* Channel B Status Error Counter Register */
      FR_CBSERCR_16B_tag CBSERCR;          /* offset: 0x0026 size: 16 bit */
                                           /* Protocol Status Register 0 */
      FR_PSR0_16B_tag PSR0;                /* offset: 0x0028 size: 16 bit */
                                           /* Protocol Status Register 1 */
      FR_PSR1_16B_tag PSR1;                /* offset: 0x002A size: 16 bit */
                                           /* Protocol Status Register 2 */
      FR_PSR2_16B_tag PSR2;                /* offset: 0x002C size: 16 bit */
                                           /* Protocol Status Register 3 */
      FR_PSR3_16B_tag PSR3;                /* offset: 0x002E size: 16 bit */
                                           /* Macrotick Counter Register */
      FR_MTCTR_16B_tag MTCTR;              /* offset: 0x0030 size: 16 bit */
                                               /* Cycle Counter Register */
      FR_CYCTR_16B_tag CYCTR;              /* offset: 0x0032 size: 16 bit */
                                      /* Slot Counter Channel A Register */
      FR_SLTCTAR_16B_tag SLTCTAR;          /* offset: 0x0034 size: 16 bit */
                                      /* Slot Counter Channel B Register */
      FR_SLTCTBR_16B_tag SLTCTBR;          /* offset: 0x0036 size: 16 bit */
                                       /* Rate Correction Value Register */
      FR_RTCORVR_16B_tag RTCORVR;          /* offset: 0x0038 size: 16 bit */
                                     /* Offset Correction Value Register */
      FR_OFCORVR_16B_tag OFCORVR;          /* offset: 0x003A size: 16 bit */
      union {
         FR_CIFR_16B_tag CIFRR;            /* deprecated - please avoid */

                                     /* Combined Interrupt Flag Register */
         FR_CIFR_16B_tag CIFR;             /* offset: 0x003C size: 16 bit */

      };
                               /* System Memory Access Time-Out Register */
      FR_SYMATOR_16B_tag SYMATOR;          /* offset: 0x003E size: 16 bit */
                                          /* Sync Frame Counter Register */
      FR_SFCNTR_16B_tag SFCNTR;            /* offset: 0x0040 size: 16 bit */
                                     /* Sync Frame Table Offset Register */
      FR_SFTOR_16B_tag SFTOR;              /* offset: 0x0042 size: 16 bit */
             /* Sync Frame Table Configuration, Control, Status Register */
      FR_SFTCCSR_16B_tag SFTCCSR;          /* offset: 0x0044 size: 16 bit */
                                       /* Sync Frame ID Rejection Filter */
      FR_SFIDRFR_16B_tag SFIDRFR;          /* offset: 0x0046 size: 16 bit */
                       /* Sync Frame ID Acceptance Filter Value Register */
      FR_SFIDAFVR_16B_tag SFIDAFVR;        /* offset: 0x0048 size: 16 bit */
                        /* Sync Frame ID Acceptance Filter Mask Register */
      FR_SFIDAFMR_16B_tag SFIDAFMR;        /* offset: 0x004A size: 16 bit */
      union {
         FR_NMVR_16B_tag NMVR[6];          /* offset: 0x004C  (0x0002 x 6) */

         struct {
                                  /* Network Management Vector Register0 */
            FR_NMVR0_16B_tag NMVR0;        /* offset: 0x004C size: 16 bit */
                                  /* Network Management Vector Register1 */
            FR_NMVR1_16B_tag NMVR1;        /* offset: 0x004E size: 16 bit */
                                  /* Network Management Vector Register2 */
            FR_NMVR2_16B_tag NMVR2;        /* offset: 0x0050 size: 16 bit */
                                  /* Network Management Vector Register3 */
            FR_NMVR3_16B_tag NMVR3;        /* offset: 0x0052 size: 16 bit */
                                  /* Network Management Vector Register4 */
            FR_NMVR4_16B_tag NMVR4;        /* offset: 0x0054 size: 16 bit */
                                  /* Network Management Vector Register5 */
            FR_NMVR5_16B_tag NMVR5;        /* offset: 0x0056 size: 16 bit */
         };

      };
                            /* Network Management Vector Length Register */
      FR_NMVLR_16B_tag NMVLR;              /* offset: 0x0058 size: 16 bit */
                             /* Timer Configuration and Control Register */
      FR_TICCR_16B_tag TICCR;              /* offset: 0x005A size: 16 bit */
                                           /* Timer 1 Cycle Set Register */
      FR_TI1CYSR_16B_tag TI1CYSR;          /* offset: 0x005C size: 16 bit */
      union {
                                    /* Timer 1 Macrotick Offset Register */
         FR_TI1MTOR_16B_tag TI1MTOR;       /* offset: 0x005E size: 16 bit */

