RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         FR_TI1MTOR_16B_tag T1MTOR;        /* deprecated - please avoid */

      };
                                     /* Timer 2 Configuration Register 0 */
      FR_TI2CR0_16B_tag TI2CR0;            /* offset: 0x0060 size: 16 bit */
                                     /* Timer 2 Configuration Register 1 */
      FR_TI2CR1_16B_tag TI2CR1;            /* offset: 0x0062 size: 16 bit */
                                       /* Slot Status Selection Register */
      FR_SSSR_16B_tag SSSR;                /* offset: 0x0064 size: 16 bit */
                               /* Slot Status Counter Condition Register */
      FR_SSCCR_16B_tag SSCCR;              /* offset: 0x0066 size: 16 bit */
      union {
         FR_SSR_16B_tag SSR[8];            /* offset: 0x0068  (0x0002 x 8) */

         struct {
                                                /* Slot Status Register0 */
            FR_SSR_16B_tag SSR0;          /* offset: 0x0068 size: 16 bit */
                                                /* Slot Status Register1 */
            FR_SSR_16B_tag SSR1;          /* offset: 0x006A size: 16 bit */
                                                /* Slot Status Register2 */
            FR_SSR_16B_tag SSR2;          /* offset: 0x006C size: 16 bit */
                                                /* Slot Status Register3 */
            FR_SSR_16B_tag SSR3;          /* offset: 0x006E size: 16 bit */
                                                /* Slot Status Register4 */
            FR_SSR_16B_tag SSR4;          /* offset: 0x0070 size: 16 bit */
                                                /* Slot Status Register5 */
            FR_SSR_16B_tag SSR5;          /* offset: 0x0072 size: 16 bit */
                                                /* Slot Status Register6 */
            FR_SSR_16B_tag SSR6;          /* offset: 0x0074 size: 16 bit */
                                                /* Slot Status Register7 */
            FR_SSR_16B_tag SSR7;          /* offset: 0x0076 size: 16 bit */
         };

      };
      union {
         FR_SSCR_16B_tag SSCR[4];          /* offset: 0x0078  (0x0002 x 4) */

         struct {
                                        /* Slot Status Counter Register0 */
            FR_SSCR0_16B_tag SSCR0;        /* offset: 0x0078 size: 16 bit */
                                        /* Slot Status Counter Register1 */
            FR_SSCR1_16B_tag SSCR1;        /* offset: 0x007A size: 16 bit */
                                        /* Slot Status Counter Register2 */
            FR_SSCR2_16B_tag SSCR2;        /* offset: 0x007C size: 16 bit */
                                        /* Slot Status Counter Register3 */
            FR_SSCR3_16B_tag SSCR3;        /* offset: 0x007E size: 16 bit */
         };

      };
                                         /* MTS A Configuration Register */
      FR_MTSACFR_16B_tag MTSACFR;          /* offset: 0x0080 size: 16 bit */
                                         /* MTS B Configuration Register */
      FR_MTSBCFR_16B_tag MTSBCFR;          /* offset: 0x0082 size: 16 bit */
                                 /* Receive Shadow Buffer Index Register */
      FR_RSBIR_16B_tag RSBIR;              /* offset: 0x0084 size: 16 bit */
      union {
                        /* Receive FIFO Watermark and Selection Register */
         FR_RFWMSR_16B_tag RFWMSR;         /* offset: 0x0086 size: 16 bit */

         FR_RFWMSR_16B_tag RFSR;           /* deprecated - please avoid */

      };
      union {
         FR_RF_RFSIR_16B_tag RFSIR;        /* deprecated - please avoid */

                                    /* Receive FIFO Start Index Register */
         FR_RF_RFSIR_16B_tag RF_RFSIR;     /* offset: 0x0088 size: 16 bit */

      };
                                 /* Receive FIFO Depth and Size Register */
      FR_RFDSR_16B_tag RFDSR;              /* offset: 0x008A size: 16 bit */
                                   /* Receive FIFO A Read Index Register */
      FR_RFARIR_16B_tag RFARIR;            /* offset: 0x008C size: 16 bit */
                                   /* Receive FIFO B Read Index Register */
      FR_RFBRIR_16B_tag RFBRIR;            /* offset: 0x008E size: 16 bit */
             /* Receive FIFO Message ID Acceptance Filter Value Register */
      FR_RFMIDAFVR_16B_tag RFMIDAFVR;      /* offset: 0x0090 size: 16 bit */
      union {
              /* Receive FIFO Message ID Acceptance Filter Mask Register */
         FR_RFMIDAFMR_16B_tag RFMIDAFMR;   /* offset: 0x0092 size: 16 bit */

         FR_RFMIDAFMR_16B_tag RFMIAFMR;    /* deprecated - please avoid */

      };
                /* Receive FIFO Frame ID Rejection Filter Value Register */
      FR_RFFIDRFVR_16B_tag RFFIDRFVR;      /* offset: 0x0094 size: 16 bit */
                 /* Receive FIFO Frame ID Rejection Filter Mask Register */
      FR_RFFIDRFMR_16B_tag RFFIDRFMR;      /* offset: 0x0096 size: 16 bit */
                     /* Receive FIFO Range Filter Configuration Register */
      FR_RFRFCFR_16B_tag RFRFCFR;          /* offset: 0x0098 size: 16 bit */
                           /* Receive FIFO Range Filter Control Register */
      FR_RFRFCTR_16B_tag RFRFCTR;          /* offset: 0x009A size: 16 bit */
                        /* Last Dynamic Transmit Slot Channel A Register */
      FR_LDTXSLAR_16B_tag LDTXSLAR;        /* offset: 0x009C size: 16 bit */
                        /* Last Dynamic Transmit Slot Channel B Register */
      FR_LDTXSLBR_16B_tag LDTXSLBR;        /* offset: 0x009E size: 16 bit */
                                    /* Protocol Configuration Register 0 */
      FR_PCR0_16B_tag PCR0;                /* offset: 0x00A0 size: 16 bit */
                                    /* Protocol Configuration Register 1 */
      FR_PCR1_16B_tag PCR1;                /* offset: 0x00A2 size: 16 bit */
                                    /* Protocol Configuration Register 2 */
      FR_PCR2_16B_tag PCR2;                /* offset: 0x00A4 size: 16 bit */
                                    /* Protocol Configuration Register 3 */
      FR_PCR3_16B_tag PCR3;                /* offset: 0x00A6 size: 16 bit */
                                    /* Protocol Configuration Register 4 */
      FR_PCR4_16B_tag PCR4;                /* offset: 0x00A8 size: 16 bit */
                                    /* Protocol Configuration Register 5 */
      FR_PCR5_16B_tag PCR5;                /* offset: 0x00AA size: 16 bit */
                                    /* Protocol Configuration Register 6 */
      FR_PCR6_16B_tag PCR6;                /* offset: 0x00AC size: 16 bit */
                                    /* Protocol Configuration Register 7 */
      FR_PCR7_16B_tag PCR7;                /* offset: 0x00AE size: 16 bit */
                                    /* Protocol Configuration Register 8 */
      FR_PCR8_16B_tag PCR8;                /* offset: 0x00B0 size: 16 bit */
                                    /* Protocol Configuration Register 9 */
      FR_PCR9_16B_tag PCR9;                /* offset: 0x00B2 size: 16 bit */
                                   /* Protocol Configuration Register 10 */
      FR_PCR10_16B_tag PCR10;              /* offset: 0x00B4 size: 16 bit */
                                   /* Protocol Configuration Register 11 */
      FR_PCR11_16B_tag PCR11;              /* offset: 0x00B6 size: 16 bit */
                                   /* Protocol Configuration Register 12 */
      FR_PCR12_16B_tag PCR12;              /* offset: 0x00B8 size: 16 bit */
                                   /* Protocol Configuration Register 13 */
      FR_PCR13_16B_tag PCR13;              /* offset: 0x00BA size: 16 bit */
                                   /* Protocol Configuration Register 14 */
      FR_PCR14_16B_tag PCR14;              /* offset: 0x00BC size: 16 bit */
                                   /* Protocol Configuration Register 15 */
      FR_PCR15_16B_tag PCR15;              /* offset: 0x00BE size: 16 bit */
                                   /* Protocol Configuration Register 16 */
      FR_PCR16_16B_tag PCR16;              /* offset: 0x00C0 size: 16 bit */
                                   /* Protocol Configuration Register 17 */
      FR_PCR17_16B_tag PCR17;              /* offset: 0x00C2 size: 16 bit */
                                   /* Protocol Configuration Register 18 */
      FR_PCR18_16B_tag PCR18;              /* offset: 0x00C4 size: 16 bit */
                                   /* Protocol Configuration Register 19 */
      FR_PCR19_16B_tag PCR19;              /* offset: 0x00C6 size: 16 bit */
                                   /* Protocol Configuration Register 20 */
      FR_PCR20_16B_tag PCR20;              /* offset: 0x00C8 size: 16 bit */
                                   /* Protocol Configuration Register 21 */
      FR_PCR21_16B_tag PCR21;              /* offset: 0x00CA size: 16 bit */
                                   /* Protocol Configuration Register 22 */
      FR_PCR22_16B_tag PCR22;              /* offset: 0x00CC size: 16 bit */
                                   /* Protocol Configuration Register 23 */
      FR_PCR23_16B_tag PCR23;              /* offset: 0x00CE size: 16 bit */
                                   /* Protocol Configuration Register 24 */
      FR_PCR24_16B_tag PCR24;              /* offset: 0x00D0 size: 16 bit */
                                   /* Protocol Configuration Register 25 */
      FR_PCR25_16B_tag PCR25;              /* offset: 0x00D2 size: 16 bit */
                                   /* Protocol Configuration Register 26 */
      FR_PCR26_16B_tag PCR26;              /* offset: 0x00D4 size: 16 bit */
                                   /* Protocol Configuration Register 27 */
      FR_PCR27_16B_tag PCR27;              /* offset: 0x00D6 size: 16 bit */
                                   /* Protocol Configuration Register 28 */
      FR_PCR28_16B_tag PCR28;              /* offset: 0x00D8 size: 16 bit */
                                   /* Protocol Configuration Register 29 */
      FR_PCR29_16B_tag PCR29;              /* offset: 0x00DA size: 16 bit */
                                   /* Protocol Configuration Register 30 */
      FR_PCR30_16B_tag PCR30;              /* offset: 0x00DC size: 16 bit */
      int8_t FR_reserved_00DE[10];
                /* Receive FIFO System Memory Base Address High Register */
      FR_RFSYMBHADR_16B_tag RFSYMBHADR;    /* offset: 0x00E8 size: 16 bit */
                 /* Receive FIFO System Memory Base Address Low Register */
      FR_RFSYMBLADR_16B_tag RFSYMBLADR;    /* offset: 0x00EA size: 16 bit */
                                 /* Receive FIFO Periodic Timer Register */
      FR_RFPTR_16B_tag RFPTR;              /* offset: 0x00EC size: 16 bit */
                       /* Receive FIFO Fill Level and Pop Count Register */
      FR_RFFLPCR_16B_tag RFFLPCR;          /* offset: 0x00EE size: 16 bit */
                         /* ECC Error Interrupt Flag and Enable Register */
      FR_EEIFER_16B_tag EEIFER;            /* offset: 0x00F0 size: 16 bit */
                      /* ECC Error Report and Injection Control Register */
      FR_EERICR_16B_tag EERICR;            /* offset: 0x00F2 size: 16 bit */
                                     /* ECC Error Report Adress Register */
      FR_EERAR_16B_tag EERAR;              /* offset: 0x00F4 size: 16 bit */
                                       /* ECC Error Report Data Register */
      FR_EERDR_16B_tag EERDR;              /* offset: 0x00F6 size: 16 bit */
                                       /* ECC Error Report Code Register */
      FR_EERCR_16B_tag EERCR;              /* offset: 0x00F8 size: 16 bit */
                                 /* ECC Error Injection Address Register */
      FR_EEIAR_16B_tag EEIAR;              /* offset: 0x00FA size: 16 bit */
                                    /* ECC Error Injection Data Register */
      FR_EEIDR_16B_tag EEIDR;              /* offset: 0x00FC size: 16 bit */
                                    /* ECC Error Injection Code Register */
      FR_EEICR_16B_tag EEICR;              /* offset: 0x00FE size: 16 bit */
      union {
                                                     /*  Register set MB */
         FR_MB_tag MB[64];                 /* offset: 0x0100  (0x0008 x 64) */
		 
		 FR_MB_tag MBCCS[64];                 /* offset: 0x0100  (0x0008 x 64) */

