RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc564xL.h
         struct {
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR0;     /* offset: 0x0100 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR0;     /* offset: 0x0102 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR0;     /* offset: 0x0104 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR0;     /* offset: 0x0106 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR1;     /* offset: 0x0108 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR1;     /* offset: 0x010A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR1;     /* offset: 0x010C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR1;     /* offset: 0x010E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR2;     /* offset: 0x0110 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR2;     /* offset: 0x0112 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR2;     /* offset: 0x0114 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR2;     /* offset: 0x0116 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR3;     /* offset: 0x0118 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR3;     /* offset: 0x011A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR3;     /* offset: 0x011C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR3;     /* offset: 0x011E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR4;     /* offset: 0x0120 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR4;     /* offset: 0x0122 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR4;     /* offset: 0x0124 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR4;     /* offset: 0x0126 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR5;     /* offset: 0x0128 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR5;     /* offset: 0x012A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR5;     /* offset: 0x012C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR5;     /* offset: 0x012E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR6;     /* offset: 0x0130 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR6;     /* offset: 0x0132 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR6;     /* offset: 0x0134 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR6;     /* offset: 0x0136 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR7;     /* offset: 0x0138 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR7;     /* offset: 0x013A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR7;     /* offset: 0x013C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR7;     /* offset: 0x013E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR8;     /* offset: 0x0140 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR8;     /* offset: 0x0142 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR8;     /* offset: 0x0144 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR8;     /* offset: 0x0146 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR9;     /* offset: 0x0148 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR9;     /* offset: 0x014A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR9;     /* offset: 0x014C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR9;     /* offset: 0x014E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR10;    /* offset: 0x0150 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR10;    /* offset: 0x0152 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR10;    /* offset: 0x0154 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR10;    /* offset: 0x0156 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR11;    /* offset: 0x0158 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR11;    /* offset: 0x015A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR11;    /* offset: 0x015C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR11;    /* offset: 0x015E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR12;    /* offset: 0x0160 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR12;    /* offset: 0x0162 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR12;    /* offset: 0x0164 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR12;    /* offset: 0x0166 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR13;    /* offset: 0x0168 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR13;    /* offset: 0x016A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR13;    /* offset: 0x016C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR13;    /* offset: 0x016E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR14;    /* offset: 0x0170 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR14;    /* offset: 0x0172 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR14;    /* offset: 0x0174 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR14;    /* offset: 0x0176 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR15;    /* offset: 0x0178 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR15;    /* offset: 0x017A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR15;    /* offset: 0x017C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR15;    /* offset: 0x017E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR16;    /* offset: 0x0180 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR16;    /* offset: 0x0182 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR16;    /* offset: 0x0184 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR16;    /* offset: 0x0186 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR17;    /* offset: 0x0188 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR17;    /* offset: 0x018A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR17;    /* offset: 0x018C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR17;    /* offset: 0x018E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR18;    /* offset: 0x0190 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR18;    /* offset: 0x0192 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR18;    /* offset: 0x0194 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR18;    /* offset: 0x0196 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR19;    /* offset: 0x0198 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR19;    /* offset: 0x019A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR19;    /* offset: 0x019C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR19;    /* offset: 0x019E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR20;    /* offset: 0x01A0 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR20;    /* offset: 0x01A2 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR20;    /* offset: 0x01A4 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR20;    /* offset: 0x01A6 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR21;    /* offset: 0x01A8 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR21;    /* offset: 0x01AA size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR21;    /* offset: 0x01AC size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR21;    /* offset: 0x01AE size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR22;    /* offset: 0x01B0 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR22;    /* offset: 0x01B2 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR22;    /* offset: 0x01B4 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR22;    /* offset: 0x01B6 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR23;    /* offset: 0x01B8 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR23;    /* offset: 0x01BA size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR23;    /* offset: 0x01BC size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR23;    /* offset: 0x01BE size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR24;    /* offset: 0x01C0 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR24;    /* offset: 0x01C2 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR24;    /* offset: 0x01C4 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR24;    /* offset: 0x01C6 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR25;    /* offset: 0x01C8 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR25;    /* offset: 0x01CA size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR25;    /* offset: 0x01CC size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR25;    /* offset: 0x01CE size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR26;    /* offset: 0x01D0 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR26;    /* offset: 0x01D2 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR26;    /* offset: 0x01D4 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR26;    /* offset: 0x01D6 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR27;    /* offset: 0x01D8 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR27;    /* offset: 0x01DA size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR27;    /* offset: 0x01DC size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR27;    /* offset: 0x01DE size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR28;    /* offset: 0x01E0 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR28;    /* offset: 0x01E2 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR28;    /* offset: 0x01E4 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR28;    /* offset: 0x01E6 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR29;    /* offset: 0x01E8 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR29;    /* offset: 0x01EA size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR29;    /* offset: 0x01EC size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR29;    /* offset: 0x01EE size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR30;    /* offset: 0x01F0 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR30;    /* offset: 0x01F2 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR30;    /* offset: 0x01F4 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR30;    /* offset: 0x01F6 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR31;    /* offset: 0x01F8 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR31;    /* offset: 0x01FA size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR31;    /* offset: 0x01FC size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR31;    /* offset: 0x01FE size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR32;    /* offset: 0x0200 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR32;    /* offset: 0x0202 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR32;    /* offset: 0x0204 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR32;    /* offset: 0x0206 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR33;    /* offset: 0x0208 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR33;    /* offset: 0x020A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR33;    /* offset: 0x020C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR33;    /* offset: 0x020E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR34;    /* offset: 0x0210 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR34;    /* offset: 0x0212 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR34;    /* offset: 0x0214 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR34;    /* offset: 0x0216 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR35;    /* offset: 0x0218 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR35;    /* offset: 0x021A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR35;    /* offset: 0x021C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR35;    /* offset: 0x021E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR36;    /* offset: 0x0220 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR36;    /* offset: 0x0222 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR36;    /* offset: 0x0224 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR36;    /* offset: 0x0226 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR37;    /* offset: 0x0228 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR37;    /* offset: 0x022A size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR37;    /* offset: 0x022C size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR37;    /* offset: 0x022E size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
            FR_MBCCSR_16B_tag MBCCSR38;    /* offset: 0x0230 size: 16 bit */
                         /* Message Buffer Cycle Counter Filter Register */
            FR_MBCCFR_16B_tag MBCCFR38;    /* offset: 0x0232 size: 16 bit */
                                     /* Message Buffer Frame ID Register */
            FR_MBFIDR_16B_tag MBFIDR38;    /* offset: 0x0234 size: 16 bit */
                                        /* Message Buffer Index Register */
            FR_MBIDXR_16B_tag MBIDXR38;    /* offset: 0x0236 size: 16 bit */
                 /* Message Buffer Configuration Control Status Register */
